# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Work\Git\rt-thread\bsp\CY8C63_PM\CY8C6347BZI\Test.cydsn\Test.cyprj
# Date: Wed, 30 Oct 2019 07:15:19 GMT
#set_units -time ns
create_clock -name {CyWCO} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/wco}]]
create_clock -name {CyClk_LF} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyPLL0} -period 6.9444444444444438 -waveform {0 3.47222222222222} [list [get_pins {ClockBlock/pll_0}]]
create_clock -name {CyClk_HF0} -period 6.9444444444444438 -waveform {0 3.47222222222222} [list [get_pins {ClockBlock/hfclk_0}]]
create_clock -name {CyClk_Fast} -period 6.9444444444444438 -waveform {0 3.47222222222222} [list [get_pins {ClockBlock/fastclk}]]
create_clock -name {CyClk_Peri} -period 13.888888888888888 -waveform {0 6.94444444444444} [list [get_pins {ClockBlock/periclk}]]
create_generated_clock -name {CyClk_Slow} -source [get_pins {ClockBlock/periclk}] -edges {1 2 3} [list [get_pins {ClockBlock/slowclk}]]
create_generated_clock -name {CyClk_PumpPeri} -source [get_pins {ClockBlock/periclk}] -edges {1 3 7} [list [get_pins {ClockBlock/ff_div_48}]]
create_generated_clock -name {UART0_SCBCLK} -source [get_pins {ClockBlock/periclk}] -edges {1 53 103} -nominal_period 722.22222222222206 [list [get_pins {ClockBlock/ff_div_5}]]
create_clock -name {CyPeriClk_App} -period 13.888888888888888 -waveform {0 6.94444444444444} [list [get_pins {ClockBlock/periclk_App}]]
create_clock -name {CyIMO} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/imo}]]


# Component constraints for C:\Work\Git\rt-thread\bsp\CY8C63_PM\CY8C6347BZI\Test.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Work\Git\rt-thread\bsp\CY8C63_PM\CY8C6347BZI\Test.cydsn\Test.cyprj
# Date: Wed, 30 Oct 2019 07:14:54 GMT
