/*
 * Copyright (c) 2021-2024 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_ENET_H
#define HPM_ENET_H

typedef struct {
    __RW uint32_t MACCFG;                      /* 0x0: MAC Configuration Register */
    __RW uint32_t MACFF;                       /* 0x4: MAC Frame Filter */
    __RW uint32_t HASH_H;                      /* 0x8: Hash Table High Register */
    __RW uint32_t HASH_L;                      /* 0xC: Hash Table Low Register */
    __RW uint32_t GMII_ADDR;                   /* 0x10: GMII Address Register */
    __RW uint32_t GMII_DATA;                   /* 0x14: GMII Data Register */
    __RW uint32_t FLOWCTRL;                    /* 0x18: Flow Control Register */
    __RW uint32_t VLAN_TAG;                    /* 0x1C: VLAN Tag Register */
    __R  uint8_t  RESERVED0[8];                /* 0x20 - 0x27: Reserved */
    __RW uint32_t RWKFRMFILT;                  /* 0x28: Remote Wake-Up Frame Filter Register */
    __RW uint32_t PMT_CSR;                     /* 0x2C: PMT Control and Status Register */
    __RW uint32_t LPI_CSR;                     /* 0x30: LPI Control and Status Register */
    __RW uint32_t LPI_TCR;                     /* 0x34: LPI Timers Control Register */
    __R  uint32_t INTR_STATUS;                 /* 0x38: Interrupt Status Register */
    __RW uint32_t INTR_MASK;                   /* 0x3C: Interrupt Mask Register */
    __RW uint32_t MAC_ADDR_0_HIGH;             /* 0x40: MAC Address 0 High Register */
    __RW uint32_t MAC_ADDR_0_LOW;              /* 0x44: MAC Address 0 Low Register */
    struct {
        __RW uint32_t HIGH;                    /* 0x48: MAC Address High Register */
        __RW uint32_t LOW;                     /* 0x4C: MAC Address Low Register */
    } MAC_ADDR[4];
    __R  uint8_t  RESERVED1[112];              /* 0x68 - 0xD7: Reserved */
    __RW uint32_t XMII_CSR;                    /* 0xD8: SGMII/RGMII/SMII Control and Status Register */
    __RW uint32_t WDOG_WTO;                    /* 0xDC: Watchdog Timeout Register */
    __R  uint8_t  RESERVED2[32];               /* 0xE0 - 0xFF: Reserved */
    __RW uint32_t MMC_CNTRL;                   /* 0x100: MMC Control establishes the operating mode of MMC. */
    __RW uint32_t MMC_INTR_RX;                 /* 0x104: MMC Receive Interrupt */
    __RW uint32_t MMC_INTR_TX;                 /* 0x108: MMC Transmit Interrupt */
    __RW uint32_t MMC_INTR_MASK_RX;            /* 0x10C: MMC Receive Interrupt mask */
    __RW uint32_t MMC_INTR_MASK_TX;            /* 0x110: MMC Transmit Interrupt Mask */
    __R  uint8_t  RESERVED3[16];               /* 0x114 - 0x123: Reserved */
    __RW uint32_t TX64OCTETS_GB;               /* 0x124: Number of good and bad frames transmitted with length 64 bytes,
exclusive of preamble and retried frames. */
    __RW uint32_t TX65TO127OCTETS_GB;          /* 0x128: Number of good and bad frames transmitted with length between
65 and 127 (inclusive) bytes, exclusive of preamble and retried
frames. */
    __RW uint32_t TX128TO255OCTETS_GB;         /* 0x12C: Number of good and bad frames transmitted with length between
128 and 255 (inclusive) bytes, exclusive of preamble and retried
frames. */
    __RW uint32_t TX256TO511OCTETS_GB;         /* 0x130: Number of good and bad frames transmitted with length between
256 and 511 (inclusive) bytes, exclusive of preamble and retried
frames. */
    __RW uint32_t TX512TO1023OCTETS_GB;        /* 0x134: Number of good and bad frames transmitted with length between
512 and 1,023 (inclusive) bytes, exclusive of preamble and retried
frames. */
    __RW uint32_t TX1024TOMAXOCTETS_GB;        /* 0x138: Number of good and bad frames transmitted with length between
1,024 and maxsize (inclusive) bytes, exclusive of preamble and
retried frames. */
    __R  uint8_t  RESERVED4[68];               /* 0x13C - 0x17F: Reserved */
    __RW uint32_t RXFRAMECOUNT_GB;             /* 0x180: Number of good and bad frames received */
    __R  uint8_t  RESERVED5[124];              /* 0x184 - 0x1FF: Reserved */
    __RW uint32_t MMC_IPC_INTR_MASK_RX;        /* 0x200: MMC IPC Receive Checksum Offload Interrupt Mask maintains
the mask for the interrupt generated from the receive IPC statistic
counters. */
    __R  uint8_t  RESERVED6[4];                /* 0x204 - 0x207: Reserved */
    __RW uint32_t MMC_IPC_INTR_RX;             /* 0x208: MMC Receive Checksum Offload Interrupt maintains the interrupt
that the receive IPC statistic counters generate. See Table 4-25
for further detail. */
    __R  uint8_t  RESERVED7[4];                /* 0x20C - 0x20F: Reserved */
    __RW uint32_t RXIPV4_GD_FMS;               /* 0x210: Number of good IPv4 datagrams received with the TCP, UDP, or
ICMP payload */
    __R  uint8_t  RESERVED8[492];              /* 0x214 - 0x3FF: Reserved */
    struct {
        __RW uint32_t L3_L4_CTRL;              /* 0x400: Layer 3 and Layer 4 Control Register */
        __RW uint32_t L4_ADDR;                 /* 0x404: Layer 4 Address Register */
        __R  uint8_t  RESERVED0[8];            /* 0x408 - 0x40F: Reserved */
        __RW uint32_t L3_ADDR_0;               /* 0x410: Layer 3 Address 0 Register */
        __RW uint32_t L3_ADDR_1;               /* 0x414: Layer 3 Address 1 Register */
        __RW uint32_t L3_ADDR_2;               /* 0x418: Layer 3 Address 2 Register */
        __RW uint32_t L3_ADDR_3;               /* 0x41C: Layer 3 Address 3 Register */
    } L3_L4_CFG[1];
    __R  uint8_t  RESERVED9[356];              /* 0x420 - 0x583: Reserved */
    __RW uint32_t VLAN_TAG_INC_RPL;            /* 0x584: VLAN Tag Inclusion or Replacement Register */
    __RW uint32_t VLAN_HASH;                   /* 0x588: VLAN Hash Table Register */
    __R  uint8_t  RESERVED10[372];             /* 0x58C - 0x6FF: Reserved */
    __RW uint32_t TS_CTRL;                     /* 0x700: Timestamp Control Register */
    __RW uint32_t SUB_SEC_INCR;                /* 0x704: Sub-Second Increment Register */
    __R  uint32_t SYST_SEC;                    /* 0x708: System Time - Seconds Register */
    __R  uint32_t SYST_NSEC;                   /* 0x70C: System Time - Nanoseconds Register */
    __RW uint32_t SYST_SEC_UPD;                /* 0x710: System Time - Seconds Update Register */
    __RW uint32_t SYST_NSEC_UPD;               /* 0x714: System Time - Nanoseconds Update Register */
    __RW uint32_t TS_ADDEND;                   /* 0x718: Timestamp Addend Register */
    __RW uint32_t TGTTM_SEC;                   /* 0x71C: Target Time Seconds Register */
    __RW uint32_t TGTTM_NSEC;                  /* 0x720: Target Time Nanoseconds Register */
    __RW uint32_t SYSTM_H_SEC;                 /* 0x724: System Time - Higher Word Seconds Register */
    __R  uint32_t TS_STATUS;                   /* 0x728: Timestamp Status Register */
    __RW uint32_t PPS_CTRL;                    /* 0x72C: PPS Control Register */
    __R  uint32_t AUX_TS_NSEC;                 /* 0x730: Auxiliary Timestamp - Nanoseconds Register */
    __R  uint32_t AUX_TS_SEC;                  /* 0x734: Auxiliary Timestamp - Seconds Register */
    __R  uint8_t  RESERVED11[40];              /* 0x738 - 0x75F: Reserved */
    __RW uint32_t PPS0_INTERVAL;               /* 0x760: PPS Interval Register */
    __RW uint32_t PPS0_WIDTH;                  /* 0x764: PPS Width Register */
    __R  uint8_t  RESERVED12[24];              /* 0x768 - 0x77F: Reserved */
    struct {
        __RW uint32_t TGTTM_SEC;               /* 0x780: PPS Target Time Seconds Register */
        __RW uint32_t TGTTM_NSEC;              /* 0x784: PPS Target Time Nanoseconds Register */
        __RW uint32_t INTERVAL;                /* 0x788: PPS Interval Register */
        __RW uint32_t WIDTH;                   /* 0x78C: PPS Width Register */
        __R  uint8_t  RESERVED0[16];           /* 0x790 - 0x79F: Reserved */
    } PPS[3];
    __R  uint8_t  RESERVED13[2080];            /* 0x7E0 - 0xFFF: Reserved */
    __RW uint32_t DMA_BUS_MODE;                /* 0x1000: Bus Mode Register */
    __RW uint32_t DMA_TX_POLL_DEMAND;          /* 0x1004: Transmit Poll Demand Register */
    __RW uint32_t DMA_RX_POLL_DEMAND;          /* 0x1008: Receive Poll Demand Register */
    __RW uint32_t DMA_RX_DESC_LIST_ADDR;       /* 0x100C: Receive Descriptor List Address Register */
    __RW uint32_t DMA_TX_DESC_LIST_ADDR;       /* 0x1010: Transmit Descriptor List Address Register */
    __RW uint32_t DMA_STATUS;                  /* 0x1014: Status Register */
    __RW uint32_t DMA_OP_MODE;                 /* 0x1018: Operation Mode Register */
    __RW uint32_t DMA_INTR_EN;                 /* 0x101C: Interrupt Enable Register */
    __RW uint32_t DMA_MISS_OVF_CNT;            /* 0x1020: Missed Frame And Buffer Overflow Counter Register */
    __RW uint32_t DMA_RX_INTR_WDOG;            /* 0x1024: Receive Interrupt Watchdog Timer Register */
    __RW uint32_t DMA_AXI_MODE;                /* 0x1028: AXI Bus Mode Register */
    __RW uint32_t DMA_BUS_STATUS;              /* 0x102C: AHB or AXI Status Register */
    __R  uint8_t  RESERVED14[24];              /* 0x1030 - 0x1047: Reserved */
    __RW uint32_t DMA_CURR_HOST_TX_DESC;       /* 0x1048: Current Host Transmit Descriptor Register */
    __RW uint32_t DMA_CURR_HOST_RX_DESC;       /* 0x104C: Current Host Receive Descriptor Register */
    __RW uint32_t DMA_CURR_HOST_TX_BUF;        /* 0x1050: Current Host Transmit Buffer Address Register */
    __RW uint32_t DMA_CURR_HOST_RX_BUF;        /* 0x1054: Current Host Receive Buffer Address Register */
    __R  uint8_t  RESERVED15[8112];            /* 0x1058 - 0x3007: Reserved */
    __RW uint32_t CTRL2;                       /* 0x3008: Control  Register 1 */
    __R  uint8_t  RESERVED16[28];              /* 0x300C - 0x3027: Reserved */
} ENET_Type;


/* Bitfield definition for register: MACCFG */
/*
 * SARC (RW)
 *
 * Source Address Insertion or Replacement Control
 *  This field controls the source address insertion or replacement for all transmitted frames.
 * Bit 30 specifies which MAC Address register (0 or 1) is used for source address insertion or replacement based on the values of Bits [29:28]:
 * - 2'b0x: The input signals mti_sa_ctrl_i and ati_sa_ctrl_i control the SA field generation.
 * - 2'b10: - If Bit 30 is set to 0, the MAC inserts the content of the MAC Address 0 registers (registers 16 and 17) in the SA field of all transmitted frames.
 *              - If Bit 30 is set to 1 and the Enable MAC Address Register 1 option is selected during core configuration,
 *                 the MAC inserts the content of the MAC Address 1 registers (registers 18 and 19) in the SA field of all transmitted frames.
