/*
 * Copyright (c) 2021-2024 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_SPI_H
#define HPM_SPI_H

typedef struct {
    __R  uint8_t  RESERVED0[16];               /* 0x0 - 0xF: Reserved */
    __RW uint32_t TRANSFMT;                    /* 0x10: Transfer Format Register */
    __R  uint8_t  RESERVED1[12];               /* 0x14 - 0x1F: Reserved */
    __RW uint32_t TRANSCTRL;                   /* 0x20: Transfer Control Register */
    __RW uint32_t CMD;                         /* 0x24: Command Register */
    __RW uint32_t ADDR;                        /* 0x28: Address Register */
    __RW uint32_t DATA;                        /* 0x2C: Data Register */
    __RW uint32_t CTRL;                        /* 0x30: Control Register */
    __R  uint32_t STATUS;                      /* 0x34: Status Register */
    __RW uint32_t INTREN;                      /* 0x38: Interrupt Enable Register */
    __W  uint32_t INTRST;                      /* 0x3C: Interrupt Status Register */
    __RW uint32_t TIMING;                      /* 0x40: Interface Timing Register */
    __R  uint8_t  RESERVED2[28];               /* 0x44 - 0x5F: Reserved */
    __RW uint32_t SLVST;                       /* 0x60: Slave Status Register */
    __R  uint32_t SLVDATACNT;                  /* 0x64: Slave Data Count Register */
    __R  uint8_t  RESERVED3[20];               /* 0x68 - 0x7B: Reserved */
    __R  uint32_t CONFIG;                      /* 0x7C: Configuration Register */
} SPI_Type;


/* Bitfield definition for register: TRANSFMT */
/*
 * ADDRLEN (RW)
 *
 * Address length in bytes
 * 0x0: 1 byte
 * 0x1: 2 bytes
 * 0x2: 3 bytes
 * 0x3: 4 bytes
 */
#define SPI_TRANSFMT_ADDRLEN_MASK (0x30000UL)
#define SPI_TRANSFMT_ADDRLEN_SHIFT (16U)
#define SPI_TRANSFMT_ADDRLEN_SET(x) (((uint32_t)(x) << SPI_TRANSFMT_ADDRLEN_SHIFT) & SPI_TRANSFMT_ADDRLEN_MASK)
#define SPI_TRANSFMT_ADDRLEN_GET(x) (((uint32_t)(x) & SPI_TRANSFMT_ADDRLEN_MASK) >> SPI_TRANSFMT_ADDRLEN_SHIFT)

/*
 * DATALEN (RW)
 *
 * The length of each data unit in bits
 * The actual bit number of a data unit is (DataLen + 1)
 */
#define SPI_TRANSFMT_DATALEN_MASK (0x1F00U)
#define SPI_TRANSFMT_DATALEN_SHIFT (8U)
#define SPI_TRANSFMT_DATALEN_SET(x) (((uint32_t)(x) << SPI_TRANSFMT_DATALEN_SHIFT) & SPI_TRANSFMT_DATALEN_MASK)
