/*
 * Copyright (c) 2021-2024 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_CAN_H
#define HPM_CAN_H

typedef struct {
    __RW uint32_t RBUF[20];                    /* 0x0 - 0x4C: receive buffer registers and reception time stamp */
    __RW uint32_t TBUF[18];                    /* 0x50 - 0x94: transmit buffer register */
    __R  uint32_t TTS[2];                      /* 0x98 - 0x9C: transmission time stamp, LSB 32bit */
    __RW uint32_t CMD_STA_CMD_CTRL;            /* 0xA0: config, status, command and control bits */
    __RW uint8_t  RTIE;                        /* 0xA4: Receive and Transmit Interrupt Enable Register RTIE */
    __W  uint8_t  RTIF;                        /* 0xA5: Receive and Transmit Interrupt Flag Register RTIF (0xa5) */
    __RW uint8_t  ERRINT;                      /* 0xA6: ERRor INTerrupt Enable and Flag Register ERRINT */
    __RW uint8_t  LIMIT;                       /* 0xA7: Warning Limits Register LIMIT */
    __RW uint32_t S_PRESC;                     /* 0xA8: Bit Timing Register(Slow Speed) */
    __RW uint32_t F_PRESC;                     /* 0xAC: Bit Timing Register(Fast Speed) */
    __R  uint8_t  EALCAP;                      /* 0xB0: Error and Arbitration Lost Capture Register EALCAP */
    __RW uint8_t  TDC;                         /* 0xB1: Transmitter Delay Compensation Register TDC */
    __R  uint8_t  RECNT;                       /* 0xB2: Error Counter Registers RECNT */
    __R  uint8_t  TECNT;                       /* 0xB3: Error Counter Registers TECNT */
    __RW uint8_t  ACFCTRL;                     /* 0xB4: Acceptance Filter Control Register ACFCTRL */
    __RW uint8_t  TIMECFG;                     /* 0xB5: CiA 603 Time-Stamping TIMECFG */
    __RW uint16_t ACF_EN;                      /* 0xB6: Acceptance Filter Enable ACF_EN */
    __RW uint32_t ACF;                         /* 0xB8: Acceptance CODE ACODE or ACMASK */
    __RW uint16_t VER;                         /* 0xBC: Version Information VER */
    __RW uint8_t  TBSLOT;                      /* 0xBE: TTCAN: TB Slot Pointer TBSLOT */
    __RW uint8_t  TTCFG;                       /* 0xBF: TTCAN: Time Trigger Configuration TTCFG */
    __RW uint32_t REF_MSG;                     /* 0xC0: TTCAN: Reference Message REF_MSG */
    __RW uint16_t TRIG_CFG;                    /* 0xC4: TTCAN: Trigger Configuration TRIG_CFG */
    __RW uint16_t TT_TRIG;                     /* 0xC6: TTCAN: Trigger Time TT_TRIG */
    __RW uint16_t TT_WTRIG;                    /* 0xC8: TTCAN: Watch Trigger Time TT_WTRIG */
} CAN_Type;


/* Bitfield definition for register array: RBUF */
/*
 * RBUF (RW)
 *
 * receive buffer
 */
#define CAN_RBUF_RBUF_MASK (0xFFFFFFFFUL)
#define CAN_RBUF_RBUF_SHIFT (0U)
#define CAN_RBUF_RBUF_SET(x) (((uint32_t)(x) << CAN_RBUF_RBUF_SHIFT) & CAN_RBUF_RBUF_MASK)
#define CAN_RBUF_RBUF_GET(x) (((uint32_t)(x) & CAN_RBUF_RBUF_MASK) >> CAN_RBUF_RBUF_SHIFT)

/* Bitfield definition for register array: TBUF */
/*
 * TBUF (RW)
 *
 * transmit buffer
 */
#define CAN_TBUF_TBUF_MASK (0xFFFFFFFFUL)
#define CAN_TBUF_TBUF_SHIFT (0U)
#define CAN_TBUF_TBUF_SET(x) (((uint32_t)(x) << CAN_TBUF_TBUF_SHIFT) & CAN_TBUF_TBUF_MASK)
#define CAN_TBUF_TBUF_GET(x) (((uint32_t)(x) & CAN_TBUF_TBUF_MASK) >> CAN_TBUF_TBUF_SHIFT)

/* Bitfield definition for register array: TTS */
/*
 * TTS_WRD0 (RO)
 *
 * transmission time stamp, word 0, LSB 32bit
 */
#define CAN_TTS_TTS_WRD0_MASK (0xFFFFFFFFUL)
