/*
 * Copyright (c) 2021-2024 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_PWMV2_H
#define HPM_PWMV2_H

typedef struct {
    __RW uint32_t WORK_CTRL0;                  /* 0x0:  */
    __RW uint32_t UNLOCK;                      /* 0x4:  */
    __RW uint32_t SHADOW_VAL[28];              /* 0x8 - 0x74:  */
    __RW uint32_t FORCE_MODE;                  /* 0x78:  */
    __RW uint32_t WORK_CTRL1;                  /* 0x7C:  */
    __R  uint8_t  RESERVED0[128];              /* 0x80 - 0xFF: Reserved */
    struct {
        __RW uint32_t CFG0;                    /* 0x100:  */
        __RW uint32_t CFG1;                    /* 0x104:  */
        __RW uint32_t DEAD_AREA;               /* 0x108:  */
        __R  uint8_t  RESERVED0[4];            /* 0x10C - 0x10F: Reserved */
    } PWM[8];
    __RW uint32_t TRIGGER_CFG[8];              /* 0x180 - 0x19C:  */
    __R  uint8_t  RESERVED1[80];               /* 0x1A0 - 0x1EF: Reserved */
    __RW uint32_t GLB_CTRL;                    /* 0x1F0:  */
    __RW uint32_t GLB_CTRL2;                   /* 0x1F4:  */
    __R  uint8_t  RESERVED2[8];                /* 0x1F8 - 0x1FF: Reserved */
    __R  uint32_t CNT_RELOAD_WORK[4];          /* 0x200 - 0x20C:  */
    __R  uint32_t CMP_VAL_WORK[24];            /* 0x210 - 0x26C:  */
    __R  uint8_t  RESERVED3[12];               /* 0x270 - 0x27B: Reserved */
    __R  uint32_t FORCE_WORK;                  /* 0x27C:  */
    __R  uint8_t  RESERVED4[32];               /* 0x280 - 0x29F: Reserved */
    __R  uint32_t CNT_VAL[4];                  /* 0x2A0 - 0x2AC:  */
    __RW uint32_t DAC_VALUE_SV[4];             /* 0x2B0 - 0x2BC:  */
    __R  uint8_t  RESERVED5[64];               /* 0x2C0 - 0x2FF: Reserved */
    __RW uint32_t CAPTURE_POS[8];              /* 0x300 - 0x31C:  */
    __R  uint8_t  RESERVED6[96];               /* 0x320 - 0x37F: Reserved */
    __R  uint32_t CAPTURE_NEG[8];              /* 0x380 - 0x39C:  */
    __R  uint8_t  RESERVED7[96];               /* 0x3A0 - 0x3FF: Reserved */
    __RW uint32_t IRQ_STS;                     /* 0x400:  */
    __RW uint32_t IRQ_EN;                      /* 0x404:  */
    __R  uint8_t  RESERVED8[8];                /* 0x408 - 0x40F: Reserved */
    __W  uint32_t IRQ_STS_CMP;                 /* 0x410:  */
    __W  uint32_t IRQ_STS_RELOAD;              /* 0x414:  */
    __W  uint32_t IRQ_STS_CAP_POS;             /* 0x418:  */
    __W  uint32_t IRQ_STS_CAP_NEG;             /* 0x41C:  */
    __W  uint32_t IRQ_STS_FAULT;               /* 0x420:  */
    __W  uint32_t IRQ_STS_BURSTEND;            /* 0x424:  */
    __R  uint8_t  RESERVED9[8];                /* 0x428 - 0x42F: Reserved */
    __RW uint32_t IRQ_EN_CMP;                  /* 0x430:  */
    __RW uint32_t IRQ_EN_RELOAD;               /* 0x434:  */
    __RW uint32_t IRQ_EN_CAP_POS;              /* 0x438:  */
    __RW uint32_t IRQ_EN_CAP_NEG;              /* 0x43C:  */
    __RW uint32_t IRQ_EN_FAULT;                /* 0x440:  */
    __RW uint32_t IRQ_EN_BURSTEND;             /* 0x444:  */
    __R  uint8_t  RESERVED10[56];              /* 0x448 - 0x47F: Reserved */
    __RW uint32_t DMA_EN;                      /* 0x480:  */
    __R  uint8_t  RESERVED11[124];             /* 0x484 - 0x4FF: Reserved */
    struct {
        __RW uint32_t CFG0;                    /* 0x500:  */
        __RW uint32_t CFG1;                    /* 0x504:  */
        __RW uint32_t CFG2;                    /* 0x508:  */
        __RW uint32_t CFG3;                    /* 0x50C:  */
    } CNT[4];
    __RW uint32_t CNT_GLBCFG;                  /* 0x540:  */
    __R  uint8_t  RESERVED12[188];             /* 0x544 - 0x5FF: Reserved */
    struct {
        __RW uint32_t CFG0;                    /* 0x600:  */
        __RW uint32_t CFG1;                    /* 0x604:  */
        __R  uint8_t  RESERVED0[8];            /* 0x608 - 0x60F: Reserved */
    } CAL[16];
    __R  uint8_t  RESERVED13[256];             /* 0x700 - 0x7FF: Reserved */
    struct {
        __RW uint32_t CFG;                     /* 0x800:  */
        __R  uint8_t  RESERVED0[12];           /* 0x804 - 0x80F: Reserved */
    } CMP[24];
} PWMV2_Type;


/* Bitfield definition for register: WORK_CTRL0 */
/*
 * SHADOW_UNLOCK (RW)
 *
 * write 0x… first to unlock, then set related bits in unlock_sel to unlock following shadow registers(from 0x04 to 0x78),
 * otherwise the shadow registers can not be written.
 * The shadow registers will be loaded to work registers only when shadow_lock is 1 or lock is not enabled
 * This bit can be cleared by set shadow_lock bit in work_ctrl1
 */
#define PWMV2_WORK_CTRL0_SHADOW_UNLOCK_MASK (0x80000000UL)
#define PWMV2_WORK_CTRL0_SHADOW_UNLOCK_SHIFT (31U)
#define PWMV2_WORK_CTRL0_SHADOW_UNLOCK_SET(x) (((uint32_t)(x) << PWMV2_WORK_CTRL0_SHADOW_UNLOCK_SHIFT) & PWMV2_WORK_CTRL0_SHADOW_UNLOCK_MASK)
#define PWMV2_WORK_CTRL0_SHADOW_UNLOCK_GET(x) (((uint32_t)(x) & PWMV2_WORK_CTRL0_SHADOW_UNLOCK_MASK) >> PWMV2_WORK_CTRL0_SHADOW_UNLOCK_SHIFT)

/* Bitfield definition for register: UNLOCK */
/*
