/*
 * Copyright (c) 2021-2024 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_QEOV2_H
#define HPM_QEOV2_H

typedef struct {
    struct {
        __RW uint32_t MODE;                    /* 0x0: analog waves mode */
        __RW uint32_t RESOLUTION;              /* 0x4: resolution of wave0/1/2 */
        __RW uint32_t PHASE_SHIFT[3];          /* 0x8 - 0x10: wave0 phase shifter */
        __RW uint32_t VD_INJECT;               /* 0x14: wave vd inject value */
        __R  uint8_t  RESERVED0[8];            /* 0x18 - 0x1F: Reserved */
        __RW uint32_t VQ_INJECT;               /* 0x20: wave vq inject value */
        __R  uint8_t  RESERVED1[8];            /* 0x24 - 0x2B: Reserved */
        __W  uint32_t VD_VQ_LOAD;              /* 0x2C: load wave0/1/2 vd vq value */
        __RW uint32_t AMPLITUDE[3];            /* 0x30 - 0x38: wave0 amplitude */
        __RW uint32_t MID_POINT[3];            /* 0x3C - 0x44: wave0 output middle point offset */
        struct {
            __RW uint32_t MIN_LEVEL0;          /* 0x48: wave0 low area limit value */
            __RW uint32_t MAX_LEVEL0;          /* 0x4C: wave0 high area limit value */
        } LIMIT0[3];
        struct {
            __RW uint32_t MIN_LEVEL1;          /* 0x60: wave0 low area limit value level1 */
            __RW uint32_t MAX_LEVEL1;          /* 0x64: wave0 high area limit value level1 */
        } LIMIT1[3];
        __RW uint32_t DEADZONE_SHIFT[3];       /* 0x78 - 0x80: deadzone_shifter_wave0 */
        __RW uint32_t PWM_CYCLE;               /* 0x84: pwm_cycle */
    } WAVE;
    __R  uint8_t  RESERVED0[120];              /* 0x88 - 0xFF: Reserved */
    struct {
        __RW uint32_t MODE;                    /* 0x100: wave_a/b/z output mode */
        __RW uint32_t RESOLUTION;              /* 0x104: resolution of wave_a/b/z */
        __RW uint32_t PHASE_SHIFT[3];          /* 0x108 - 0x110: wave_a phase shifter */
        __RW uint32_t LINE_WIDTH;              /* 0x114: Two-phase orthogonality wave 1/4 period */
        __RW uint32_t WDOG_WIDTH;              /* 0x118: wdog width of qeo */
        __W  uint32_t POSTION_SYNC;            /* 0x11C: sync abz owned postion */
        __RW uint32_t OVERALL_OFFSET;          /* 0x120: abz overall position offset */
        __RW uint32_t Z_START;                 /* 0x124: zero phase start line num */
        __RW uint32_t Z_END;                   /* 0x128: zero phase end line num */
        __RW uint32_t Z_OFFSET;                /* 0x12C: zero phase start and end 1/4 line num */
        __RW uint32_t Z_PULSE_WIDTH;           /* 0x130: zero pulse witdth */
    } ABZ;
    __R  uint8_t  RESERVED1[12];               /* 0x134 - 0x13F: Reserved */
    struct {
        __RW uint32_t MODE;                    /* 0x140: pwm mode */
        __RW uint32_t RESOLUTION;              /* 0x144: resolution of pwm */
        __RW uint32_t PHASE_SHIFT[4];          /* 0x148 - 0x154: pwm_a phase shifter */
        __RW uint32_t PHASE_TABLE[24];         /* 0x158 - 0x1B4: pwm_phase_table 0 */
    } PWM;
    __R  uint8_t  RESERVED2[64];               /* 0x1B8 - 0x1F7: Reserved */
    __RW uint32_t POSTION_SOFTWARE;            /* 0x1F8: softwave inject postion */
    __RW uint32_t POSTION_SEL;                 /* 0x1FC: select softwave inject postion */
    __R  uint32_t STATUS;                      /* 0x200: qeo status */
    __R  uint32_t DEBUG0;                      /* 0x204: qeo debug 0 */
    __R  uint32_t DEBUG1;                      /* 0x208: qeo debug 1 */
    __R  uint32_t DEBUG2;                      /* 0x20C: qeo debug 2 */
    __R  uint32_t DEBUG3;                      /* 0x210: qeo debug 3 */
    __R  uint32_t DEBUG4;                      /* 0x214: qeo debug 4 */
    __R  uint32_t DEBUG5;                      /* 0x218: qeo debug 5 */
} QEOV2_Type;


/* Bitfield definition for register of struct WAVE: MODE */
/*
 * WAVE2_ABOVE_MAX_LIMIT (RW)
 *
 * wave2 above max limit mode.
 * 0: output all bits are 1.
 * 1: output 0x0.
 * 2: output as level_max_limit2.level0_max_limit
 */
#define QEOV2_WAVE_MODE_WAVE2_ABOVE_MAX_LIMIT_MASK (0xC0000000UL)
#define QEOV2_WAVE_MODE_WAVE2_ABOVE_MAX_LIMIT_SHIFT (30U)
#define QEOV2_WAVE_MODE_WAVE2_ABOVE_MAX_LIMIT_SET(x) (((uint32_t)(x) << QEOV2_WAVE_MODE_WAVE2_ABOVE_MAX_LIMIT_SHIFT) & QEOV2_WAVE_MODE_WAVE2_ABOVE_MAX_LIMIT_MASK)
#define QEOV2_WAVE_MODE_WAVE2_ABOVE_MAX_LIMIT_GET(x) (((uint32_t)(x) & QEOV2_WAVE_MODE_WAVE2_ABOVE_MAX_LIMIT_MASK) >> QEOV2_WAVE_MODE_WAVE2_ABOVE_MAX_LIMIT_SHIFT)

/*
 * WAVE2_HIGH_AREA1_LIMIT (RW)
 *
 * wave2 high area1 limit mode.
 * 0: output all bits are 1.
 * 1: output as level_max_limit2.level0_max_limit
 */
#define QEOV2_WAVE_MODE_WAVE2_HIGH_AREA1_LIMIT_MASK (0x20000000UL)
