/*
 * Copyright (c) 2021-2024 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_PKA_H
#define HPM_PKA_H

typedef struct {
    __R  uint8_t  RESERVED0[49152];            /* 0x0 - 0xBFFF: Reserved */
    __RW uint32_t CTRL;                        /* 0xC000: Control Register */
    __R  uint32_t STA;                         /* 0xC004: Status Register */
    __RW uint32_t INT_EN_REG;                  /* 0xC008: Interrupt Enable Register */
    __R  uint8_t  RESERVED1[52];               /* 0xC00C - 0xC03F: Reserved */
    union {
        __RW uint32_t OP_CTRL0;                /* 0xC040: Operation Control Register 0 */
        __RW uint32_t RSA_OP_CTRL;             /* 0xC040: RSA Operation Control Register */
        __RW uint32_t ECC_OP_CTRL;             /* 0xC040: ECC Operation Control Register */
    };
    union {
        __RW uint32_t OP_CTRL1;                /* 0xC044: Operation Control Register 1 */
        __RW uint32_t RSA_KEY_SIZE;            /* 0xC044: RSA Private Key Size Register */
        __RW uint32_t ECC_NP0_ORDER_N;         /* 0xC044: ECC Montgomery Parameter NP0 for Order N Register */
    };
    union {
        __RW uint32_t OP_CTRL2;                /* 0xC048: Operation Control Register 2 */
        __RW uint32_t RSA_MONT_N_SIZE;         /* 0xC048: RSA Parameter N Size Register */
        __RW uint32_t ECC_P_SIZE;              /* 0xC048: ECC Parameter P Size Register */
    };
    union {
        __RW uint32_t OP_CTRL3;                /* 0xC04C: Operation Control Register 3 */
        __R  uint32_t RSA_MONT_R_SIZE;         /* 0xC04C: RSA Montgomery Parameter R Size Register */
        __RW uint32_t ECC_MONT_R_SIZE;         /* 0xC04C: ECC Montgomery Parameter R Size Register */
    };
    union {
        __RW uint32_t OP_CTRL4;                /* 0xC050: Operation Control Register 4 */
        __R  uint32_t RSA_MONT_NP0;            /* 0xC050: RSA Montgomery Parameter NP0 Register */
        __RW uint32_t ECC_MONT_NP0;            /* 0xC050: ECC Montgomery Parameter NP0 Register */
    };
    union {
        __RW uint32_t OP_CTRL5;                /* 0xC054: Operation Control Register 5 */
        __RW uint32_t RSA_MONT_R2_MOD_N_PTR;   /* 0xC054: RSA Montgomery Parameter R2N Register */
        __RW uint32_t ECC_MONT_R2_MOD_P_PTR;   /* 0xC054: ECC Montgomery Parameter R2P Register */
    };
    union {
        __RW uint32_t OP_CTRL6;                /* 0xC058: Operation Control Register 6 */
        __RW uint32_t RSA_BIG_PRIME_PROD;      /* 0xC058: RSA Public Parameter N Register */
        __RW uint32_t ECC_A;                   /* 0xC058: ECC Public Parameter A Register */
    };
    union {
        __RW uint32_t OP_CTRL7;                /* 0xC05C: Operation Control Register 7 */
        __RW uint32_t RSA_PUB_KEY;             /* 0xC05C: RSA Public Key Register */
        __RW uint32_t ECC_B;                   /* 0xC05C: ECC Public Parameter B Register */
    };
    union {
        __RW uint32_t OP_CTRL8;                /* 0xC060: Operation Control Register 8 */
        __RW uint32_t ECC_P;                   /* 0xC060: ECC Public Parameter P Register */
    };
    union {
        __RW uint32_t OP_CTRL9;                /* 0xC064: Operation Control Register 9 */
        __RW uint32_t RSA_M;                   /* 0xC064: RSA M Register */
        __RW uint32_t ECC_GEN_X;               /* 0xC064: ECC Public Parameter GX Register */
    };
    union {
        __RW uint32_t OP_CTRLA;                /* 0xC068: Operation Control Register A */
        __RW uint32_t RSA_TM0;                 /* 0xC068: RSA TM0 Register */
        __RW uint32_t ECC_GEN_Y;               /* 0xC068: ECC Public Parameter GY Register */
    };
    union {
        __RW uint32_t OP_CTRLB;                /* 0xC06C: Operation Control Register B */
        __RW uint32_t RSA_TM1;                 /* 0xC06C: RSA TM1 Register */
        __RW uint32_t ECC_PUB_X;               /* 0xC06C: ECC Public Parameter PX Register */
    };
    union {
        __RW uint32_t OP_CTRLC;                /* 0xC070: Operation Control Register C */
        __RW uint32_t RSA_O;                   /* 0xC070: RSA O Register */
        __RW uint32_t ECC_PUB_Y;               /* 0xC070: ECC Public Parameter PY Register */
    };
    union {
        __RW uint32_t OP_CTRLD;                /* 0xC074: Operation Control Register D */
        __RW uint32_t RSA_PRIV_KEY;            /* 0xC074: RSA Private Parameter d Register */
        __RW uint32_t ECC_PRIV_K;              /* 0xC074: ECC Private Parameter K Register */
    };
    union {
        __RW uint32_t OP_CTRLE;                /* 0xC078: Operation Control Register E */
        __RW uint32_t ECC_GENORD_N;            /* 0xC078: ECC Public Parameter Order N Register */
    };
    union {
        __RW uint32_t OP_CTRLF;                /* 0xC07C: Operation Control Register F */
        __RW uint32_t ECC_R2N_ORDER_N;         /* 0xC07C: ECC Montgomery Parameter R2N Register */
    };
} PKA_Type;


/* Bitfield definition for register: CTRL */
/*
 * DIS_CIPHER (RW)
 *
 * Sticky at 1.
 * 1: Disable Cipher Operation. When Disabled, clear all memory contents, and run in infinite loop. Only module reset can recover the module.
 */
#define PKA_CTRL_DIS_CIPHER_MASK (0x80000000UL)
#define PKA_CTRL_DIS_CIPHER_SHIFT (31U)
#define PKA_CTRL_DIS_CIPHER_SET(x) (((uint32_t)(x) << PKA_CTRL_DIS_CIPHER_SHIFT) & PKA_CTRL_DIS_CIPHER_MASK)
#define PKA_CTRL_DIS_CIPHER_GET(x) (((uint32_t)(x) & PKA_CTRL_DIS_CIPHER_MASK) >> PKA_CTRL_DIS_CIPHER_SHIFT)

/*
 * PRIM_OP (RW)
 *
 * 1: Run primitive operations.
 * 0: Run composite operations
 */
#define PKA_CTRL_PRIM_OP_MASK (0x40000000UL)
#define PKA_CTRL_PRIM_OP_SHIFT (30U)
#define PKA_CTRL_PRIM_OP_SET(x) (((uint32_t)(x) << PKA_CTRL_PRIM_OP_SHIFT) & PKA_CTRL_PRIM_OP_MASK)
