/*
 * Copyright (c) 2021-2024 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_TSW_H
#define HPM_TSW_H

typedef struct {
    __R  uint8_t  RESERVED0[4];                /* 0x0 - 0x3: Reserved */
    __RW uint32_t LU_MAIN_CTRL;                /* 0x4: LU_MAIN control */
    __RW uint32_t LU_MAIN_HITMEM;              /* 0x8: LU_MAIN hit */
    __R  uint32_t LU_MAIN_PARAM;               /* 0xC: LU_MAIN parameter */
    __RW uint32_t LU_MAIN_BYPASS;              /* 0x10: LU_MAIN bypass */
    __RW uint32_t LU_MAIN_PCP_REMAP;           /* 0x14: LU_MAIN PCP remap */
    __R  uint32_t LU_MAIN_VERSION;             /* 0x18: LU_MAIN version */
    __R  uint8_t  RESERVED1[4];                /* 0x1C - 0x1F: Reserved */
    __RW uint32_t LU_MAIN_INTF_ACTION;         /* 0x20: LU_MAIN low word of action data for internal frames */
    __R  uint8_t  RESERVED2[4];                /* 0x24 - 0x27: Reserved */
    __RW uint32_t LU_MAIN_BC_ACTION;           /* 0x28: LU_MAIN low word of action data for broadcast frames */
    __R  uint8_t  RESERVED3[4];                /* 0x2C - 0x2F: Reserved */
    __RW uint32_t LU_MAIN_NN_ACTION;           /* 0x30: LU_MAIN low word of  action data for unknown frames */
    __R  uint8_t  RESERVED4[204];              /* 0x34 - 0xFF: Reserved */
    __R  uint32_t APB2AXIS_CAM_STS;            /* 0x100: status register */
    __R  uint8_t  RESERVED5[12];               /* 0x104 - 0x10F: Reserved */
    __R  uint32_t APB2AXIS_CAM_REQ_CNT;        /* 0x110: request count */
    __R  uint32_t APB2AXIS_CAM_FILLSTS;        /* 0x114: fill status */
    __W  uint32_t APB2AXIS_CAM_RESET;          /* 0x118: reset */
    __R  uint32_t APB2AXIS_CAM_PARAM;          /* 0x11C: parameter */
    __RW uint32_t APB2AXI_CAM_REQDATA_0;       /* 0x120: data0 */
    __RW uint32_t APB2AXI_CAM_REQDATA_1;       /* 0x124: data1 */
    __RW uint32_t APB2AXI_CAM_REQDATA_2;       /* 0x128: data2 */
    __R  uint8_t  RESERVED6[212];              /* 0x12C - 0x1FF: Reserved */
    __R  uint32_t APB2AXIS_ALMEM_STS;          /* 0x200: status register */
    __R  uint8_t  RESERVED7[12];               /* 0x204 - 0x20F: Reserved */
    __R  uint32_t APB2AXIS_ALMEM_REQ_CNT;      /* 0x210: request count */
    __R  uint32_t APB2AXIS_ALMEM_FILLSTS;      /* 0x214: fill status */
    __W  uint32_t APB2AXIS_ALMEM_RESET;        /* 0x218: reset */
    __R  uint32_t APB2AXIS_ALMEM_PARAM;        /* 0x21C: parameter */
    __RW uint32_t APB2AXIS_ALMEM_REQDATA_0;    /* 0x220: data0 */
    __RW uint32_t APB2AXIS_ALMEM_REQDATA_1;    /* 0x224: data1 */
    __R  uint8_t  RESERVED8[88];               /* 0x228 - 0x27F: Reserved */
    __R  uint32_t AXIS2APB_ALMEM_STS;          /* 0x280: status register */
    __R  uint8_t  RESERVED9[12];               /* 0x284 - 0x28F: Reserved */
    __R  uint32_t AXIS2APB_ALMEM_RESP_CNT;     /* 0x290: response count */
    __R  uint32_t AXIS2APB_ALMEM_FILLSTS;      /* 0x294: fill status */
    __RW uint32_t AXIS2APB_ALMEM_RESET;        /* 0x298: reset */
    __R  uint32_t AXIS2APB_ALMEM_PARAM;        /* 0x29C: parameter */
    __RW uint32_t AXIS2APB_ALMEM_RESPDATA_0;   /* 0x2A0: data0 */
    __RW uint32_t AXIS2APB_ALMEM_RESPDATA_1;   /* 0x2A4: data1 */
    __R  uint8_t  RESERVED10[344];             /* 0x2A8 - 0x3FF: Reserved */
    __RW uint32_t HITMEM[4];                   /* 0x400 - 0x40C: hitmem */
    __R  uint8_t  RESERVED11[3056];            /* 0x410 - 0xFFF: Reserved */
    __R  uint32_t APB2AXIS_LOOKUP_STS;         /* 0x1000: status register */
    __R  uint8_t  RESERVED12[12];              /* 0x1004 - 0x100F: Reserved */
    __R  uint32_t APB2AXIS_LOOKUP_REQ_CNT;     /* 0x1010: response count */
    __R  uint32_t APB2AXIS_LOOKUP_FILLSTS;     /* 0x1014: fill status */
    __RW uint32_t APB2AXIS_LOOKUP_RESET;       /* 0x1018: reset */
    __R  uint32_t APB2AXIS_LOOKUP_PARAM;       /* 0x101C: parameter */
    __RW uint32_t APB2AXIS_LOOKUP_REQDATA_0;   /* 0x1020: LOOKUP REQUEST Register REQ_DATA_0 */
    __RW uint32_t APB2AXIS_LOOKUP_REQDATA_1;   /* 0x1024: LOOKUP REQUEST Register REQ_DATA_1 */
    __R  uint8_t  RESERVED13[4];               /* 0x1028 - 0x102B: Reserved */
    __RW uint32_t APB2AXIS_LOOKUP_REQDATA_3;   /* 0x102C: LOOKUP REQUEST Register REQ_DATA_2 */
    __R  uint8_t  RESERVED14[80];              /* 0x1030 - 0x107F: Reserved */
    __R  uint32_t AXIS2APB_LOOKUP_STS;         /* 0x1080: status register */
    __R  uint8_t  RESERVED15[12];              /* 0x1084 - 0x108F: Reserved */
    __R  uint32_t AXIS2APB_LOOKUP_RESP_CNT;    /* 0x1090: response count */
    __R  uint32_t AXIS2APB_LOOKUP_FILLSTS;     /* 0x1094: fill status */
    __RW uint32_t AXIS2APB_LOOKUP_RESET;       /* 0x1098: reset */
    __R  uint32_t AXIS2APB_LOOKUP_PARAM;       /* 0x109C: parameter */
    __RW uint32_t AXIS2APB_LOOKUP_RESPDATA_0;  /* 0x10A0: LOOKUP RESPONSE Data Register */
    __R  uint8_t  RESERVED16[4];               /* 0x10A4 - 0x10A7: Reserved */
    __RW uint32_t AXIS2APB_LOOKUP_RESPDATA_1;  /* 0x10A8: LOOKUP RESPONSE Data Register */
    __R  uint8_t  RESERVED17[3924];            /* 0x10AC - 0x1FFF: Reserved */
    __R  uint32_t CENTRAL_CSR_VERSION;         /* 0x2000: version register */
    __R  uint32_t CENTRAL_CSR_PARAM;           /* 0x2004: Parameter Register */
    __RW uint32_t CENTRAL_CSR_CONFIG;          /* 0x2008: Configuration Register */
    __R  uint32_t CENTRAL_CSR_CB_PARAM;        /* 0x200C: CB Parameter Register */
    __R  uint32_t CENTRAL_CSR_QCI_CTRL_PARAM;  /* 0x2010: QCI Control Parameter Register */
    __R  uint8_t  RESERVED18[240];             /* 0x2014 - 0x2103: Reserved */
    __R  uint32_t CENTRAL_QCI_HWCFG;           /* 0x2104: PSPF General CTRAL */
    __R  uint8_t  RESERVED19[8];               /* 0x2108 - 0x210F: Reserved */
    __RW uint32_t CENTRAL_QCI_FILTERSEL;       /* 0x2110: Filter select index */
    __RW uint32_t CENTRAL_QCI_METERSEL;        /* 0x2114: Flowmeter select index */
    __RW uint32_t CENTRAL_QCI_GATESEL;         /* 0x2118: Gate select index */
    __R  uint8_t  RESERVED20[4];               /* 0x211C - 0x211F: Reserved */
    __RW uint32_t CENTRAL_QCI_FCTRL;           /* 0x2120: FILTER SETTING */
    __RW uint32_t CENTRAL_QCI_FSIZE;           /* 0x2124:  */
    __R  uint8_t  RESERVED21[24];              /* 0x2128 - 0x213F: Reserved */
    __R  uint32_t QCI_CNT[6];                  /* 0x2140 - 0x2154: FILTER COUNTER */
    __R  uint8_t  RESERVED22[8];               /* 0x2158 - 0x215F: Reserved */
    __RW uint32_t CENTRAL_QCI_MCTRL;           /* 0x2160: Flow meter settings */
    __R  uint8_t  RESERVED23[12];              /* 0x2164 - 0x216F: Reserved */
    __RW uint32_t CENTRAL_QCI_CIR;             /* 0x2170:  */
    __RW uint32_t CENTRAL_QCI_CBS;             /* 0x2174:  */
    __RW uint32_t CENTRAL_QCI_EIR;             /* 0x2178:  */
    __RW uint32_t CENTRAL_QCI_EBS;             /* 0x217C:  */
    __RW uint32_t CENTRAL_QCI_GCTRL;           /* 0x2180: Gate settings */
    __RW uint32_t CENTRAL_QCI_GSTATUS;         /* 0x2184:  */
    __RW uint32_t CENTRAL_QCI_GLISTINDEX;      /* 0x2188:  */
    __RW uint32_t CENTRAL_QCI_LISTLEN;         /* 0x218C:  */
    __RW uint32_t CENTRAL_QCI_ACYCLETM;        /* 0x2190:  */
    __RW uint32_t CENTRAL_QCI_ABASETM_L;       /* 0x2194:  */
    __RW uint32_t CENTRAL_QCI_ABASETM_H;       /* 0x2198:  */
    __R  uint8_t  RESERVED24[4];               /* 0x219C - 0x219F: Reserved */
    __RW uint32_t CENTRAL_QCI_AENTRY_CTRL;     /* 0x21A0:  */
    __RW uint32_t CENTRAL_QCI_AENTRY_AENTRY_IVAL; /* 0x21A4:  */
    __R  uint32_t CENTRAL_QCI_AENTRY_OCYCLETM; /* 0x21A8:  */
    __R  uint32_t CENTRAL_QCI_AENTRY_OBASETM_L;/* 0x21AC:  */
    __R  uint32_t CENTRAL_QCI_AENTRY_OBASETM_H;/* 0x21B0:  */
    __R  uint8_t  RESERVED25[7756];            /* 0x21B4 - 0x3FFF: Reserved */
    __RW uint32_t MM2S_DMA_CR;                 /* 0x4000: mm2s control register */
    __RW uint32_t MM2S_DMA_SR;                 /* 0x4004: mm2s status */
    __R  uint32_t MM2S_DMA_FILL;               /* 0x4008: mm2s dma fill status */
    __R  uint8_t  RESERVED26[16];              /* 0x400C - 0x401B: Reserved */
    __R  uint32_t MM2S_DMA_CFG;                /* 0x401C: mm2s dma configure */
    __RW uint32_t MM2S_ADDRLO;                 /* 0x4020: mm2s axi address */
    __R  uint8_t  RESERVED27[4];               /* 0x4024 - 0x4027: Reserved */
    __RW uint32_t MM2S_LENGTH;                 /* 0x4028: mm2s axi length */
    __RW uint32_t MM2S_CTRL;                   /* 0x402C: mm2s command control */
    __R  uint32_t MM2S_RESP;                   /* 0x4030: mm2s response buffer */
    __R  uint8_t  RESERVED28[76];              /* 0x4034 - 0x407F: Reserved */
    __RW uint32_t S2MM_DMA_CR;                 /* 0x4080: s2mm dma control */
    __RW uint32_t S2MM_DMA_SR;                 /* 0x4084: s2mm state */
    __R  uint32_t S2MM_DMA_FILL;               /* 0x4088: s2mm buffer fill status */
    __R  uint8_t  RESERVED29[16];              /* 0x408C - 0x409B: Reserved */
    __R  uint32_t S2MM_DMA_CFG;                /* 0x409C: s2mm dma config status */
    __RW uint32_t S2MM_ADDRLO;                 /* 0x40A0: s2mm axi address */
    __R  uint8_t  RESERVED30[4];               /* 0x40A4 - 0x40A7: Reserved */
    __RW uint32_t S2MM_LENGTH;                 /* 0x40A8: s2mm axi length */
    __RW uint32_t S2MM_CTRL;                   /* 0x40AC: s2mm command control */
    __R  uint32_t S2MM_RESP;                   /* 0x40B0: s2mm response buffer */
    __R  uint8_t  RESERVED31[8012];            /* 0x40B4 - 0x5FFF: Reserved */
    __RW uint32_t PTP_EVT_TS_CTL;              /* 0x6000: timestamp control */
    __R  uint8_t  RESERVED32[4];               /* 0x6004 - 0x6007: Reserved */
    __R  uint32_t PTP_EVT_PPS_TOD_SEC;         /* 0x6008: pps tod seconds */
    __R  uint32_t PTP_EVT_PPS_TOD_NS;          /* 0x600C: pps tod sun seconds */
    __R  uint8_t  RESERVED33[12];              /* 0x6010 - 0x601B: Reserved */
    __RW uint32_t PTP_EVT_SCP_SEC0;            /* 0x601C: target time seconds */
    __RW uint32_t PTP_EVT_SCP_NS0;             /* 0x6020: target time sub seconds */
    __R  uint8_t  RESERVED34[4];               /* 0x6024 - 0x6027: Reserved */
    __R  uint32_t PTP_EVT_TMR_STS;             /* 0x6028: timer status */
    __RW uint32_t PTP_EVT_PPS_CMD;             /* 0x602C: pps command control */
    __R  uint32_t PTP_EVT_ATSLO;               /* 0x6030: auxiliray read data sub seconds */
    __R  uint32_t PTP_EVT_ATSHI;               /* 0x6034: auxiliray read data seconds */
    __R  uint8_t  RESERVED35[40];              /* 0x6038 - 0x605F: Reserved */
    __RW uint32_t PTP_EVT_PPS0_INTERVAL;       /* 0x6060: pps0 interval configure */
    __RW uint32_t PTP_EVT_PPS0_WIDTH;          /* 0x6064: pps0 width configure */
    __R  uint8_t  RESERVED36[24];              /* 0x6068 - 0x607F: Reserved */
    __RW uint32_t PTP_EVT_SCP_SEC1;            /* 0x6080: target time seconds */
    __RW uint32_t PTP_EVT_SCP_NS1;             /* 0x6084: target time sub seconds */
    __RW uint32_t PTP_EVT_PPS1_INTERVAL;       /* 0x6088: pps1 interval configure */
    __RW uint32_t PTP_EVT_PPS1_WIDTH;          /* 0x608C: pps1 width configure */
    __R  uint8_t  RESERVED37[16];              /* 0x6090 - 0x609F: Reserved */
    __RW uint32_t PTP_EVT_SCP_SEC2;            /* 0x60A0: target time seconds */
    __RW uint32_t PTP_EVT_SCP_NS2;             /* 0x60A4: target time sub seconds */
    __RW uint32_t PTP_EVT_PPS2_INTERVAL;       /* 0x60A8: pps2 interval configure */
    __RW uint32_t PTP_EVT_PPS2_WIDTH;          /* 0x60AC: pps2 width configure */
    __R  uint8_t  RESERVED38[16];              /* 0x60B0 - 0x60BF: Reserved */
    __RW uint32_t PTP_EVT_SCP_SEC3;            /* 0x60C0: target time seconds */
    __RW uint32_t PTP_EVT_SCP_NS3;             /* 0x60C4: target time sub seconds */
    __RW uint32_t PTP_EVT_PPS3_INTERVAL;       /* 0x60C8: pps3 interval configure */
    __RW uint32_t PTP_EVT_PPS3_WIDTH;          /* 0x60CC: pps3 width configure */
    __R  uint8_t  RESERVED39[16];              /* 0x60D0 - 0x60DF: Reserved */
    __RW uint32_t PTP_EVT_PPS_CTRL0;           /* 0x60E0: pps control 0 register */
    __RW uint32_t PTP_EVT_PPS_SEL;             /* 0x60E4:  */
    __R  uint8_t  RESERVED40[8];               /* 0x60E8 - 0x60EF: Reserved */
    __RW uint32_t SOFT_RST_CTRL;               /* 0x60F0: softer reset control */
    __R  uint8_t  RESERVED41[40716];           /* 0x60F4 - 0xFFFF: Reserved */
    __RW uint32_t CPU_PORT_PORT_MAIN_TAGGING;  /* 0x10000: PVID Tagging Register */
    __RW uint32_t CPU_PORT_PORT_MAIN_ENNABLE;  /* 0x10004: Port Module Enable Register */
    __R  uint8_t  RESERVED42[10232];           /* 0x10008 - 0x127FF: Reserved */
    __R  uint32_t CPU_PORT_EGRESS_STMID_ESELECT; /* 0x12800: Stream Identification */
    __R  uint8_t  RESERVED43[60];              /* 0x12804 - 0x1283F: Reserved */
    __RW uint32_t CPU_PORT_EGRESS_STMID_CONTROL; /* 0x12840:  */
    __RW uint32_t CPU_PORT_EGRESS_STMID_SEQNO; /* 0x12844:  */
    __RW uint32_t CPU_PORT_EGRESS_STMID_MATCHCNT; /* 0x12848:  */
    __R  uint8_t  RESERVED44[4];               /* 0x1284C - 0x1284F: Reserved */
    __RW uint32_t CPU_PORT_EGRESS_STMID_MACLO; /* 0x12850:  */
    __RW uint32_t CPU_PORT_EGRESS_STMID_MACHI; /* 0x12854:  */
    __R  uint8_t  RESERVED45[4];               /* 0x12858 - 0x1285B: Reserved */
    __RW uint32_t CPU_PORT_EGRESS_STMID_AMACHI;/* 0x1285C:  */
    __R  uint8_t  RESERVED46[416];             /* 0x12860 - 0x129FF: Reserved */
    __RW uint32_t CPU_PORT_EGRESS_FRER_CONTROL;/* 0x12A00: Frame Replication and Elimination */
    __RW uint32_t CPU_PORT_EGRESS_FRER_SIDSEL; /* 0x12A04:  */
    __RW uint32_t CPU_PORT_EGRESS_FRER_IRFUNC; /* 0x12A08:  */
    __RW uint32_t CPU_PORT_EGRESS_FRER_SRFUNC; /* 0x12A0C:  */
    __RW uint32_t CPU_PORT_EGRESS_FRER_FSELECT;/* 0x12A10:  */
    __R  uint8_t  RESERVED47[44];              /* 0x12A14 - 0x12A3F: Reserved */
    __RW uint32_t CPU_PORT_EGRESS_FRER_FCTRL;  /* 0x12A40:  */
    __RW uint32_t CPU_PORT_EGRESS_FRER_RESETMSEC; /* 0x12A44:  */
    __RW uint32_t CPU_PORT_EGRESS_FRER_LATRSPERIOD; /* 0x12A48:  */
    __RW uint32_t CPU_PORT_EGRESS_FRER_LATTESTPERIOD; /* 0x12A4C:  */
    __RW uint32_t CPU_PORT_EGRESS_FRER_LATERRDIFFALW; /* 0x12A50:  */
    __RW uint32_t CPU_PORT_EGRESS_FRER_LATERRCNT; /* 0x12A54:  */
    __R  uint8_t  RESERVED48[8];               /* 0x12A58 - 0x12A5F: Reserved */
    __R  uint32_t EGFRCNT[8];                  /* 0x12A60 - 0x12A7C:  */
    __R  uint8_t  RESERVED49[5504];            /* 0x12A80 - 0x13FFF: Reserved */
    __R  uint32_t CPU_PORT_IGRESS_RX_FDFIFO_FDMEM_CNT_BYTE; /* 0x14000:  */
    __R  uint32_t CPU_PORT_IGRESS_RX_FDFIFO_FDMEM_STS; /* 0x14004:  */
    __RW uint32_t CPU_PORT_IGRESS_RX_FDFIFO_ERROR_FLAG; /* 0x14008:  */
    __RW uint32_t CPU_PORT_IGRESS_RX_FDFIFO_IE_ERROR_FLAG; /* 0x1400C:  */
    __RW uint32_t CPU_PORT_IGRESS_RX_FDFIFO_IN_CONFIG; /* 0x14010:  */
    __RW uint32_t CPU_PORT_IGRESS_RX_FDFIFO_OUT_CONFIG; /* 0x14014:  */
    __W  uint32_t CPU_PORT_IGRESS_RX_FDFIFO_RESET; /* 0x14018:  */
    __R  uint32_t CPU_PORT_IGRESS_RX_FDFIFO_PARAM; /* 0x1401C:  */
    __RW uint32_t CPU_PORT_IGRESS_RX_FDFIFO_STRFWD; /* 0x14020:  */
    __RW uint32_t CPU_PORT_IGRESS_RX_FDFIFO_PORTMASK; /* 0x14024:  */
    __RW uint32_t CPU_PORT_IGRESS_RX_FDFIFO_MIRROR; /* 0x14028:  */
    __RW uint32_t CPU_PORT_IGRESS_RX_FDFIFO_MIRROR_TX; /* 0x1402C:  */
    __R  uint8_t  RESERVED50[2000];            /* 0x14030 - 0x147FF: Reserved */
    __R  uint32_t CPU_PORT_IGRESS_STMID_ESELECT; /* 0x14800: Stream Identification */
    __R  uint8_t  RESERVED51[60];              /* 0x14804 - 0x1483F: Reserved */
    __RW uint32_t CPU_PORT_IGRESS_STMID_CONTROL; /* 0x14840:  */
    __RW uint32_t CPU_PORT_IGRESS_STMID_SEQNO; /* 0x14844:  */
    __RW uint32_t CPU_PORT_IGRESS_STMID_MATCHCNT; /* 0x14848:  */
    __R  uint8_t  RESERVED52[4];               /* 0x1484C - 0x1484F: Reserved */
    __RW uint32_t CPU_PORT_IGRESS_STMID_MACLO; /* 0x14850:  */
    __RW uint32_t CPU_PORT_IGRESS_STMID_MACHI; /* 0x14854:  */
    __R  uint8_t  RESERVED53[4];               /* 0x14858 - 0x1485B: Reserved */
    __RW uint32_t CPU_PORT_IGRESS_STMID_AMACHI;/* 0x1485C:  */
    __R  uint8_t  RESERVED54[416];             /* 0x14860 - 0x149FF: Reserved */
    __RW uint32_t CPU_PORT_IGRESS_FRER_CONTROL;/* 0x14A00: Frame Replication and Elimination */
    __RW uint32_t CPU_PORT_IGRESS_FRER_SIDSEL; /* 0x14A04:  */
    __RW uint32_t CPU_PORT_IGRESS_FRER_IRFUNC; /* 0x14A08:  */
    __RW uint32_t CPU_PORT_IGRESS_FRER_SRFUNC; /* 0x14A0C:  */
    __RW uint32_t CPU_PORT_IGRESS_FRER_FSELECT;/* 0x14A10:  */
    __R  uint8_t  RESERVED55[44];              /* 0x14A14 - 0x14A3F: Reserved */
    __RW uint32_t CPU_PORT_IGRESS_FRER_FCTRL;  /* 0x14A40:  */
    __RW uint32_t CPU_PORT_IGRESS_FRER_RESETMSEC; /* 0x14A44:  */
    __RW uint32_t CPU_PORT_IGRESS_FRER_LATRSPERIOD; /* 0x14A48:  */
    __RW uint32_t CPU_PORT_IGRESS_FRER_LATTESTPERIOD; /* 0x14A4C:  */
    __RW uint32_t CPU_PORT_IGRESS_FRER_LATERRDIFFALW; /* 0x14A50:  */
    __RW uint32_t CPU_PORT_IGRESS_FRER_LATERRCNT; /* 0x14A54:  */
    __R  uint8_t  RESERVED56[8];               /* 0x14A58 - 0x14A5F: Reserved */
    __R  uint32_t IGFRCNT[8];                  /* 0x14A60 - 0x14A7C:  */
    __R  uint8_t  RESERVED57[13700];           /* 0x14A80 - 0x18003: Reserved */
    __RW uint32_t CPU_PORT_MONITOR_CTRL;       /* 0x18004:  */
    __W  uint32_t CPU_PORT_MONITOR_RESET;      /* 0x18008:  */
    __R  uint32_t CPU_PORT_MONITOR_PARAM;      /* 0x1800C:  */
    __R  uint32_t CPU_PORT_MONITOR_TX_COUNTER_TX_FGOOD; /* 0x18010:  */
    __R  uint8_t  RESERVED58[4];               /* 0x18014 - 0x18017: Reserved */
    __R  uint32_t CPU_PORT_MONITOR_TX_COUNTER_TX_FERROR; /* 0x18018:  */
    __R  uint8_t  RESERVED59[4];               /* 0x1801C - 0x1801F: Reserved */
    __R  uint32_t CPU_PORT_MONITOR_TX_COUNTER_TX_DROP_OVFL; /* 0x18020:  */
    __R  uint8_t  RESERVED60[28];              /* 0x18024 - 0x1803F: Reserved */
    __R  uint32_t CPU_PORT_MONITOR_RX_COUNTER_RX_FGOOD; /* 0x18040:  */
    __R  uint8_t  RESERVED61[4];               /* 0x18044 - 0x18047: Reserved */
    __R  uint32_t CPU_PORT_MONITOR_RX_COUNTER_RX_FERROR; /* 0x18048:  */
    __R  uint8_t  RESERVED62[4];               /* 0x1804C - 0x1804F: Reserved */
    __R  uint32_t CPU_PORT_MONITOR_RX_COUNTER_RX_KNOWN; /* 0x18050:  */
    __R  uint8_t  RESERVED63[4];               /* 0x18054 - 0x18057: Reserved */
    __R  uint32_t CPU_PORT_MONITOR_RX_COUNTER_RX_UNKNOWN; /* 0x18058:  */
    __R  uint8_t  RESERVED64[4];               /* 0x1805C - 0x1805F: Reserved */
    __R  uint32_t CPU_PORT_MONITOR_RX_COUNTER_RX_UC; /* 0x18060:  */
    __R  uint8_t  RESERVED65[4];               /* 0x18064 - 0x18067: Reserved */
    __R  uint32_t CPU_PORT_MONITOR_RX_COUNTER_RX_INTERN; /* 0x18068:  */
    __R  uint8_t  RESERVED66[4];               /* 0x1806C - 0x1806F: Reserved */
    __R  uint32_t CPU_PORT_MONITOR_RX_COUNTER_RX_BC; /* 0x18070:  */
    __R  uint8_t  RESERVED67[4];               /* 0x18074 - 0x18077: Reserved */
    __R  uint32_t CPU_PORT_MONITOR_RX_COUNTER_RX_MULTI; /* 0x18078:  */
    __R  uint8_t  RESERVED68[4];               /* 0x1807C - 0x1807F: Reserved */
    __R  uint32_t CPU_PORT_MONITOR_RX_COUNTER_RX_VLAN; /* 0x18080:  */
    __R  uint8_t  RESERVED69[4];               /* 0x18084 - 0x18087: Reserved */
    __R  uint32_t CPU_PORT_MONITOR_RX_COUNTER_RX_DROP_OVFL; /* 0x18088:  */
    __R  uint8_t  RESERVED70[4];               /* 0x1808C - 0x1808F: Reserved */
    __R  uint32_t CPU_PORT_MONITOR_RX_COUNTER_RX_DROP_LU; /* 0x18090:  */
    __R  uint8_t  RESERVED71[4];               /* 0x18094 - 0x18097: Reserved */
    __R  uint32_t CPU_PORT_MONITOR_RX_COUNTER_RX_DROP_ERR; /* 0x18098:  */
    __R  uint8_t  RESERVED72[4];               /* 0x1809C - 0x1809F: Reserved */
    __R  uint32_t CPU_PORT_MONITOR_RX_COUNTER_RX_DROP_VLAN; /* 0x180A0:  */
    __R  uint8_t  RESERVED73[4];               /* 0x180A4 - 0x180A7: Reserved */
    __R  uint32_t CPU_PORT_MONITOR_RX_COUNTER_RX_FPE_FGOOD; /* 0x180A8:  */
    __R  uint8_t  RESERVED74[32596];           /* 0x180AC - 0x1FFFF: Reserved */
    struct {
        struct {
            __R  uint32_t MAC_VER;             /* 0x20000:  */
            __RW uint32_t MAC_MACADDR_L;       /* 0x20004:  */
            __RW uint32_t MAC_MACADDR_H;       /* 0x20008:  */
            __RW uint32_t MAC_MAC_CTRL;        /* 0x2000C:  */
            __R  uint32_t MAC_TX_FRAMES;       /* 0x20010:  */
            __R  uint32_t MAC_RX_FRAMES;       /* 0x20014:  */
            __R  uint32_t MAC_TX_OCTETS;       /* 0x20018:  */
            __R  uint32_t MAC_RX_OCTETS;       /* 0x2001C:  */
            __RW uint32_t MAC_MDIO_CFG;        /* 0x20020:  */
            __RW uint32_t MAC_MDIO_CTRL;       /* 0x20024:  */
            __R  uint32_t MAC_MDIO_RD_DATA;    /* 0x20028:  */
            __RW uint32_t MAC_MDIO_WR_DATA;    /* 0x2002C:  */
            __RW uint32_t MAC_IRQ_CTRL;        /* 0x20030:  */
            __R  uint8_t  RESERVED0[460];      /* 0x20034 - 0x201FF: Reserved */
        } MAC[2];
        __R  uint8_t  RESERVED0[1024];         /* 0x20400 - 0x207FF: Reserved */
        __RW uint32_t RTC_CR;                  /* 0x20800: ONLY IN PORT1 */
        __RW uint32_t RTC_SR;                  /* 0x20804: ONLY IN PORT1 */
        __R  uint8_t  RESERVED1[8];            /* 0x20808 - 0x2080F: Reserved */
        __RW uint32_t RTC_CT_CURTIME_NS;       /* 0x20810: ONLY IN PORT1 */
        __R  uint32_t RTC_CT_CURTIME_SEC;      /* 0x20814: ONLY IN PORT1 */
        __R  uint8_t  RESERVED2[4];            /* 0x20818 - 0x2081B: Reserved */
        __RW uint32_t RTC_CT_TIMER_INCR;       /* 0x2081C: ONLY IN PORT1 */
        __RW uint32_t RTC_OFS_NS;              /* 0x20820: ONLY IN PORT1 */
        __RW uint32_t RTC_OFS_SL;              /* 0x20824: ONLY IN PORT1 */
        __RW uint32_t RTC_OFS_SH;              /* 0x20828: ONLY IN PORT1 */
        __RW uint32_t RTC_OFS_CH;              /* 0x2082C: ONLY IN PORT1 */
        __RW uint32_t RTC_ALARM_NS;            /* 0x20830: ONLY IN PORT1 */
        __RW uint32_t RTC_ALARM_SL;            /* 0x20834: ONLY IN PORT1 */
        __RW uint32_t RTC_ALARM_SH;            /* 0x20838: ONLY IN PORT1 */
        __R  uint8_t  RESERVED3[4];            /* 0x2083C - 0x2083F: Reserved */
        __RW uint32_t RTC_TIMER_A_PERIOD;      /* 0x20840: ONLY IN PORT1 */
        __R  uint8_t  RESERVED4[1984];         /* 0x20844 - 0x21003: Reserved */
        __RW uint32_t TSYN_CR;                 /* 0x21004:  */
        __RW uint32_t TSYN_SR;                 /* 0x21008:  */
        __R  uint8_t  RESERVED5[4];            /* 0x2100C - 0x2100F: Reserved */
        __R  uint32_t TSYN_PTP_TX_STS;         /* 0x21010:  */
        __RW uint32_t TSYN_PTP_TX_DONE;        /* 0x21014:  */
        __W  uint32_t TSYN_PTP_TX_TRIG;        /* 0x21018:  */
        __RW uint32_t TSYN_PTP_RX_STS;         /* 0x2101C:  */
        __RW uint32_t TSYNTMR[5];              /* 0x21020 - 0x21030:  */
        __R  uint8_t  RESERVED6[8];            /* 0x21034 - 0x2103B: Reserved */
        __RW uint32_t TSYN_HCLKDIV;            /* 0x2103C:  */
        __R  uint8_t  RESERVED7[1472];         /* 0x21040 - 0x215FF: Reserved */
        __R  uint32_t TSYN_RXBUF_RX_FRAME_LENGTH_BYTES; /* 0x21600:  */
        __R  uint8_t  RESERVED8[4];            /* 0x21604 - 0x21607: Reserved */
        __R  uint32_t TSYN_RXBUF_RX_TIME_STAMP_L; /* 0x21608:  */
        __R  uint32_t TSYN_RXBUF_RX_TIME_STAMP_H; /* 0x2160C:  */
        __R  uint32_t RXDATA[60];              /* 0x21610 - 0x216FC:  */
        __R  uint8_t  RESERVED9[256];          /* 0x21700 - 0x217FF: Reserved */
        struct {
            __RW uint32_t TXDATA[60];          /* 0x21800 - 0x218EC:  */
            __RW uint32_t TSYN_TXBUF_BIN0_TQUE_AND_TX_LEN; /* 0x218F0:  */
            __R  uint8_t  RESERVED0[4];        /* 0x218F4 - 0x218F7: Reserved */
            __RW uint32_t TSYN_TXBUF_BIN0_TX_TIMESTAMP_L; /* 0x218F8:  */
            __RW uint32_t TSYN_TXBUF_BIN0_TX_TIMESTAMP_H; /* 0x218FC:  */
        } BIN[8];
        __R  uint8_t  RESERVED10[4];           /* 0x22000 - 0x22003: Reserved */
        __R  uint32_t TSN_SHAPER_HWCFG1;       /* 0x22004:  */
        __R  uint8_t  RESERVED11[4];           /* 0x22008 - 0x2200B: Reserved */
        __RW uint32_t TSN_SHAPER_TQAV;         /* 0x2200C:  */
        __R  uint32_t TSN_SHAPER_TQEM;         /* 0x22010:  */
        __RW uint32_t TSN_SHAPER_FPST;         /* 0x22014:  */
        __RW uint32_t TSN_SHAPER_MMCT;         /* 0x22018:  */
        __RW uint32_t TSN_SHAPER_HOLDADV;      /* 0x2201C:  */
        __R  uint8_t  RESERVED12[224];         /* 0x22020 - 0x220FF: Reserved */
        __RW uint32_t MXSDU[8];                /* 0x22100 - 0x2211C:  */
        __RW uint32_t TXSEL[8];                /* 0x22120 - 0x2213C:  */
        __RW uint32_t IDSEL[8];                /* 0x22140 - 0x2215C:  */
        __R  uint8_t  RESERVED13[1696];        /* 0x22160 - 0x227FF: Reserved */
        __RW uint32_t PORT1_QCH0_CFG;          /* 0x22800: qch channel0 control */
        __RW uint32_t PORT1_QCH1_CFG;          /* 0x22804: qch channel1 control */
        __RW uint32_t PORT1_QCH2_CFG;          /* 0x22808: qch channel2 control */
        __RW uint32_t PORT1_QCH3_CFG;          /* 0x2280C: qch channel3 control */
        __RW uint32_t PORT1_QCH_ERR_CFG;       /* 0x22810: qch clear */
        __R  uint8_t  RESERVED14[2028];        /* 0x22814 - 0x22FFF: Reserved */
        __RW uint32_t TSN_SHAPER_TAS_CRSR;     /* 0x23000:  */
        __RW uint32_t TSN_SHAPER_TAS_ACYCLETM; /* 0x23004:  */
        __RW uint32_t TSN_SHAPER_TAS_ABASETM_L;/* 0x23008:  */
        __RW uint32_t TSN_SHAPER_TAS_ABASETM_H;/* 0x2300C:  */
        __RW uint32_t TSN_SHAPER_TAS_LISTLEN;  /* 0x23010:  */
        __R  uint32_t TSN_SHAPER_TAS_OCYCLETM; /* 0x23014:  */
        __R  uint32_t TSN_SHAPER_TAS_OBASETM_L;/* 0x23018:  */
        __R  uint32_t TSN_SHAPER_TAS_OBASETM_H;/* 0x2301C:  */
        __RW uint32_t MXTK[8];                 /* 0x23020 - 0x2303C:  */
        __RW uint32_t TXOV[8];                 /* 0x23040 - 0x2305C:  */
        __R  uint8_t  RESERVED15[1952];        /* 0x23060 - 0x237FF: Reserved */
        struct {
            __RW uint32_t TSN_SHAPER_ACLIST_ENTRY0_L; /* 0x23800:  */
            __RW uint32_t TSN_SHAPER_ACLIST_ENTRY0_H; /* 0x23804:  */
        } SHACL[256];
        __R  uint8_t  RESERVED16[45056];       /* 0x24000 - 0x2EFFF: Reserved */
        __R  uint32_t TSN_EP_VER;              /* 0x2F000:  */
        __RW uint32_t TSN_EP_CTRL;             /* 0x2F004:  */
        __R  uint8_t  RESERVED17[8];           /* 0x2F008 - 0x2F00F: Reserved */
        __RW uint32_t TSN_EP_TXUF;             /* 0x2F010:  */
        __R  uint32_t TSN_EP_IPCFG;            /* 0x2F014:  */
        __R  uint8_t  RESERVED18[8];           /* 0x2F018 - 0x2F01F: Reserved */
        __R  uint32_t TSN_EP_TSF_D0;           /* 0x2F020:  */
        __R  uint32_t TSN_EP_TSF_D1;           /* 0x2F024:  */
        __R  uint32_t TSN_EP_TSF_D2;           /* 0x2F028:  */
        __RW uint32_t TSN_EP_TSF_SR;           /* 0x2F02C:  */
        __RW uint32_t TSN_EP_MMS_CTRL;         /* 0x2F030:  */
        __R  uint32_t TSN_EP_MMS_STS;          /* 0x2F034:  */
        __RW uint32_t TSN_EP_MMS_VTIME;        /* 0x2F038:  */
        __RW uint32_t TSN_EP_MMS_STAT;         /* 0x2F03C:  */
        __W  uint32_t TSN_EP_PTP_UPTM_NS;      /* 0x2F040:  */
        __W  uint32_t TSN_EP_PTP_UPTM_S;       /* 0x2F044:  */
        __R  uint32_t TSN_EP_PTP_SR;           /* 0x2F048:  */
        __R  uint8_t  RESERVED19[4020];        /* 0x2F04C - 0x2FFFF: Reserved */
        __RW uint32_t SW_CTRL_PORT_MAIN_TAGGING; /* 0x30000: PVID Tagging Register */
        __RW uint32_t SW_CTRL_PORT_MAIN_ENNABLE; /* 0x30004: Port Module Enable Register */
        __R  uint8_t  RESERVED20[8184];        /* 0x30008 - 0x31FFF: Reserved */
        __RW uint32_t SW_CTRL_EGRESS_ECSR_QDROP; /* 0x32000:  */
        __R  uint8_t  RESERVED21[8188];        /* 0x32004 - 0x33FFF: Reserved */
        struct {
            __R  uint32_t SW_CTRL_IGRESS_RX_FDFIFO_E_FDMEM_CNT_BYTE; /* 0x34000:  */
            __R  uint32_t SW_CTRL_IGRESS_RX_FDFIFO_E_FDMEM_STS; /* 0x34004:  */
            __RW uint32_t SW_CTRL_IGRESS_RX_FDFIFO_E_ERROR_FLAG; /* 0x34008:  */
            __RW uint32_t SW_CTRL_IGRESS_RX_FDFIFO_E_IE_ERROR_FLAG; /* 0x3400C:  */
            __RW uint32_t SW_CTRL_IGRESS_RX_FDFIFO_E_IN_CONFIG; /* 0x34010:  */
            __RW uint32_t SW_CTRL_IGRESS_RX_FDFIFO_E_OUT_CONFIG; /* 0x34014:  */
            __W  uint32_t SW_CTRL_IGRESS_RX_FDFIFO_E_RESET; /* 0x34018:  */
            __R  uint32_t SW_CTRL_IGRESS_RX_FDFIFO_E_PARAM; /* 0x3401C:  */
            __RW uint32_t SW_CTRL_IGRESS_RX_FDFIFO_E_STRFWD; /* 0x34020:  */
            __RW uint32_t SW_CTRL_IGRESS_RX_FDFIFO_E_PORTMASK; /* 0x34024:  */
            __RW uint32_t SW_CTRL_IGRESS_RX_FDFIFO_E_MIRROR; /* 0x34028:  */
            __RW uint32_t SW_CTRL_IGRESS_RX_FDFIFO_E_MIRROR_TX; /* 0x3402C:  */
            __R  uint8_t  RESERVED0[208];      /* 0x34030 - 0x340FF: Reserved */
        } RXFIFO[2];
        __R  uint8_t  RESERVED22[15876];       /* 0x34200 - 0x38003: Reserved */
        __RW uint32_t SW_CTRL_MONITOR_CTRL;    /* 0x38004:  */
        __W  uint32_t SW_CTRL_MONITOR_RESET;   /* 0x38008:  */
        __R  uint32_t SW_CTRL_MONITOR_PARAM;   /* 0x3800C:  */
        __R  uint32_t MONITOR_TX_COUNTER_TX_FGOOD; /* 0x38010:  */
        __R  uint8_t  RESERVED23[4];           /* 0x38014 - 0x38017: Reserved */
        __R  uint32_t MONITOR_TX_COUNTER_TX_FERROR; /* 0x38018:  */
        __R  uint8_t  RESERVED24[4];           /* 0x3801C - 0x3801F: Reserved */
        __R  uint32_t MONITOR_TX_COUNTER_TX_DROP_OVFL; /* 0x38020:  */
        __R  uint8_t  RESERVED25[28];          /* 0x38024 - 0x3803F: Reserved */
        __R  uint32_t MONITOR_RX_COUNTER_RX_FGOOD; /* 0x38040:  */
        __R  uint8_t  RESERVED26[4];           /* 0x38044 - 0x38047: Reserved */
        __R  uint32_t MONITOR_RX_COUNTER_RX_FERROR; /* 0x38048:  */
        __R  uint8_t  RESERVED27[4];           /* 0x3804C - 0x3804F: Reserved */
        __R  uint32_t MONITOR_RX_COUNTER_RX_KNOWN; /* 0x38050:  */
        __R  uint8_t  RESERVED28[4];           /* 0x38054 - 0x38057: Reserved */
        __R  uint32_t MONITOR_RX_COUNTER_RX_UNKNOWN; /* 0x38058:  */
        __R  uint8_t  RESERVED29[4];           /* 0x3805C - 0x3805F: Reserved */
        __R  uint32_t MONITOR_RX_COUNTER_RX_UC;/* 0x38060:  */
        __R  uint8_t  RESERVED30[4];           /* 0x38064 - 0x38067: Reserved */
        __R  uint32_t MONITOR_RX_COUNTER_RX_INTERN; /* 0x38068:  */
        __R  uint8_t  RESERVED31[4];           /* 0x3806C - 0x3806F: Reserved */
        __R  uint32_t MONITOR_RX_COUNTER_RX_BC;/* 0x38070:  */
        __R  uint8_t  RESERVED32[4];           /* 0x38074 - 0x38077: Reserved */
        __R  uint32_t MONITOR_RX_COUNTER_RX_MULTI; /* 0x38078:  */
        __R  uint8_t  RESERVED33[4];           /* 0x3807C - 0x3807F: Reserved */
        __R  uint32_t MONITOR_RX_COUNTER_RX_VLAN; /* 0x38080:  */
        __R  uint8_t  RESERVED34[4];           /* 0x38084 - 0x38087: Reserved */
        __R  uint32_t MONITOR_RX_COUNTER_RX_DROP_OVFL; /* 0x38088:  */
        __R  uint8_t  RESERVED35[4];           /* 0x3808C - 0x3808F: Reserved */
        __R  uint32_t MONITOR_RX_COUNTER_RX_DROP_LU; /* 0x38090:  */
        __R  uint8_t  RESERVED36[4];           /* 0x38094 - 0x38097: Reserved */
        __R  uint32_t MONITOR_RX_COUNTER_RX_DROP_ERR; /* 0x38098:  */
        __R  uint8_t  RESERVED37[4];           /* 0x3809C - 0x3809F: Reserved */
        __R  uint32_t MONITOR_RX_COUNTER_RX_DROP_VLAN; /* 0x380A0:  */
        __R  uint8_t  RESERVED38[4];           /* 0x380A4 - 0x380A7: Reserved */
        __R  uint32_t MONITOR_RX_COUNTER_RX_FPE_FGOOD; /* 0x380A8:  */
        __R  uint8_t  RESERVED39[16212];       /* 0x380AC - 0x3BFFF: Reserved */
        __RW uint32_t GPR_CTRL0;               /* 0x3C000: control register0 */
        __R  uint8_t  RESERVED40[4];           /* 0x3C004 - 0x3C007: Reserved */
        __RW uint32_t GPR_CTRL2;               /* 0x3C008: control register2 */
        __R  uint8_t  RESERVED41[16372];       /* 0x3C00C - 0x3FFFF: Reserved */
    } TSNPORT[3];
} TSW_Type;


/* Bitfield definition for register: LU_MAIN_CTRL */
/*
 * BYP_EN (R/W)
 *
 * MAC lookup bypass
 */
#define TSW_LU_MAIN_CTRL_BYP_EN_MASK (0x1U)
#define TSW_LU_MAIN_CTRL_BYP_EN_SHIFT (0U)
#define TSW_LU_MAIN_CTRL_BYP_EN_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_CTRL_BYP_EN_SHIFT) & TSW_LU_MAIN_CTRL_BYP_EN_MASK)
#define TSW_LU_MAIN_CTRL_BYP_EN_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_CTRL_BYP_EN_MASK) >> TSW_LU_MAIN_CTRL_BYP_EN_SHIFT)

/* Bitfield definition for register: LU_MAIN_HITMEM */
/*
 * CAMMEMCLR (R/W)
 *
 * clear the cam memory
 */
#define TSW_LU_MAIN_HITMEM_CAMMEMCLR_MASK (0x2U)
#define TSW_LU_MAIN_HITMEM_CAMMEMCLR_SHIFT (1U)
#define TSW_LU_MAIN_HITMEM_CAMMEMCLR_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_HITMEM_CAMMEMCLR_SHIFT) & TSW_LU_MAIN_HITMEM_CAMMEMCLR_MASK)
