/*
 * Copyright (c) 2021-2024 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_QEO_H
#define HPM_QEO_H

typedef struct {
    struct {
        __RW uint32_t MODE;                    /* 0x0: analog waves mode */
        __RW uint32_t RESOLUTION;              /* 0x4: resolution of wave0/1/2 */
        __RW uint32_t PHASE_SHIFT[3];          /* 0x8 - 0x10: wave0 phase shifter */
        __RW uint32_t VD_VQ_INJECT[3];         /* 0x14 - 0x1C: wave0 vd vq inject value */
        __W  uint32_t VD_VQ_LOAD;              /* 0x20: load wave0/1/2 vd vq value */
        __RW uint32_t AMPLITUDE[3];            /* 0x24 - 0x2C: wave0 amplitude */
        __RW uint32_t MID_POINT[3];            /* 0x30 - 0x38: wave0 output middle point offset */
        struct {
            __RW uint32_t MIN;                 /* 0x3C: wave0 low area limit value */
            __RW uint32_t MAX;                 /* 0x40: wave0 high area limit value */
        } LIMIT[3];
        __RW uint32_t DEADZONE_SHIFT[3];       /* 0x54 - 0x5C: deadzone_shifter_wave0 */
    } WAVE;
    struct {
        __RW uint32_t MODE;                    /* 0x60: wave_a/b/z output mode */
        __RW uint32_t RESOLUTION;              /* 0x64: resolution of wave_a/b/z */
        __RW uint32_t PHASE_SHIFT[3];          /* 0x68 - 0x70: wave_a phase shifter */
        __RW uint32_t LINE_WIDTH;              /* 0x74: Two-phase orthogonality wave 1/4 period */
        __RW uint32_t WDOG_WIDTH;              /* 0x78: wdog width of qeo */
        __W  uint32_t POSTION_SYNC;            /* 0x7C: sync abz owned postion */
    } ABZ;
    struct {
        __RW uint32_t MODE;                    /* 0x80: pwm mode */
        __RW uint32_t RESOLUTION;              /* 0x84: resolution of pwm */
        __RW uint32_t PHASE_SHIFT[4];          /* 0x88 - 0x94: pwm_a phase shifter */
        __RW uint32_t PHASE_TABLE[24];         /* 0x98 - 0xF4: pwm_phase_table 0 */
    } PWM;
    __RW uint32_t POSTION_SOFTWARE;            /* 0xF8: softwave inject postion */
    __RW uint32_t POSTION_SEL;                 /* 0xFC: select softwave inject postion */
    __R  uint32_t STATUS;                      /* 0x100: qeo status */
    __R  uint32_t DEBUG0;                      /* 0x104: qeo debug 0 */
    __R  uint32_t DEBUG1;                      /* 0x108: qeo debug 1 */
    __R  uint32_t DEBUG2;                      /* 0x10C: qeo debug 2 */
    __R  uint32_t DEBUG3;                      /* 0x110: qeo debug 3 */
} QEO_Type;


/* Bitfield definition for register of struct WAVE: MODE */
/*
 * WAVE2_ABOVE_MAX_LIMIT (RW)
 *
 * wave2 above max limit mode.
 * 0: output 0xffff.
 * 1: output 0x0.
 * 2: output as level_max_limit2.level0_max_limit
 */
#define QEO_WAVE_MODE_WAVE2_ABOVE_MAX_LIMIT_MASK (0xC0000000UL)
#define QEO_WAVE_MODE_WAVE2_ABOVE_MAX_LIMIT_SHIFT (30U)
#define QEO_WAVE_MODE_WAVE2_ABOVE_MAX_LIMIT_SET(x) (((uint32_t)(x) << QEO_WAVE_MODE_WAVE2_ABOVE_MAX_LIMIT_SHIFT) & QEO_WAVE_MODE_WAVE2_ABOVE_MAX_LIMIT_MASK)
#define QEO_WAVE_MODE_WAVE2_ABOVE_MAX_LIMIT_GET(x) (((uint32_t)(x) & QEO_WAVE_MODE_WAVE2_ABOVE_MAX_LIMIT_MASK) >> QEO_WAVE_MODE_WAVE2_ABOVE_MAX_LIMIT_SHIFT)

/*
 * WAVE2_HIGH_AREA1_LIMIT (RW)
 *
 * wave2 high area1 limit mode.
 * 0: output 0xffff.
 * 1: output as level_max_limit2.level0_max_limit
 */
#define QEO_WAVE_MODE_WAVE2_HIGH_AREA1_LIMIT_MASK (0x20000000UL)
