/*
 * Copyright (c) 2021-2024 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_SEI_H
#define HPM_SEI_H

typedef struct {
    struct {
        struct {
            __RW uint32_t CTRL;                /* 0x0: Engine control register */
            __RW uint32_t PTR_CFG;             /* 0x4: Pointer configuration register */
            __RW uint32_t WDG_CFG;             /* 0x8: Watch dog configuration register */
            __R  uint8_t  RESERVED0[4];        /* 0xC - 0xF: Reserved */
            __R  uint32_t EXE_STA;             /* 0x10: Execution status */
            __R  uint32_t EXE_PTR;             /* 0x14: Execution pointer */
            __R  uint32_t EXE_INST;            /* 0x18: Execution instruction */
            __R  uint32_t WDG_STA;             /* 0x1C: Watch dog status */
        } ENGINE;
        struct {
            __RW uint32_t CTRL;                /* 0x20: Transceiver control register */
            __RW uint32_t TYPE_CFG;            /* 0x24: Transceiver configuration register */
            __RW uint32_t BAUD_CFG;            /* 0x28: Transceiver baud rate register */
            __RW uint32_t DATA_CFG;            /* 0x2C: Transceiver data timing configuration */
            __RW uint32_t CLK_CFG;             /* 0x30: Transceiver clock timing configuration */
            __R  uint8_t  RESERVED0[4];        /* 0x34 - 0x37: Reserved */
            __R  uint32_t PIN;                 /* 0x38: Transceiver pin status */
            __R  uint32_t STATE;               /* 0x3C: FSM of asynchronous */
        } XCVR;
        struct {
            __RW uint32_t IN_CFG;              /* 0x40: Trigger input configuration */
            __W  uint32_t SW;                  /* 0x44: Software trigger */
            __RW uint32_t PRD_CFG;             /* 0x48: Period trigger configuration */
            __RW uint32_t PRD;                 /* 0x4C: Trigger period */
            __RW uint32_t OUT_CFG;             /* 0x50: Trigger output configuration */
            __R  uint8_t  RESERVED0[12];       /* 0x54 - 0x5F: Reserved */
            __R  uint32_t PRD_STS;             /* 0x60: Period trigger status */
            __R  uint32_t PRD_CNT;             /* 0x64: Period trigger counter */
            __R  uint8_t  RESERVED1[24];       /* 0x68 - 0x7F: Reserved */
        } TRG;
        struct {
            __RW uint32_t CMD[4];              /* 0x80 - 0x8C: Trigger command */
            __R  uint8_t  RESERVED0[16];       /* 0x90 - 0x9F: Reserved */
            __R  uint32_t TIME[4];             /* 0xA0 - 0xAC: Trigger Time */
            __R  uint8_t  RESERVED1[16];       /* 0xB0 - 0xBF: Reserved */
        } TRG_TABLE;
        struct {
            __RW uint32_t MODE;                /* 0xC0: command register mode */
            __RW uint32_t IDX;                 /* 0xC4: command register configuration */
            __R  uint8_t  RESERVED0[24];       /* 0xC8 - 0xDF: Reserved */
            __RW uint32_t CMD;                 /* 0xE0: command */
            __RW uint32_t SET;                 /* 0xE4: command bit set register */
            __RW uint32_t CLR;                 /* 0xE8: command bit clear register */
            __RW uint32_t INV;                 /* 0xEC: command bit invert register */
            __R  uint32_t IN;                  /* 0xF0: Commad input */
            __R  uint32_t OUT;                 /* 0xF4: Command output */
            __RW uint32_t STS;                 /* 0xF8: Command status */
            __R  uint8_t  RESERVED1[4];        /* 0xFC - 0xFF: Reserved */
        } CMD;
        struct {
            __RW uint32_t MIN;                 /* 0x100: command start value */
            __RW uint32_t MAX;                 /* 0x104: command end value */
            __RW uint32_t MSK;                 /* 0x108: command compare bit enable */
            __R  uint8_t  RESERVED0[4];        /* 0x10C - 0x10F: Reserved */
            __RW uint32_t PTA;                 /* 0x110: command pointer 0 - 3 */
            __RW uint32_t PTB;                 /* 0x114: command pointer 4 - 7 */
            __R  uint8_t  RESERVED1[8];        /* 0x118 - 0x11F: Reserved */
        } CMD_TABLE[8];
        struct {
            __RW uint32_t TRAN[4];             /* 0x200 - 0x20C: Latch state transition configuration */
            __RW uint32_t CFG;                 /* 0x210: Latch configuration */
            __R  uint8_t  RESERVED0[4];        /* 0x214 - 0x217: Reserved */
            __R  uint32_t TIME;                /* 0x218: Latch time */
            __R  uint32_t STS;                 /* 0x21C: Latch status */
        } LATCH[4];
        struct {
            __RW uint32_t SMP_EN;              /* 0x280: Sample selection register */
            __RW uint32_t SMP_CFG;             /* 0x284: Sample configuration */
            __RW uint32_t SMP_DAT;             /* 0x288: Sample data */
            __R  uint8_t  RESERVED0[4];        /* 0x28C - 0x28F: Reserved */
            __RW uint32_t SMP_POS;             /* 0x290: Sample override position */
            __RW uint32_t SMP_REV;             /* 0x294: Sample override revolution */
            __RW uint32_t SMP_SPD;             /* 0x298: Sample override speed */
            __RW uint32_t SMP_ACC;             /* 0x29C: Sample override accelerate */
            __RW uint32_t UPD_EN;              /* 0x2A0: Update configuration */
            __RW uint32_t UPD_CFG;             /* 0x2A4: Update configuration */
            __RW uint32_t UPD_DAT;             /* 0x2A8: Update data */
            __RW uint32_t UPD_TIME;            /* 0x2AC: Update overide time */
            __RW uint32_t UPD_POS;             /* 0x2B0: Update override position */
            __RW uint32_t UPD_REV;             /* 0x2B4: Update override revolution */
            __RW uint32_t UPD_SPD;             /* 0x2B8: Update override speed */
            __RW uint32_t UPD_ACC;             /* 0x2BC: Update override accelerate */
            __R  uint32_t SMP_VAL;             /* 0x2C0: Sample valid */
            __R  uint32_t SMP_STS;             /* 0x2C4: Sample status */
            __R  uint8_t  RESERVED1[4];        /* 0x2C8 - 0x2CB: Reserved */
            __R  uint32_t TIME_IN;             /* 0x2CC: input time */
            __R  uint32_t POS_IN;              /* 0x2D0: Input position */
            __R  uint32_t REV_IN;              /* 0x2D4: Input revolution */
            __R  uint32_t SPD_IN;              /* 0x2D8: Input speed */
            __R  uint32_t ACC_IN;              /* 0x2DC: Input accelerate */
            __R  uint8_t  RESERVED2[4];        /* 0x2E0 - 0x2E3: Reserved */
            __R  uint32_t UPD_STS;             /* 0x2E4: Update status */
            __R  uint8_t  RESERVED3[24];       /* 0x2E8 - 0x2FF: Reserved */
        } POS;
        struct {
            __RW uint32_t INT_EN;              /* 0x300: Interrupt Enable */
            __W  uint32_t INT_FLAG;            /* 0x304: Interrupt flag */
            __R  uint32_t INT_STS;             /* 0x308: Interrupt status */
            __R  uint8_t  RESERVED0[4];        /* 0x30C - 0x30F: Reserved */
            __RW uint32_t POINTER0;            /* 0x310: Match pointer 0 */
            __RW uint32_t POINTER1;            /* 0x314: Match pointer 1 */
            __RW uint32_t INSTR0;              /* 0x318: Match instruction 0 */
            __RW uint32_t INSTR1;              /* 0x31C: Match instruction 1 */
        } IRQ;
        __R  uint8_t  RESERVED0[224];          /* 0x320 - 0x3FF: Reserved */
    } CTRL[2];
    __R  uint8_t  RESERVED0[11264];            /* 0x800 - 0x33FF: Reserved */
    __RW uint32_t INSTR[64];                   /* 0x3400 - 0x34FC: Instructions */
    __R  uint8_t  RESERVED1[768];              /* 0x3500 - 0x37FF: Reserved */
    struct {
        __RW uint32_t MODE;                    /* 0x3800:  */
        __RW uint32_t IDX;                     /* 0x3804: Data register bit index */
        __RW uint32_t GOLD;                    /* 0x3808: Gold data for data check */
        __RW uint32_t CRCINIT;                 /* 0x380C: CRC calculation initial vector */
        __RW uint32_t CRCPOLY;                 /* 0x3810: CRC calculation polynomial */
        __R  uint8_t  RESERVED0[12];           /* 0x3814 - 0x381F: Reserved */
        __RW uint32_t DATA;                    /* 0x3820: Data value */
        __RW uint32_t SET;                     /* 0x3824: Data bit set */
        __RW uint32_t CLR;                     /* 0x3828: Data bit clear */
        __RW uint32_t INV;                     /* 0x382C: Data bit invert */
        __R  uint32_t IN;                      /* 0x3830: Data input */
        __R  uint32_t OUT;                     /* 0x3834: Data output */
        __RW uint32_t STS;                     /* 0x3838: Data status */
        __R  uint8_t  RESERVED1[4];            /* 0x383C - 0x383F: Reserved */
    } DAT[10];
} SEI_Type;


/* Bitfield definition for register of struct array CTRL: CTRL */
/*
 * WATCH (RW)
 *
 * Enable watch dog
 * 0: Watch dog disabled
 * 1: Watch dog enabled
 */
#define SEI_CTRL_ENGINE_CTRL_WATCH_MASK (0x1000000UL)
#define SEI_CTRL_ENGINE_CTRL_WATCH_SHIFT (24U)
#define SEI_CTRL_ENGINE_CTRL_WATCH_SET(x) (((uint32_t)(x) << SEI_CTRL_ENGINE_CTRL_WATCH_SHIFT) & SEI_CTRL_ENGINE_CTRL_WATCH_MASK)
#define SEI_CTRL_ENGINE_CTRL_WATCH_GET(x) (((uint32_t)(x) & SEI_CTRL_ENGINE_CTRL_WATCH_MASK) >> SEI_CTRL_ENGINE_CTRL_WATCH_SHIFT)

/*
 * ARMING (RW)
 *
 * Wait for trigger before excuting
 * 0: Execute on enable
 * 1: Wait trigger before exection after enabled
 */
#define SEI_CTRL_ENGINE_CTRL_ARMING_MASK (0x10000UL)
#define SEI_CTRL_ENGINE_CTRL_ARMING_SHIFT (16U)
#define SEI_CTRL_ENGINE_CTRL_ARMING_SET(x) (((uint32_t)(x) << SEI_CTRL_ENGINE_CTRL_ARMING_SHIFT) & SEI_CTRL_ENGINE_CTRL_ARMING_MASK)
