/*
 * Copyright (c) 2021-2024 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_RDC_H
#define HPM_RDC_H

typedef struct {
    __RW uint32_t RDC_CTL;                     /* 0x0: rdc control */
    __R  uint32_t ACC_I;                       /* 0x4: accumulate result of i_channel */
    __R  uint32_t ACC_Q;                       /* 0x8: accumulate result of q_channel */
    __RW uint32_t IN_CTL;                      /* 0xC: input channel selection */
    __RW uint32_t OUT_CTL;                     /* 0x10: output channel selection */
    __R  uint8_t  RESERVED0[32];               /* 0x14 - 0x33: Reserved */
    __RW uint32_t EXC_TIMMING;                 /* 0x34: excitation signal timming setting */
    __RW uint32_t EXC_SCALING;                 /* 0x38: amplitude scaling for excitation */
    __RW uint32_t EXC_OFFSET;                  /* 0x3C: amplitude offset setting */
    __RW uint32_t PWM_SCALING;                 /* 0x40: amplitude scaling for excitation */
    __RW uint32_t PWM_OFFSET;                  /* 0x44: amplitude offset setting */
    __RW uint32_t TRIG_OUT0_CFG;               /* 0x48: Configuration for trigger out 0 in clock cycle */
    __RW uint32_t TRIG_OUT1_CFG;               /* 0x4C: Configuration for trigger out 1 in clock cycle */
    __RW uint32_t PWM_DZ;                      /* 0x50: pwm dead zone control in clock cycle */
    __RW uint32_t SYNC_OUT_CTRL;               /* 0x54: synchronize output signal control */
    __RW uint32_t EXC_SYNC_DLY;                /* 0x58: trigger in delay timming in soc bus cycle */
    __R  uint8_t  RESERVED1[20];               /* 0x5C - 0x6F: Reserved */
    __RW uint32_t MAX_I;                       /* 0x70: max value of  i_channel */
    __RW uint32_t MIN_I;                       /* 0x74: min value of  i_channel */
    __RW uint32_t MAX_Q;                       /* 0x78: max value of  q_channel */
    __RW uint32_t MIN_Q;                       /* 0x7C: min value of  q_channel */
    __RW uint32_t THRS_I;                      /* 0x80: the offset setting for edge detection of the i_channel */
    __RW uint32_t THRS_Q;                      /* 0x84: the offset setting for edge detection of the q_channel */
    __RW uint32_t EDG_DET_CTL;                 /* 0x88: the control for edge detection */
    __RW uint32_t ACC_SCALING;                 /* 0x8C: scaling for accumulation result */
    __RW uint32_t EXC_PERIOD;                  /* 0x90: period of excitation */
    __R  uint8_t  RESERVED2[12];               /* 0x94 - 0x9F: Reserved */
    __RW uint32_t SYNC_DELAY_I;                /* 0xA0: delay  setting in clock cycle for synchronous signal */
    __R  uint8_t  RESERVED3[4];                /* 0xA4 - 0xA7: Reserved */
    __R  uint32_t RISE_DELAY_I;                /* 0xA8: delay in clock cycle between excitation synchrnous signal and rising edge of i_channel data */
    __R  uint32_t FALL_DELAY_I;                /* 0xAC: delay in clock cycle between excitation synchrnous signal and falling edge of i_channel data */
    __R  uint32_t SAMPLE_RISE_I;               /* 0xB0: sample value on rising edge of rectify signal */
    __R  uint32_t SAMPLE_FALL_I;               /* 0xB4: sample value on falling edge of rectify signal */
    __R  uint32_t ACC_CNT_I;                   /* 0xB8: number of accumulation */
    __R  uint32_t SIGN_CNT_I;                  /* 0xBC: sample counter of opposite sign with rectify signal */
    __RW uint32_t SYNC_DELAY_Q;                /* 0xC0: delay  setting in clock cycle for synchronous signal */
    __R  uint8_t  RESERVED4[4];                /* 0xC4 - 0xC7: Reserved */
    __R  uint32_t RISE_DELAY_Q;                /* 0xC8: delay in clock cycle between excitation synchrnous signal and rising edge of q_channel data */
    __R  uint32_t FALL_DELAY_Q;                /* 0xCC: delay in clock cycle between excitation synchrnous signal and falling edge of q_channel data */
    __R  uint32_t SAMPLE_RISE_Q;               /* 0xD0: sample value on rising edge of rectify signal */
    __R  uint32_t SAMPLE_FALL_Q;               /* 0xD4: sample value on falling edge of rectify signal */
    __R  uint32_t ACC_CNT_Q;                   /* 0xD8: number of accumulation */
    __R  uint32_t SIGN_CNT_Q;                  /* 0xDC: sample counter of opposite sign with rectify signal */
    __RW uint32_t AMP_MAX;                     /* 0xE0: the maximum of acc amplitude */
    __RW uint32_t AMP_MIN;                     /* 0xE4: the minimum of acc amplitude */
    __RW uint32_t INT_EN;                      /* 0xE8: the interrupt mask control */
    __W  uint32_t ADC_INT_STATE;               /* 0xEC: the interrupt state */
} RDC_Type;


/* Bitfield definition for register: RDC_CTL */
/*
 * TS_SEL (RW)
 *
 * Time stamp selection for accumulation
 * 0: end of accumulation
 * 1: start of accumulation
 * 2: center of accumulation
 */
#define RDC_RDC_CTL_TS_SEL_MASK (0x300000UL)
#define RDC_RDC_CTL_TS_SEL_SHIFT (20U)
#define RDC_RDC_CTL_TS_SEL_SET(x) (((uint32_t)(x) << RDC_RDC_CTL_TS_SEL_SHIFT) & RDC_RDC_CTL_TS_SEL_MASK)
#define RDC_RDC_CTL_TS_SEL_GET(x) (((uint32_t)(x) & RDC_RDC_CTL_TS_SEL_MASK) >> RDC_RDC_CTL_TS_SEL_SHIFT)

/*
 * ACC_LEN (RW)
 *
 * Accumulate time, support on the fly change
 * 0：1 cycle
 * 1：2 cycles
 * …
 * 255: 256 cycles
 */
#define RDC_RDC_CTL_ACC_LEN_MASK (0xFF000UL)
#define RDC_RDC_CTL_ACC_LEN_SHIFT (12U)
#define RDC_RDC_CTL_ACC_LEN_SET(x) (((uint32_t)(x) << RDC_RDC_CTL_ACC_LEN_SHIFT) & RDC_RDC_CTL_ACC_LEN_MASK)
