/*
 * Copyright (c) 2021-2024 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_MMC_H
#define HPM_MMC_H

typedef struct {
    __RW uint32_t CR;                          /* 0x0: Control Register */
    __RW uint32_t STA;                         /* 0x4: Status Register */
    __RW uint32_t INT_EN;                      /* 0x8: Interrupt Enable Register */
    __RW uint32_t SYSCLK_FREQ;                 /* 0xC: System Clock Frequency Register */
    __RW uint32_t SYSCLK_PERIOD;               /* 0x10: System Clock Period Register */
    __RW uint32_t OOSYNC_THETA_THR;            /* 0x14: Position Out-Of-Sync Threshold Regster */
    __RW uint32_t DISCRETECFG0;                /* 0x18: Discrete Mode Configuration 0 Register */
    __RW uint32_t DISCRETECFG1;                /* 0x1C: Discrete Mode Configuration 1 Register */
    __RW uint32_t CONTCFG0;                    /* 0x20: Continuous Mode Configuration 0 Register */
    __RW uint32_t INI_POS_TIME;                /* 0x24: The destined timestamp register for position initialization */
    __RW uint32_t INI_POS;                     /* 0x28: The destined position register for position initialization */
    __RW uint32_t INI_REV;                     /* 0x2C: The destined revolution register for position initialization */
    __RW uint32_t INI_SPEED;                   /* 0x30: The destined speed register for position initialization */
    __RW uint32_t INI_ACCEL;                   /* 0x34: The destined accelerator register for position initialization */
    __RW uint32_t INI_COEF_TIME;               /* 0x38: The destined timestamp register for coefficients initialization */
    __RW uint32_t INI_PCOEF;                   /* 0x3C: The destined coefficient P register for coefficients initialization */
    __RW uint32_t INI_ICOEF;                   /* 0x40: The destined coefficient I register for coefficients initialization */
    __RW uint32_t INI_ACOEF;                   /* 0x44: The destined coefficient A register for coefficients initialization */
    __R  uint32_t ESTM_TIM;                    /* 0x48: The timestamp register for internal estimation */
    __R  uint32_t ESTM_POS;                    /* 0x4C: The position register for the internal  estimation */
    __R  uint32_t ESTM_REV;                    /* 0x50: The revolution register for the internal  estimation */
    __R  uint32_t ESTM_SPEED;                  /* 0x54: The speed register for the internal estimation */
    __R  uint32_t ESTM_ACCEL;                  /* 0x58: The accelerator register for theinternal estimation */
    __R  uint32_t CUR_PCOEF;                   /* 0x5C: The coefficient P register for the internal estimation */
    __R  uint32_t CUR_ICOEF;                   /* 0x60: The coefficient I register for the internal estimation */
    __R  uint32_t CUR_ACOEF;                   /* 0x64: The coefficient A register for the internal estimation */
    __RW uint32_t INI_DELTA_POS_TIME;          /* 0x68: The destined timestamp register for delta position initialization */
    __RW uint32_t INI_DELTA_POS;               /* 0x6C: The destined delta position register for delta position initialization */
    __RW uint32_t INI_DELTA_REV;               /* 0x70: The destined delta revolution register for delta position initialization */
    __RW uint32_t INI_DELTA_SPEED;             /* 0x74: The destined delta speed register for delta position initialization */
    __RW uint32_t INI_DELTA_ACCEL;             /* 0x78: The destined delta accelerator register for delta position initialization */
    __R  uint8_t  RESERVED0[4];                /* 0x7C - 0x7F: Reserved */
    __RW uint32_t POS_TRG_CFG;                 /* 0x80: Tracking Configuration pos trigger cfg */
    __RW uint32_t POS_TRG_POS_THR;             /* 0x84: Tracking Configuration position threshold */
    __RW uint32_t POS_TRG_REV_THR;             /* 0x88: Tracking Configuration revolution threshold */
    __RW uint32_t SPEED_TRG_CFG;               /* 0x8C: Tracking Configuration speed trigger cfg */
    __RW uint32_t SPEED_TRG_THR;               /* 0x90: Tracking Configuration speed threshold */
    __R  uint8_t  RESERVED1[12];               /* 0x94 - 0x9F: Reserved */
    struct {
        __RW uint32_t ERR_THR;                 /* 0xA0: Tracking Configuration coef trigger cfg */
        __RW uint32_t P;                       /* 0xA4: Tracking Configuration coef trigger cfg P */
        __RW uint32_t I;                       /* 0xA8: Tracking Configuration coef trigger cfg I */
        __RW uint32_t A;                       /* 0xAC: Tracking Configuration coef trigger cfg A */
        __RW uint32_t TIME;                    /* 0xB0: Tracking Configuration coef trigger cfg time */
    } COEF_TRG_CFG[3];
    __R  uint8_t  RESERVED2[36];               /* 0xDC - 0xFF: Reserved */
    struct {
        __RW uint32_t BR_CTRL;                 /* 0x100: Prediction Control Register */
        __RW uint32_t BR_TIMEOFF;              /* 0x104: Prediction Timing Offset Register */
        __RW uint32_t BR_TRG_PERIOD;           /* 0x108: Prediction Triggering Period Offset Register */
        __RW uint32_t BR_TRG_F_TIME;           /* 0x10C: Prediction Triggering First Offset Register */
        __RW uint32_t BR_ST;                   /* 0x110: Prediction Status Register */
        __R  uint8_t  RESERVED0[44];           /* 0x114 - 0x13F: Reserved */
        __RW uint32_t BR_TRG_POS_CFG;          /* 0x140: Prediction Configuration postion trigger cfg */
        __RW uint32_t BR_TRG_POS_THR;          /* 0x144: Prediction Configuration postion threshold */
        __RW uint32_t BR_TRG_REV_THR;          /* 0x148: Prediction Configuration revolutiom threshold */
        __RW uint32_t BR_TRG_SPEED_CFG;        /* 0x14C: Prediction Configuration speed trigger cfg */
        __RW uint32_t BR_TRG_SPEED_THR;        /* 0x150: Prediction Configuration speed threshold */
        __R  uint8_t  RESERVED1[108];          /* 0x154 - 0x1BF: Reserved */
        __RW uint32_t BR_INI_POS_TIME;         /* 0x1C0: Initialization timestamp for open-loop mode */
        __RW uint32_t BR_INI_POS;              /* 0x1C4: Initialization position for open-loop mode */
        __RW uint32_t BR_INI_REV;              /* 0x1C8: Initialization revolution for open-loop mode */
        __RW uint32_t BR_INI_SPEED;            /* 0x1CC: Initialization speed for open-loop mode */
        __RW uint32_t BR_INI_ACCEL;            /* 0x1D0: Initialization acceleration for open-loop mode */
        __RW uint32_t BR_INI_DELTA_POS_TIME;   /* 0x1D4: Initialization timestamp for delta mode in prediction mode */
        __RW uint32_t BR_INI_DELTA_POS;        /* 0x1D8: Initialization delta position for delta mode in prediction mode */
        __RW uint32_t BR_INI_DELTA_REV;        /* 0x1DC: Initialization delta revolution for delta mode in prediction mode */
        __RW uint32_t BR_INI_DELTA_SPEED;      /* 0x1E0: Initialization delta speed for delta mode in prediction mode */
        __RW uint32_t BR_INI_DELTA_ACCEL;      /* 0x1E4: Initialization delta acceleration for delta mode in prediction mode */
        __R  uint8_t  RESERVED2[4];            /* 0x1E8 - 0x1EB: Reserved */
        __R  uint32_t BR_CUR_POS_TIME;         /* 0x1EC: Monitor of the output timestamp */
        __R  uint32_t BR_CUR_POS;              /* 0x1F0: Monitor of the output position */
        __R  uint32_t BR_CUR_REV;              /* 0x1F4: Monitor of the output revolution */
        __R  uint32_t BR_CUR_SPEED;            /* 0x1F8: Monitor of the output speed */
        __R  uint32_t BR_CUR_ACCEL;            /* 0x1FC: Monitor of the output acceleration */
    } BR[2];
    __R  uint32_t BK0_TIMESTAMP;               /* 0x300: Monitor of the just received input timestamp for tracing logic */
    __R  uint32_t BK0_POSITION;                /* 0x304: Monitor of the just received input position for tracing logic */
    __R  uint32_t BK0_REVOLUTION;              /* 0x308: Monitor of the just received input revolution for tracing logic */
    __R  uint32_t BK0_SPEED;                   /* 0x30C: Monitor of the just received input speed for tracing logic */
    __R  uint32_t BK0_ACCELERATOR;             /* 0x310: Monitor of the just received input acceleration for tracing logic */
    __R  uint8_t  RESERVED3[12];               /* 0x314 - 0x31F: Reserved */
    __R  uint32_t BK1_TIMESTAMP;               /* 0x320: Monitor of the previous received input timestamp for tracing logic */
    __R  uint32_t BK1_POSITION;                /* 0x324: Monitor of the previous received input position for tracing logic */
    __R  uint32_t BK1_REVOLUTION;              /* 0x328: Monitor of the previous received input revolution for tracing logic */
    __R  uint32_t BK1_SPEED;                   /* 0x32C: Monitor of the previous received input speed for tracing logic */
    __R  uint32_t BK1_ACCELERATOR;             /* 0x330: Monitor of the previous received input acceleration for tracing logic */
} MMC_Type;


/* Bitfield definition for register: CR */
/*
 * SFTRST (RW)
 *
 * Software reset, high active. When write 1 ,all internal logical will be reset.
 * 0b - No action
 * 1b - All MMC internal registers are forced into their reset state. Interface registers are not affected.
 */
#define MMC_CR_SFTRST_MASK (0x80000000UL)
#define MMC_CR_SFTRST_SHIFT (31U)
#define MMC_CR_SFTRST_SET(x) (((uint32_t)(x) << MMC_CR_SFTRST_SHIFT) & MMC_CR_SFTRST_MASK)
#define MMC_CR_SFTRST_GET(x) (((uint32_t)(x) & MMC_CR_SFTRST_MASK) >> MMC_CR_SFTRST_SHIFT)

/*
 * INI_BR0_POS_REQ (RW)
 *
 * Auto clear. Only effective in open_loop mode.
 */
#define MMC_CR_INI_BR0_POS_REQ_MASK (0x20000000UL)
#define MMC_CR_INI_BR0_POS_REQ_SHIFT (29U)
#define MMC_CR_INI_BR0_POS_REQ_SET(x) (((uint32_t)(x) << MMC_CR_INI_BR0_POS_REQ_SHIFT) & MMC_CR_INI_BR0_POS_REQ_MASK)
