/*
 * Copyright (c) 2021-2024 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_QEIV2_H
#define HPM_QEIV2_H

typedef struct {
    __RW uint32_t CR;                          /* 0x0: Control register */
    __RW uint32_t PHCFG;                       /* 0x4: Phase configure register */
    __RW uint32_t WDGCFG;                      /* 0x8: Watchdog configure register */
    __RW uint32_t PHIDX;                       /* 0xC: Phase index register */
    __RW uint32_t TRGOEN;                      /* 0x10: Tigger output enable register */
    __RW uint32_t READEN;                      /* 0x14: Read event enable register */
    __RW uint32_t ZCMP;                        /* 0x18: Z comparator */
    __RW uint32_t PHCMP;                       /* 0x1C: Phase comparator */
    __RW uint32_t SPDCMP;                      /* 0x20: Speed comparator */
    __RW uint32_t DMAEN;                       /* 0x24: DMA request enable register */
    __RW uint32_t SR;                          /* 0x28: Status register */
    __RW uint32_t IRQEN;                       /* 0x2C: Interrupt request register */
    struct {
        __RW uint32_t Z;                       /* 0x30: Z counter */
        __R  uint32_t PH;                      /* 0x34: Phase counter */
        __RW uint32_t SPD;                     /* 0x38: Speed counter */
        __R  uint32_t TMR;                     /* 0x3C: Timer counter */
    } COUNT[4];
    __R  uint8_t  RESERVED0[16];               /* 0x70 - 0x7F: Reserved */
    __RW uint32_t ZCMP2;                       /* 0x80: Z comparator */
    __RW uint32_t PHCMP2;                      /* 0x84: Phase comparator */
    __RW uint32_t SPDCMP2;                     /* 0x88: Speed comparator */
    __RW uint32_t MATCH_CFG;                   /* 0x8C:  */
    __RW uint32_t FILT_CFG[6];                 /* 0x90 - 0xA4: A signal filter config */
    __R  uint8_t  RESERVED1[88];               /* 0xA8 - 0xFF: Reserved */
    __RW uint32_t QEI_CFG;                     /* 0x100: qei config register */
    __R  uint8_t  RESERVED2[12];               /* 0x104 - 0x10F: Reserved */
    __RW uint32_t PULSE0_NUM;                  /* 0x110: pulse0_num */
    __RW uint32_t PULSE1_NUM;                  /* 0x114: pulse1_num */
    __R  uint32_t CYCLE0_CNT;                  /* 0x118: cycle0_cnt */
    __R  uint32_t CYCLE0PULSE_CNT;             /* 0x11C: cycle0pulse_cnt */
    __R  uint32_t CYCLE1_CNT;                  /* 0x120: cycle1_cnt */
    __R  uint32_t CYCLE1PULSE_CNT;             /* 0x124: cycle1pulse_cnt */
    __R  uint32_t CYCLE0_SNAP0;                /* 0x128: cycle0_snap0 */
    __R  uint32_t CYCLE0_SNAP1;                /* 0x12C: cycle0_snap1 */
    __R  uint32_t CYCLE1_SNAP0;                /* 0x130: cycle1_snap0 */
    __R  uint32_t CYCLE1_SNAP1;                /* 0x134: cycle1_snap1 */
    __R  uint8_t  RESERVED3[8];                /* 0x138 - 0x13F: Reserved */
    __RW uint32_t CYCLE0_NUM;                  /* 0x140: cycle0_num */
    __RW uint32_t CYCLE1_NUM;                  /* 0x144: cycle1_num */
    __R  uint32_t PULSE0_CNT;                  /* 0x148: pulse0_cnt */
    __R  uint32_t PULSE0CYCLE_CNT;             /* 0x14C: pulse0cycle_cnt */
    __R  uint32_t PULSE1_CNT;                  /* 0x150: pulse1_cnt */
    __R  uint32_t PULSE1CYCLE_CNT;             /* 0x154: pulse1cycle_cnt */
    __R  uint32_t PULSE0_SNAP0;                /* 0x158: pulse0_snap0 */
    __R  uint32_t PULSE0CYCLE_SNAP0;           /* 0x15C: pulse0cycle_snap0 */
    __R  uint32_t PULSE0_SNAP1;                /* 0x160: pulse0_snap1 */
    __R  uint32_t PULSE0CYCLE_SNAP1;           /* 0x164: pulse0cycle_snap1 */
    __R  uint32_t PULSE1_SNAP0;                /* 0x168: pulse1_snap0 */
    __R  uint32_t PULSE1CYCLE_SNAP0;           /* 0x16C: pulse1cycle_snap0 */
    __R  uint32_t PULSE1_SNAP1;                /* 0x170: pulse1_snap1 */
    __R  uint32_t PULSE1CYCLE_SNAP1;           /* 0x174: pulse1cycle_snap1 */
    __R  uint8_t  RESERVED4[136];              /* 0x178 - 0x1FF: Reserved */
    __RW uint32_t ADCX_CFG0;                   /* 0x200: adcx_cfg0 */
    __RW uint32_t ADCX_CFG1;                   /* 0x204: adcx_cfg1 */
    __RW uint32_t ADCX_CFG2;                   /* 0x208: adcx_cfg2 */
    __R  uint8_t  RESERVED5[4];                /* 0x20C - 0x20F: Reserved */
    __RW uint32_t ADCY_CFG0;                   /* 0x210: adcy_cfg0 */
    __RW uint32_t ADCY_CFG1;                   /* 0x214: adcy_cfg1 */
    __RW uint32_t ADCY_CFG2;                   /* 0x218: adcy_cfg2 */
    __R  uint8_t  RESERVED6[4];                /* 0x21C - 0x21F: Reserved */
    __RW uint32_t CAL_CFG;                     /* 0x220: cal_cfg */
    __R  uint8_t  RESERVED7[12];               /* 0x224 - 0x22F: Reserved */
    __RW uint32_t PHASE_PARAM;                 /* 0x230: phase_param */
    __R  uint8_t  RESERVED8[4];                /* 0x234 - 0x237: Reserved */
    __RW uint32_t POS_THRESHOLD;               /* 0x238: pos_threshold */
    __R  uint8_t  RESERVED9[4];                /* 0x23C - 0x23F: Reserved */
    __RW uint32_t UVW_POS[6];                  /* 0x240 - 0x254: uvw_pos0 */
    __RW uint32_t UVW_POS_CFG[6];              /* 0x258 - 0x26C: uvw_pos0_cfg */
    __R  uint8_t  RESERVED10[16];              /* 0x270 - 0x27F: Reserved */
    __RW uint32_t PHASE_CNT;                   /* 0x280: phase_cnt */
    __W  uint32_t PHASE_UPDATE;                /* 0x284: phase_update */
    __RW uint32_t POSITION;                    /* 0x288: position */
    __W  uint32_t POSITION_UPDATE;             /* 0x28C: position_update */
    __R  uint32_t ANGLE;                       /* 0x290:  */
    __RW uint32_t POS_TIMEOUT;                 /* 0x294: pos_timeout */
} QEIV2_Type;


/* Bitfield definition for register: CR */
/*
 * READ (WO)
 *
 * 1- load phcnt, zcnt, spdcnt and tmrcnt into their read registers. Hardware auto-clear; read as 0
 */
#define QEIV2_CR_READ_MASK (0x80000000UL)
#define QEIV2_CR_READ_SHIFT (31U)
#define QEIV2_CR_READ_SET(x) (((uint32_t)(x) << QEIV2_CR_READ_SHIFT) & QEIV2_CR_READ_MASK)
#define QEIV2_CR_READ_GET(x) (((uint32_t)(x) & QEIV2_CR_READ_MASK) >> QEIV2_CR_READ_SHIFT)

/*
 * ZCNTCFG (RW)
 *
 * 1- zcnt will increment when phcnt upcount to phmax, decrement when phcnt downcount to 0
 * 0- zcnt will increment or decrement when Z input assert
 */
#define QEIV2_CR_ZCNTCFG_MASK (0x400000UL)
#define QEIV2_CR_ZCNTCFG_SHIFT (22U)
#define QEIV2_CR_ZCNTCFG_SET(x) (((uint32_t)(x) << QEIV2_CR_ZCNTCFG_SHIFT) & QEIV2_CR_ZCNTCFG_MASK)
#define QEIV2_CR_ZCNTCFG_GET(x) (((uint32_t)(x) & QEIV2_CR_ZCNTCFG_MASK) >> QEIV2_CR_ZCNTCFG_SHIFT)

/*
 * PHCALIZ (RW)
 *
