/*
 * Copyright (c) 2021-2024 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_SYSCTL_H
#define HPM_SYSCTL_H

typedef struct {
    __RW uint32_t RESOURCE[350];               /* 0x0 - 0x574: Resource control register for cpu0 */
    __R  uint8_t  RESERVED0[648];              /* 0x578 - 0x7FF: Reserved */
    struct {
        __RW uint32_t VALUE;                   /* 0x800: Goup setting */
        __RW uint32_t SET;                     /* 0x804: Goup setting */
        __RW uint32_t CLEAR;                   /* 0x808: Goup setting */
        __RW uint32_t TOGGLE;                  /* 0x80C: Goup setting */
    } GROUP0[3];
    __R  uint8_t  RESERVED1[16];               /* 0x830 - 0x83F: Reserved */
    struct {
        __RW uint32_t VALUE;                   /* 0x840: Goup setting */
        __RW uint32_t SET;                     /* 0x844: Goup setting */
        __RW uint32_t CLEAR;                   /* 0x848: Goup setting */
        __RW uint32_t TOGGLE;                  /* 0x84C: Goup setting */
    } GROUP1[3];
    __R  uint8_t  RESERVED2[144];              /* 0x870 - 0x8FF: Reserved */
    struct {
        __RW uint32_t VALUE;                   /* 0x900: Affiliate of Group */
        __RW uint32_t SET;                     /* 0x904: Affiliate of Group */
        __RW uint32_t CLEAR;                   /* 0x908: Affiliate of Group */
        __RW uint32_t TOGGLE;                  /* 0x90C: Affiliate of Group */
    } AFFILIATE[2];
    struct {
        __RW uint32_t VALUE;                   /* 0x920: Retention Control */
        __RW uint32_t SET;                     /* 0x924: Retention Control */
        __RW uint32_t CLEAR;                   /* 0x928: Retention Control */
        __RW uint32_t TOGGLE;                  /* 0x92C: Retention Control */
    } RETENTION[2];
    __R  uint8_t  RESERVED3[1728];             /* 0x940 - 0xFFF: Reserved */
    struct {
        __RW uint32_t STATUS;                  /* 0x1000: Power Setting */
        __RW uint32_t LF_WAIT;                 /* 0x1004: Power Setting */
        __R  uint8_t  RESERVED0[4];            /* 0x1008 - 0x100B: Reserved */
        __RW uint32_t OFF_WAIT;                /* 0x100C: Power Setting */
    } POWER[4];
    __R  uint8_t  RESERVED4[960];              /* 0x1040 - 0x13FF: Reserved */
    struct {
        __RW uint32_t CONTROL;                 /* 0x1400: Reset Setting */
        __RW uint32_t CONFIG;                  /* 0x1404: Reset Setting */
        __R  uint8_t  RESERVED0[4];            /* 0x1408 - 0x140B: Reserved */
        __RW uint32_t COUNTER;                 /* 0x140C: Reset Setting */
    } RESET[5];
    __R  uint8_t  RESERVED5[944];              /* 0x1450 - 0x17FF: Reserved */
    __RW uint32_t CLOCK[67];                   /* 0x1800 - 0x1908: Clock setting */
    __R  uint8_t  RESERVED6[756];              /* 0x190C - 0x1BFF: Reserved */
    __RW uint32_t ADCCLK[4];                   /* 0x1C00 - 0x1C0C: Clock setting */
    __RW uint32_t I2SCLK[4];                   /* 0x1C10 - 0x1C1C: Clock setting */
    __R  uint8_t  RESERVED7[992];              /* 0x1C20 - 0x1FFF: Reserved */
    __RW uint32_t GLOBAL00;                    /* 0x2000: Clock senario */
    __R  uint8_t  RESERVED8[1020];             /* 0x2004 - 0x23FF: Reserved */
    struct {
        __RW uint32_t CONTROL;                 /* 0x2400: Clock measure and monitor control */
        __R  uint32_t CURRENT;                 /* 0x2404: Clock measure result */
        __RW uint32_t LOW_LIMIT;               /* 0x2408: Clock lower limit */
        __RW uint32_t HIGH_LIMIT;              /* 0x240C: Clock upper limit */
        __R  uint8_t  RESERVED0[16];           /* 0x2410 - 0x241F: Reserved */
    } MONITOR[4];
    __R  uint8_t  RESERVED9[896];              /* 0x2480 - 0x27FF: Reserved */
    struct {
        __RW uint32_t LP;                      /* 0x2800:  */
        __RW uint32_t LOCK;                    /* 0x2804:  */
        __RW uint32_t GPR[14];                 /* 0x2808 - 0x283C:  */
        __R  uint32_t WAKEUP_STATUS[8];        /* 0x2840 - 0x285C:  */
        __R  uint8_t  RESERVED0[32];           /* 0x2860 - 0x287F: Reserved */
        __RW uint32_t WAKEUP_ENABLE[8];        /* 0x2880 - 0x289C:  */
        __R  uint8_t  RESERVED1[864];          /* 0x28A0 - 0x2BFF: Reserved */
    } CPU[2];
} SYSCTL_Type;


/* Bitfield definition for register array: RESOURCE */
/*
 * GLB_BUSY (RO)
 *
 * global busy
 * 0: no changes pending to any nodes
 * 1: any of nodes is changing status
 */
#define SYSCTL_RESOURCE_GLB_BUSY_MASK (0x80000000UL)
#define SYSCTL_RESOURCE_GLB_BUSY_SHIFT (31U)
#define SYSCTL_RESOURCE_GLB_BUSY_GET(x) (((uint32_t)(x) & SYSCTL_RESOURCE_GLB_BUSY_MASK) >> SYSCTL_RESOURCE_GLB_BUSY_SHIFT)

/*
 * LOC_BUSY (RO)
 *
 * local busy
 * 0: no change is pending for current node
 * 1: current node is changing status
 */
#define SYSCTL_RESOURCE_LOC_BUSY_MASK (0x40000000UL)
#define SYSCTL_RESOURCE_LOC_BUSY_SHIFT (30U)
#define SYSCTL_RESOURCE_LOC_BUSY_GET(x) (((uint32_t)(x) & SYSCTL_RESOURCE_LOC_BUSY_MASK) >> SYSCTL_RESOURCE_LOC_BUSY_SHIFT)

/*
 * MODE (RW)
 *
 * resource work mode
 * 0:auto turn on and off as system required(recommended)
 * 1:always on
 * 2:always off
 * 3:reserved
 */
