/*
 * Copyright (c) 2021-2024 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_CAM_H
#define HPM_CAM_H

typedef struct {
    __RW uint32_t CR1;                         /* 0x0: Control Register */
    __RW uint32_t INT_EN;                      /* 0x4: Interrupt Enable Register */
    __R  uint8_t  RESERVED0[8];                /* 0x8 - 0xF: Reserved */
    __RW uint32_t CR2;                         /* 0x10: Control 2 Register */
    __R  uint8_t  RESERVED1[16];               /* 0x14 - 0x23: Reserved */
    __RW uint32_t STA;                         /* 0x24: Status Register */
    __R  uint8_t  RESERVED2[8];                /* 0x28 - 0x2F: Reserved */
    __RW uint32_t DMASA_FB1;                   /* 0x30: Pixel DMA Frame Buffer 1 Address */
    __RW uint32_t DMASA_FB2;                   /* 0x34: Pixel DMA Frame Buffer 2 Address */
    __RW uint32_t BUF_PARA;                    /* 0x38: Buffer Parameters Register */
    __RW uint32_t IDEAL_WN_SIZE;               /* 0x3C: Ideal Image Size Register */
    __R  uint8_t  RESERVED3[12];               /* 0x40 - 0x4B: Reserved */
    __RW uint32_t CR18;                        /* 0x4C: Control CR18 Register */
    __RW uint32_t DMASA_UV1;                   /* 0x50: Pixel UV DMA Frame Buffer 1 Address */
    __RW uint32_t DMASA_UV2;                   /* 0x54: Pixel UV DMA Frame Buffer 2 Address */
    __RW uint32_t CR20;                        /* 0x58: Control CR20 Register */
    __R  uint8_t  RESERVED4[20];               /* 0x5C - 0x6F: Reserved */
    __RW uint32_t CSC_COEF0;                   /* 0x70: Color Space Conversion Config Register 0 */
    __RW uint32_t CSC_COEF1;                   /* 0x74: Color Space Conversion Config Register 1 */
    __RW uint32_t CSC_COEF2;                   /* 0x78: Color Space Conversion Config Register 2 */
    __RW uint32_t CLRKEY_LOW;                  /* 0x7C: Low Color Key Register */
    __RW uint32_t CLRKEY_HIGH;                 /* 0x80: High Color Key Register */
    __R  uint8_t  RESERVED5[12];               /* 0x84 - 0x8F: Reserved */
    __R  uint32_t HISTOGRAM_FIFO[256];         /* 0x90 - 0x48C: Histogram Registers */
} CAM_Type;


/* Bitfield definition for register: CR1 */
/*
 * COLOR_EXT (RW)
 *
 * If asserted, will change the output color to ARGB8888 mode. Used by input color as RGB565, RGB888, YUV888, etc.
 * The byte sequence is B,G,R,A. Depends on correct CR2[ClrBitFormat] configuration.
 */
#define CAM_CR1_COLOR_EXT_MASK (0x20000000UL)
#define CAM_CR1_COLOR_EXT_SHIFT (29U)
#define CAM_CR1_COLOR_EXT_SET(x) (((uint32_t)(x) << CAM_CR1_COLOR_EXT_SHIFT) & CAM_CR1_COLOR_EXT_MASK)
#define CAM_CR1_COLOR_EXT_GET(x) (((uint32_t)(x) & CAM_CR1_COLOR_EXT_MASK) >> CAM_CR1_COLOR_EXT_SHIFT)

/*
 * INV_PIXCLK (RW)
 *
 * invert pixclk pad input before it is used
 */
#define CAM_CR1_INV_PIXCLK_MASK (0x10000000UL)
#define CAM_CR1_INV_PIXCLK_SHIFT (28U)
#define CAM_CR1_INV_PIXCLK_SET(x) (((uint32_t)(x) << CAM_CR1_INV_PIXCLK_SHIFT) & CAM_CR1_INV_PIXCLK_MASK)
