/*
 * Copyright (c) 2021-2024 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_SDXC_H
#define HPM_SDXC_H

typedef struct {
    __RW uint32_t SDMASA;                      /* 0x0:  */
    __RW uint32_t BLK_ATTR;                    /* 0x4:  */
    __RW uint32_t CMD_ARG;                     /* 0x8:  */
    __RW uint32_t CMD_XFER;                    /* 0xC:  */
    __R  uint32_t RESP[4];                     /* 0x10 - 0x1C:  */
    __RW uint32_t BUF_DATA;                    /* 0x20:  */
    __R  uint32_t PSTATE;                      /* 0x24:  */
    __RW uint32_t PROT_CTRL;                   /* 0x28:  */
    __RW uint32_t SYS_CTRL;                    /* 0x2C:  */
    __RW uint32_t INT_STAT;                    /* 0x30:  */
    __RW uint32_t INT_STAT_EN;                 /* 0x34:  */
    __RW uint32_t INT_SIGNAL_EN;               /* 0x38:  */
    __RW uint32_t AC_HOST_CTRL;                /* 0x3C:  */
    __R  uint32_t CAPABILITIES1;               /* 0x40:  */
    __R  uint32_t CAPABILITIES2;               /* 0x44:  */
    __R  uint32_t CURR_CAPABILITIES1;          /* 0x48:  */
    __R  uint32_t CURR_CAPABILITIES2;          /* 0x4C:  */
    __W  uint32_t FORCE_EVENT;                 /* 0x50:  */
    __R  uint32_t ADMA_ERR_STAT;               /* 0x54:  */
    __RW uint32_t ADMA_SYS_ADDR;               /* 0x58:  */
    __R  uint8_t  RESERVED0[4];                /* 0x5C - 0x5F: Reserved */
    __R  uint16_t PRESET[11];                  /* 0x60 - 0x74:  */
    __R  uint8_t  RESERVED1[2];                /* 0x76 - 0x77: Reserved */
    __RW uint32_t ADMA_ID_ADDR;                /* 0x78:  */
    __R  uint8_t  RESERVED2[106];              /* 0x7C - 0xE5: Reserved */
    __R  uint16_t P_EMBEDDED_CNTRL;            /* 0xE6:  */
    __R  uint16_t P_VENDOR_SPECIFIC_AREA;      /* 0xE8:  */
    __R  uint16_t P_VENDOR2_SPECIFIC_AREA;     /* 0xEA:  */
    __R  uint8_t  RESERVED3[16];               /* 0xEC - 0xFB: Reserved */
    __R  uint16_t SLOT_INTR_STATUS;            /* 0xFC:  */
    __R  uint8_t  RESERVED4[130];              /* 0xFE - 0x17F: Reserved */
    __R  uint32_t CQVER;                       /* 0x180:  */
    __R  uint32_t CQCAP;                       /* 0x184:  */
    __RW uint32_t CQCFG;                       /* 0x188:  */
    __RW uint32_t CQCTL;                       /* 0x18C:  */
    __RW uint32_t CQIS;                        /* 0x190:  */
    __RW uint32_t CQISE;                       /* 0x194:  */
    __RW uint32_t CQISGE;                      /* 0x198:  */
    __RW uint32_t CQIC;                        /* 0x19C:  */
    __RW uint32_t CQTDLBA;                     /* 0x1A0:  */
    __R  uint8_t  RESERVED5[4];                /* 0x1A4 - 0x1A7: Reserved */
    __RW uint32_t CQTDBR;                      /* 0x1A8:  */
    __RW uint32_t CQTCN;                       /* 0x1AC:  */
    __RW uint32_t CQDQS;                       /* 0x1B0:  */
    __RW uint32_t CQDPT;                       /* 0x1B4:  */
    __RW uint32_t CQTCLR;                      /* 0x1B8:  */
    __R  uint8_t  RESERVED6[4];                /* 0x1BC - 0x1BF: Reserved */
    __RW uint32_t CQSSC1;                      /* 0x1C0:  */
    __RW uint32_t CQSSC2;                      /* 0x1C4:  */
    __R  uint32_t CQCRDCT;                     /* 0x1C8:  */
    __R  uint8_t  RESERVED7[4];                /* 0x1CC - 0x1CF: Reserved */
    __RW uint32_t CQRMEM;                      /* 0x1D0:  */
    __R  uint32_t CQTERRI;                     /* 0x1D4:  */
    __R  uint32_t CQCRI;                       /* 0x1D8:  */
    __R  uint32_t CQCRA;                       /* 0x1DC:  */
    __R  uint8_t  RESERVED8[800];              /* 0x1E0 - 0x4FF: Reserved */
    __R  uint32_t MSHC_VER_ID;                 /* 0x500:  */
    __R  uint32_t MSHC_VER_TYPE;               /* 0x504:  */
    __R  uint8_t  RESERVED9[36];               /* 0x508 - 0x52B: Reserved */
    __RW uint32_t EMMC_BOOT_CTRL;              /* 0x52C:  */
    __R  uint8_t  RESERVED10[16];              /* 0x530 - 0x53F: Reserved */
    __RW uint32_t AUTO_TUNING_CTRL;            /* 0x540:  */
    __RW uint32_t AUTO_TUNING_STAT;            /* 0x544:  */
} SDXC_Type;


/* Bitfield definition for register: SDMASA */
/*
 * BLOCKCNT_SDMASA (RW)
 *
 * 32-bit Block Count (SDMA System Address)
 * - SDMA System Address (Host Version 4 Enable = 0): This register contains the system memory address for an SDMA transfer in the 32-bit addressing mode.
 * When the Host Controller stops an SDMA transfer, this register points to the system address of the next contiguous data position.
 * It can be accessed only if no transaction is executing. Reading this register during data transfers may
 * return an invalid value.
 * - 32-bit Block Count (Host Version 4 Enable = 1): From the Host Controller Version 4.10 specification, this register is redefined as 32-bit Block Count.
 * The Host Controller decrements the block count of this register for every block transfer and the data transfer stops when the count reaches zero.
