/*
 * Copyright (c) 2021-2024 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_DDRCTL_H
#define HPM_DDRCTL_H

typedef struct {
    __RW uint32_t MSTR;                        /* 0x0: Description: Master Register */
    __R  uint32_t STAT;                        /* 0x4: Description: Operating Mode Status Register */
    __R  uint8_t  RESERVED0[8];                /* 0x8 - 0xF: Reserved */
    __RW uint32_t MRCTRL0;                     /* 0x10: Description: Mode Register Read/Write Control Register 0 */
    __RW uint32_t MRCTRL1;                     /* 0x14: Description: Mode Register Read/Write Control Register 1 */
    __R  uint32_t MRSTAT;                      /* 0x18: Description: Mode Register Read/Write Status Register */
    __R  uint8_t  RESERVED1[20];               /* 0x1C - 0x2F: Reserved */
    __RW uint32_t PWRCTL;                      /* 0x30: Description: Low Power Control Register */
    __RW uint32_t PWRTMG;                      /* 0x34: Description: Low Power Timing Register */
    __RW uint32_t HWLPCTL;                     /* 0x38: Description: Hardware Low Power Control Register */
    __R  uint8_t  RESERVED2[20];               /* 0x3C - 0x4F: Reserved */
    __RW uint32_t RFSHCTL0;                    /* 0x50: Description: Refresh Control Register 0 */
    __RW uint32_t RFSHCTL1;                    /* 0x54: Description: Refresh Control Register 1 */
    __R  uint8_t  RESERVED3[8];                /* 0x58 - 0x5F: Reserved */
    __RW uint32_t RFSHCTL3;                    /* 0x60: Description: Refresh Control Register 0 */
    __RW uint32_t RFSHTMG;                     /* 0x64: Description: Refresh Timing Register */
    __R  uint8_t  RESERVED4[60];               /* 0x68 - 0xA3: Reserved */
    __R  uint32_t ECCUADDR0;                   /* 0xA4: Description: ECC Uncorrected Error Address Register 0 */
    __R  uint8_t  RESERVED5[24];               /* 0xA8 - 0xBF: Reserved */
    __RW uint32_t CRCPARCTL0;                  /* 0xC0: Description: CRC Parity Control Register0 */
    __R  uint8_t  RESERVED6[8];                /* 0xC4 - 0xCB: Reserved */
    __R  uint32_t CRCPARSTAT;                  /* 0xCC: Description: CRC Parity Status Register */
    __RW uint32_t INIT0;                       /* 0xD0: Description: SDRAM Initialization Register 0 */
    __RW uint32_t INIT1;                       /* 0xD4: Description: SDRAM Initialization Register 1 */
    __R  uint8_t  RESERVED7[4];                /* 0xD8 - 0xDB: Reserved */
    __RW uint32_t INIT3;                       /* 0xDC: Description: SDRAM Initialization Register 3 */
    __RW uint32_t INIT4;                       /* 0xE0: Description: SDRAM Initialization Register 4 */
    __RW uint32_t INIT5;                       /* 0xE4: Description: SDRAM Initialization Register 5 */
    __R  uint8_t  RESERVED8[8];                /* 0xE8 - 0xEF: Reserved */
    __RW uint32_t DIMMCTL;                     /* 0xF0: Description: DIMM Control Register */
    __RW uint32_t RANKCTL;                     /* 0xF4: Description: Rank Control Register */
    __R  uint8_t  RESERVED9[8];                /* 0xF8 - 0xFF: Reserved */
    __RW uint32_t DRAMTMG0;                    /* 0x100: Description: SDRAM Timing Register 0 */
    __RW uint32_t DRAMTMG1;                    /* 0x104: Description: SDRAM Timing Register 1 */
    __RW uint32_t DRAMTMG2;                    /* 0x108: Description: SDRAM Timing Register 2 */
    __RW uint32_t DRAMTMG3;                    /* 0x10C: Description: SDRAM Timing Register 3 */
    __RW uint32_t DRAMTMG4;                    /* 0x110: Description: SDRAM Timing Register 4 */
    __RW uint32_t DRAMTMG5;                    /* 0x114: Description: SDRAM Timing Register 5 */
    __R  uint8_t  RESERVED10[8];               /* 0x118 - 0x11F: Reserved */
    __RW uint32_t DRAMTMG8;                    /* 0x120: Description: SDRAM Timing Register 8 */
    __R  uint8_t  RESERVED11[92];              /* 0x124 - 0x17F: Reserved */
    __RW uint32_t ZQCTL0;                      /* 0x180: Description: ZQ Control Register 0 */
    __RW uint32_t ZQCTL1;                      /* 0x184: Description: ZQ Control Register 1 */
    __R  uint8_t  RESERVED12[4];               /* 0x188 - 0x18B: Reserved */
    __R  uint32_t ZQSTAT;                      /* 0x18C: Description: ZQ Status Register */
    __RW uint32_t DFITMG0;                     /* 0x190: Description: DFI Timing Register 0 */
    __RW uint32_t DFITMG1;                     /* 0x194: Description: DFI Timing Register 1 */
    __RW uint32_t DFILPCFG0;                   /* 0x198: Description: DFI Low Power Configuration Register 0 */
    __R  uint8_t  RESERVED13[4];               /* 0x19C - 0x19F: Reserved */
    __RW uint32_t DFIUPD0;                     /* 0x1A0: Description: DFI Update Register 0 */
    __RW uint32_t DFIUPD1;                     /* 0x1A4: Description: DFI Update Register 1 */
    __RW uint32_t DFIUPD2;                     /* 0x1A8: Description: DFI Update Register 2 */
    __RW uint32_t DFIUPD3;                     /* 0x1AC: Description: DFI Update Register 3 */
    __RW uint32_t DFIMISC;                     /* 0x1B0: Description: DFI Miscellaneous Control Register */
    __RW uint32_t DFITMG2;                     /* 0x1B4: Description: DFI Timing Register 2 */
    __R  uint8_t  RESERVED14[72];              /* 0x1B8 - 0x1FF: Reserved */
    __RW uint32_t ADDRMAP0;                    /* 0x200: Description: Address Map Register 0 */
    __RW uint32_t ADDRMAP1;                    /* 0x204: Description: Address Map Register 1 */
    __RW uint32_t ADDRMAP2;                    /* 0x208: Description: Address Map Register 2 */
    __RW uint32_t ADDRMAP3;                    /* 0x20C: Description: Address Map Register 3 */
    __RW uint32_t ADDRMAP4;                    /* 0x210: Description: Address Map Register 4 */
    __RW uint32_t ADDRMAP5;                    /* 0x214: Description: Address Map Register 5 */
    __RW uint32_t ADDRMAP6;                    /* 0x218: Description: Address Map Register 6 */
    __R  uint8_t  RESERVED15[36];              /* 0x21C - 0x23F: Reserved */
    __RW uint32_t ODTCFG;                      /* 0x240: Description: ODT Configuration Register */
    __RW uint32_t ODTMAP;                      /* 0x244: Description: ODT/Rank Map Register */
    __R  uint8_t  RESERVED16[8];               /* 0x248 - 0x24F: Reserved */
    __RW uint32_t SCHED;                       /* 0x250: Description: Scheduler Control Register */
    __RW uint32_t SCHED1;                      /* 0x254: Description: Scheduler Control Register 1 */
    __R  uint8_t  RESERVED17[4];               /* 0x258 - 0x25B: Reserved */
    __RW uint32_t PERFHPR1;                    /* 0x25C: Description: High Priority Read CAM Register 1 */
    __R  uint8_t  RESERVED18[4];               /* 0x260 - 0x263: Reserved */
    __RW uint32_t PERFLPR1;                    /* 0x264: Description: Low Priority Read CAM Register 1 */
    __R  uint8_t  RESERVED19[4];               /* 0x268 - 0x26B: Reserved */
    __RW uint32_t PERFWR1;                     /* 0x26C: Description: Write CAM Register 1 */
    __R  uint8_t  RESERVED20[4];               /* 0x270 - 0x273: Reserved */
    __RW uint32_t PERFVPR1;                    /* 0x274: Description: Variable Priority Read CAM Register 1 */
    __RW uint32_t PERFVPW1;                    /* 0x278: Description: Variable Priority Write CAM Register 1 */
    __R  uint8_t  RESERVED21[132];             /* 0x27C - 0x2FF: Reserved */
    __RW uint32_t DBG0;                        /* 0x300: Description: Debug Register 0 */
    __RW uint32_t DBG1;                        /* 0x304: Description: Debug Register 1 */
    __R  uint32_t DBGCAM;                      /* 0x308: Description: CAM Debug Register */
    __RW uint32_t DBGCMD;                      /* 0x30C: Description: Command Debug Register */
    __R  uint32_t DBGSTAT;                     /* 0x310: Description: Status Debug Register */
    __R  uint8_t  RESERVED22[232];             /* 0x314 - 0x3FB: Reserved */
    __R  uint32_t PSTAT;                       /* 0x3FC: Description: Port Status Register */
    __RW uint32_t PCCFG;                       /* 0x400: Description: Port Common Configuration Register */
    struct {
        __RW uint32_t R;                       /* 0x404: Description: Port n Configuration Read Register */
        __RW uint32_t W;                       /* 0x408: Description: Port n Configuration Write Register */
        __RW uint32_t C;                       /* 0x40C: Description: Port n Common Configuration Register */
        struct {
            __RW uint32_t MASKCH;              /* 0x410: Description: Port n Channel m Configuration ID Mask Register */
            __RW uint32_t VALUECH;             /* 0x414: Description: Port n Channel m Configuration ID Value Register */
        } ID[16];
        __RW uint32_t CTRL;                    /* 0x490: Description: Port n Control Register */
        __RW uint32_t QOS0;                    /* 0x494: Description: Port n Read QoS Configuration Register 0 */
        __RW uint32_t QOS1;                    /* 0x498: Description: Port n Read QoS Configuration Register 1 */
        __RW uint32_t WQOS0;                   /* 0x49C: Description: Port n Write QoS Configuration Register 0 */
        __RW uint32_t WQOS1;                   /* 0x4A0: Description: Port n Write QoS Configuration Register 1 */
        __R  uint8_t  RESERVED0[16];           /* 0x4A4 - 0x4B3: Reserved */
    } PCFG[16];
    struct {
        __RW uint32_t BASE;                    /* 0xF04: Description: SAR Base Address Register n */
        __RW uint32_t SIZE;                    /* 0xF08: Description: SAR Size Register n */
    } SAR[4];
    __RW uint32_t SBRCTL;                      /* 0xF24: Description: Scrubber Control Register */
    __R  uint32_t SBRSTAT;                     /* 0xF28: Description: Scrubber Status Register */
    __RW uint32_t SBRWDATA0;                   /* 0xF2C: Description: Scrubber Write Data Pattern0 */
    __R  uint8_t  RESERVED23[4];               /* 0xF30 - 0xF33: Reserved */
} DDRCTL_Type;


/* Bitfield definition for register: MSTR */
/*
 * ACTIVE_RANKS (R/W)
 *
 * Description: Only present for multi-rank configurations. Each bit represents one rank. For two-rank configurations, only bits[25:24] are present.
 * 1 - populated
 * 0 - unpopulated
 * LSB is the lowest rank number.
 * For 2 ranks following combinations are legal:
 * 01 - One rank
 * 11 - Two ranks
 * Others - Reserved.
 * For 4 ranks following combinations are legal:
 * 0001 - One rank
 * 0011 - Two ranks
 * 1111 - Four ranks
 * Value After Reset: "(MEMC_NUM_RANKS==4) ? 0xF
 * :((MEMC_NUM_RANKS==2) ? 0x3 : 0x1)"
 * Exists: MEMC_NUM_RANKS>1
 */
#define DDRCTL_MSTR_ACTIVE_RANKS_MASK (0xF000000UL)
#define DDRCTL_MSTR_ACTIVE_RANKS_SHIFT (24U)
#define DDRCTL_MSTR_ACTIVE_RANKS_SET(x) (((uint32_t)(x) << DDRCTL_MSTR_ACTIVE_RANKS_SHIFT) & DDRCTL_MSTR_ACTIVE_RANKS_MASK)
