/*
 * Copyright (c) 2021-2024 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_DDRPHY_H
#define HPM_DDRPHY_H

typedef struct {
    __R  uint32_t RIDR;                        /* 0x0: Revision Identification Register */
    __RW uint32_t PIR;                         /* 0x4: PHY Initialization Register (PIR) */
    __RW uint32_t PGCR0;                       /* 0x8: PHY General Configuration Registers 0-1 (PGCR0- 1) */
    __RW uint32_t PGCR1;                       /* 0xC: PHY General Configuration Registers 0-1 (PGCR0- 1) */
    __R  uint32_t PGSR0;                       /* 0x10: “PHY General Status Registers 0-1 (PGSR0-1)” on page 89 */
    __R  uint32_t PGSR1;                       /* 0x14: “PHY General Status Registers 0-1 (PGSR0-1)” on page 89 */
    __RW uint32_t PLLCR;                       /* 0x18: “PLL Control Register (PLLCR)” on page 91 */
    __RW uint32_t PTR0;                        /* 0x1C: PHY Timing Registers 0-4 (PTR0-4) */
    __RW uint32_t PTR1;                        /* 0x20: PHY Timing Registers 0-4 (PTR0-4) */
    __RW uint32_t PTR2;                        /* 0x24: PHY Timing Registers 0-4 (PTR0-4) */
    __RW uint32_t PTR3;                        /* 0x28: PHY Timing Registers 0-4 (PTR0-4) */
    __RW uint32_t PTR4;                        /* 0x2C: PHY Timing Registers 0-4 (PTR0-4) */
    __RW uint32_t ACMDLR;                      /* 0x30: “AC Master Delay Line Register (ACMDLR)” on page 96 */
    __RW uint32_t ACBDLR;                      /* 0x34: “AC Bit Delay Line Register (ACBDLR)” on page 96 */
    __RW uint32_t ACIOCR;                      /* 0x38: “AC I/O Configuration Register (ACIOCR)” on page 97 */
    __RW uint32_t DXCCR;                       /* 0x3C: “DATX8 Common Configuration Register (DXCCR)” on page 99 */
    __RW uint32_t DSGCR;                       /* 0x40: “DDR System General Configuration Register (DSGCR)” on page 101 */
    __RW uint32_t DCR;                         /* 0x44: “DRAM Configuration Register (DCR)” on page 103 */
    __RW uint32_t DTPR0;                       /* 0x48: DRAM Timing Parameters Register 0-2 (DTPR0-2) */
    __RW uint32_t DTPR1;                       /* 0x4C: DRAM Timing Parameters Register 0-2 (DTPR0-2) */
    __RW uint32_t DTPR2;                       /* 0x50: DRAM Timing Parameters Register 0-2 (DTPR0-2) */
    union {
        __RW uint32_t MR0;                     /* 0x54: “Mode Register 0 (MR0)” on page 108 */
        __RW uint32_t MR;                      /* 0x54:  */
    };
    union {
        __RW uint32_t MR1;                     /* 0x58: “Mode Register 1 (MR1)” on page 111 */
        __RW uint32_t EMR;                     /* 0x58:  */
    };
    union {
        __RW uint32_t MR2;                     /* 0x5C: “Mode Register 2/Extended Mode Register 2 (MR2/EMR2)” on page 114 */
        __RW uint32_t EMR2;                    /* 0x5C:  */
    };
    union {
        __RW uint32_t MR3;                     /* 0x60: “Mode Register 3 (MR3)” on page 116 */
        __RW uint32_t EMR3;                    /* 0x60:  */
    };
    __RW uint32_t ODTCR;                       /* 0x64: “ODT Configuration Register (ODTCR)” on page 117 */
    __RW uint32_t DTCR;                        /* 0x68: “Data Training Configuration Register (DTCR)” on page 118 */
    __RW uint32_t DTAR0;                       /* 0x6C: Data Training Address Register 0-3 (DTAR0-3) */
    __RW uint32_t DTAR1;                       /* 0x70: Data Training Address Register 0-3 (DTAR0-3) */
    __RW uint32_t DTAR2;                       /* 0x74: Data Training Address Register 0-3 (DTAR0-3) */
    __RW uint32_t DTAR3;                       /* 0x78: Data Training Address Register 0-3 (DTAR0-3) */
    __RW uint32_t DTDR0;                       /* 0x7C: Data Training Eye Data Register 0-1 (DTEDR0-1) */
    __RW uint32_t DTDR1;                       /* 0x80: Data Training Eye Data Register 0-1 (DTEDR0-1) */
    __R  uint32_t DTEDR0;                      /* 0x84: Data Training Eye Data Register 0-1 (DTEDR0-1) */
    __R  uint32_t DTEDR1;                      /* 0x88: Data Training Eye Data Register 0-1 (DTEDR0-1) */
    __RW uint32_t PGCR2;                       /* 0x8C: “PHY General Configuration Register 2 (PGCR2)” on page 87 */
    __R  uint8_t  RESERVED0[32];               /* 0x90 - 0xAF: Reserved */
    __R  uint32_t RDIMMGCR0;                   /* 0xB0: RDIMM General Configuration Register 0-1 (RDIMMGCR0-1) */
    __R  uint32_t RDIMMGCR1;                   /* 0xB4: RDIMM General Configuration Register 0-1 (RDIMMGCR0-1) */
    __R  uint32_t RDIMMCR0;                    /* 0xB8: RDIMM Control Register 0-1 (RDIMMCR0-1) */
    __R  uint32_t RDIMMCR1;                    /* 0xBC: RDIMM Control Register 0-1 (RDIMMCR0-1) */
    __RW uint32_t DCUAR;                       /* 0xC0: “DCU Address Register (DCUAR)” on page 129 */
    __RW uint32_t DCUDR;                       /* 0xC4: “DCU Data Register (DCUDR)” on page 130 */
    __RW uint32_t DCURR;                       /* 0xC8: “DCU Run Register (DCURR)” on page 130 */
    __RW uint32_t DCULR;                       /* 0xCC: “DCU Loop Register (DCULR)” on page 131 */
    __RW uint32_t DCUGCR;                      /* 0xD0: “DCU General Configuration Register (DCUGCR)” on page 132 */
    __RW uint32_t DCUTPR;                      /* 0xD4: “DCU Timing Parameter Register (DCUTPR)” on page 132 */
    __R  uint32_t DCUSR0;                      /* 0xD8: DCU Status Register 0-1 (DCUSR0-1) */
    __R  uint32_t DCUSR1;                      /* 0xDC: DCU Status Register 0-1 (DCUSR0-1) */
    __R  uint8_t  RESERVED1[32];               /* 0xE0 - 0xFF: Reserved */
    __RW uint32_t BISTRR;                      /* 0x100: “BIST Run Register (BISTRR)” on page 133 */
    __RW uint32_t BISTWCR;                     /* 0x104: “BIST Word Count Register (BISTWCR)” on page 136 */
    __RW uint32_t BISTMSKR0;                   /* 0x108: BIST Mask Register 0-2 (BISTMSKR0-2) */
    __RW uint32_t BISTMSKR1;                   /* 0x10C: BIST Mask Register 0-2 (BISTMSKR0-2) */
    __RW uint32_t BISTMSKR2;                   /* 0x110: BIST Mask Register 0-2 (BISTMSKR0-2) */
    __RW uint32_t BISTLSR;                     /* 0x114: “BIST LFSR Seed Register (BISTLSR)” on page 137 */
    __RW uint32_t BISTAR0;                     /* 0x118: BIST Address Register 0-2 (BISTAR0-2) */
    __RW uint32_t BISTAR1;                     /* 0x11C: BIST Address Register 0-2 (BISTAR0-2) */
    __RW uint32_t BISTAR2;                     /* 0x120: BIST Address Register 0-2 (BISTAR0-2) */
    __RW uint32_t BISTUDPR;                    /* 0x124: “BIST User Data Pattern Register (BISTUDPR)” on page 138 */
    __R  uint32_t BISTGSR;                     /* 0x128: “BIST General Status Register (BISTGSR)” on page 139 */
    __R  uint32_t BISTWER;                     /* 0x12C: “BIST Word Error Register (BISTWER)” on page 139 */
    __R  uint32_t BISTBER0;                    /* 0x130: BIST Bit Error Register 0-3 (BISTBER0-3) */
    __R  uint32_t BISTBER1;                    /* 0x134: BIST Bit Error Register 0-3 (BISTBER0-3) */
    __R  uint32_t BISTBER2;                    /* 0x138: BIST Bit Error Register 0-3 (BISTBER0-3) */
    __R  uint32_t BISTBER3;                    /* 0x13C: BIST Bit Error Register 0-3 (BISTBER0-3) */
    __R  uint32_t BISTWCSR;                    /* 0x140: “BIST Word Count Status Register (BISTWCSR)” on page 141 */
    __R  uint32_t BISTFWR0;                    /* 0x144: BIST Fail Word Register 0-2 (BISTFWR0-2) */
    __R  uint32_t BISTFWR1;                    /* 0x148: BIST Fail Word Register 0-2 (BISTFWR0-2) */
    __R  uint32_t BISTFWR2;                    /* 0x14C: BIST Fail Word Register 0-2 (BISTFWR0-2) */
    __R  uint8_t  RESERVED2[36];               /* 0x150 - 0x173: Reserved */
    __RW uint32_t AACR;                        /* 0x174: “Anti-Aging Control Register (AACR)” on page 143 */
    __RW uint32_t GPR0;                        /* 0x178: General Purpose Register 0-1 (GPR0-1) */
    __RW uint32_t GPR1;                        /* 0x17C: General Purpose Register 0-1 (GPR0-1) */
    struct {
        __RW uint32_t CR0;                     /* 0x180: Impedance Control Register 0-1 (ZQnCR0-1) */
        __RW uint32_t CR1;                     /* 0x184: Impedance Control Register 0-1 (ZQnCR0-1) */
        __R  uint32_t SR0;                     /* 0x188: Impedance Status Register 0-1 (ZQnSR0-1) */
        __R  uint32_t SR1;                     /* 0x18C: Impedance Status Register 0-1 (ZQnSR0-1) */
    } ZQ[4];
    struct {
        __RW uint32_t GCR;                     /* 0x1C0: “DATX8 General Configuration Register (DXnGCR)” on page 148 */
        __R  uint32_t GSR0;                    /* 0x1C4: DATX8 General Status Registers 0-2 (DXnGSR0-2) */
        __R  uint32_t GSR1;                    /* 0x1C8: DATX8 General Status Registers 0-2 (DXnGSR0-2) */
        __RW uint32_t BDLR0;                   /* 0x1CC: DATX8 Bit Delay Line Register 0-4 (DXnBDLR0-4) */
        __RW uint32_t BDLR1;                   /* 0x1D0: DATX8 Bit Delay Line Register 0-4 (DXnBDLR0-4) */
        __RW uint32_t BDLR2;                   /* 0x1D4: DATX8 Bit Delay Line Register 0-4 (DXnBDLR0-4) */
        __RW uint32_t BDLR3;                   /* 0x1D8: DATX8 Bit Delay Line Register 0-4 (DXnBDLR0-4) */
        __RW uint32_t BDLR4;                   /* 0x1DC: DATX8 Bit Delay Line Register 0-4 (DXnBDLR0-4) */
        __RW uint32_t LCDLR0;                  /* 0x1E0: DATX8 Bit Delay Line Register 0-4 (DXnBDLR0-4) */
        __RW uint32_t LCDLR1;                  /* 0x1E4: DATX8 Bit Delay Line Register 0-4 (DXnBDLR0-4) */
        __RW uint32_t LCDLR2;                  /* 0x1E8: DATX8 Bit Delay Line Register 0-4 (DXnBDLR0-4) */
        __RW uint32_t MDLR;                    /* 0x1EC: “DATX8 Master Delay Line Register (DXnMDLR)” on page 157 */
        __RW uint32_t GTR;                     /* 0x1F0: “DATX8 General Timing Register (DXnGTR)” on page 159 */
        __RW uint32_t GSR2;                    /* 0x1F4: “DATX8 General Status Register 2 (DXnGSR2)” on page 152 */
        __R  uint8_t  RESERVED0[8];            /* 0x1F8 - 0x1FF: Reserved */
    } DX[9];
} DDRPHY_Type;


/* Bitfield definition for register: RIDR */
/*
 * UDRID (R)
 *
 * User-Defined Revision ID: General purpose revision identification set by the user.
 */
#define DDRPHY_RIDR_UDRID_MASK (0xFF000000UL)
#define DDRPHY_RIDR_UDRID_SHIFT (24U)
#define DDRPHY_RIDR_UDRID_GET(x) (((uint32_t)(x) & DDRPHY_RIDR_UDRID_MASK) >> DDRPHY_RIDR_UDRID_SHIFT)

/*
 * PHYMJR (R)
 *
 * PHY Major Revision: Indicates major revision of the PHY such addition of the features that make the new version not compatible with previous versions.
 */
#define DDRPHY_RIDR_PHYMJR_MASK (0xF00000UL)
#define DDRPHY_RIDR_PHYMJR_SHIFT (20U)
#define DDRPHY_RIDR_PHYMJR_GET(x) (((uint32_t)(x) & DDRPHY_RIDR_PHYMJR_MASK) >> DDRPHY_RIDR_PHYMJR_SHIFT)

/*
 * PHYMDR (R)
 *
