/*
 * Copyright (c) 2021-2024 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_ADC16_H
#define HPM_ADC16_H

typedef struct {
    __RW uint32_t CONFIG[12];                  /* 0x0 - 0x2C:  */
    __RW uint32_t TRG_DMA_ADDR;                /* 0x30:  */
    __RW uint32_t TRG_SW_STA;                  /* 0x34:  */
    __R  uint8_t  RESERVED0[968];              /* 0x38 - 0x3FF: Reserved */
    __R  uint32_t BUS_RESULT[16];              /* 0x400 - 0x43C:  */
    __R  uint8_t  RESERVED1[192];              /* 0x440 - 0x4FF: Reserved */
    __RW uint32_t BUF_CFG0;                    /* 0x500:  */
    __R  uint8_t  RESERVED2[764];              /* 0x504 - 0x7FF: Reserved */
    __RW uint32_t SEQ_CFG0;                    /* 0x800:  */
    __RW uint32_t SEQ_DMA_ADDR;                /* 0x804:  */
    __R  uint32_t SEQ_WR_ADDR;                 /* 0x808:  */
    __RW uint32_t SEQ_DMA_CFG;                 /* 0x80C:  */
    __RW uint32_t SEQ_QUE[16];                 /* 0x810 - 0x84C:  */
    __RW uint32_t SEQ_HIGH_CFG;                /* 0x850:  */
    __R  uint8_t  RESERVED3[940];              /* 0x854 - 0xBFF: Reserved */
    struct {
        __RW uint32_t PRD_CFG;                 /* 0xC00:  */
        __RW uint32_t PRD_THSHD_CFG;           /* 0xC04:  */
        __R  uint32_t PRD_RESULT;              /* 0xC08:  */
        __R  uint8_t  RESERVED0[4];            /* 0xC0C - 0xC0F: Reserved */
    } PRD_CFG[16];
    __R  uint8_t  RESERVED4[768];              /* 0xD00 - 0xFFF: Reserved */
    __RW uint32_t SAMPLE_CFG[16];              /* 0x1000 - 0x103C:  */
    __R  uint8_t  RESERVED5[196];              /* 0x1040 - 0x1103: Reserved */
    __RW uint32_t CONV_CFG1;                   /* 0x1104:  */
    __RW uint32_t ADC_CFG0;                    /* 0x1108:  */
    __R  uint8_t  RESERVED6[4];                /* 0x110C - 0x110F: Reserved */
    __RW uint32_t INT_STS;                     /* 0x1110:  */
    __RW uint32_t INT_EN;                      /* 0x1114:  */
    __R  uint8_t  RESERVED7[232];              /* 0x1118 - 0x11FF: Reserved */
    __RW uint32_t ANA_CTRL0;                   /* 0x1200:  */
    __R  uint8_t  RESERVED8[12];               /* 0x1204 - 0x120F: Reserved */
    __RW uint32_t ANA_STATUS;                  /* 0x1210:  */
    __R  uint8_t  RESERVED9[492];              /* 0x1214 - 0x13FF: Reserved */
    __RW uint16_t ADC16_PARAMS[34];            /* 0x1400 - 0x1442:  */
    __RW uint32_t ADC16_CONFIG0;               /* 0x1444:  */
    __R  uint8_t  RESERVED10[24];              /* 0x1448 - 0x145F: Reserved */
    __RW uint32_t ADC16_CONFIG1;               /* 0x1460:  */
} ADC16_Type;


/* Bitfield definition for register array: CONFIG */
/*
 * TRIG_LEN (WO)
 *
 * length for current trigger, can up to 4 conversions for one trigger, from 0 to 3
 */
#define ADC16_CONFIG_TRIG_LEN_MASK (0xC0000000UL)
#define ADC16_CONFIG_TRIG_LEN_SHIFT (30U)
#define ADC16_CONFIG_TRIG_LEN_SET(x) (((uint32_t)(x) << ADC16_CONFIG_TRIG_LEN_SHIFT) & ADC16_CONFIG_TRIG_LEN_MASK)
#define ADC16_CONFIG_TRIG_LEN_GET(x) (((uint32_t)(x) & ADC16_CONFIG_TRIG_LEN_MASK) >> ADC16_CONFIG_TRIG_LEN_SHIFT)

/*
 * INTEN3 (RW)
 *
 * interrupt enable for 4th conversion
 */
#define ADC16_CONFIG_INTEN3_MASK (0x20000000UL)
#define ADC16_CONFIG_INTEN3_SHIFT (29U)
#define ADC16_CONFIG_INTEN3_SET(x) (((uint32_t)(x) << ADC16_CONFIG_INTEN3_SHIFT) & ADC16_CONFIG_INTEN3_MASK)
#define ADC16_CONFIG_INTEN3_GET(x) (((uint32_t)(x) & ADC16_CONFIG_INTEN3_MASK) >> ADC16_CONFIG_INTEN3_SHIFT)

/*
 * CHAN3 (RW)
 *
 * channel number for 4th conversion
 */
