/*
 * Copyright (c) 2021-2024 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_MIPI_CSI_PHY_H
#define HPM_MIPI_CSI_PHY_H

typedef struct {
    __RW uint32_t SOFT_RST;                    /* 0x0: soft reset control */
    __RW uint32_t PHY_RCAL;                    /* 0x4: dphy resistor calibration */
    __RW uint32_t ULP_RX_EN;                   /* 0x8: enable lprx and ulprx */
    __R  uint32_t VOFFCAL_OUT;                 /* 0xC: hs-rx dc-offset auto-calibration results */
    __RW uint32_t CSI_CTL01;                   /* 0x10: dphy hardcore control */
    __RW uint32_t CSI_CTL23;                   /* 0x14: dphy hardcore control */
    __R  uint8_t  RESERVED0[4];                /* 0x18 - 0x1B: Reserved */
    __RW uint32_t CSI_VINIT;                   /* 0x1C: ulp lp-rx input threshold voltage trimming for data lane */
    __RW uint32_t CLANE_PARA;                  /* 0x20: clock lane parameter */
    __RW uint32_t T_HS_TERMEN;                 /* 0x24: t-termen of all datalane */
    __RW uint32_t T_HS_SETTLE;                 /* 0x28: t-settle of all data lanes */
    __R  uint8_t  RESERVED1[4];                /* 0x2C - 0x2F: Reserved */
    __RW uint32_t T_CLANE_INIT;                /* 0x30: t-init of clock lane */
    __RW uint32_t T_LANE_INIT0;                /* 0x34: t-init of data lane0 */
    __RW uint32_t T_LANE_INIT1;                /* 0x38: t-init of data lane1 */
    __R  uint8_t  RESERVED2[8];                /* 0x3C - 0x43: Reserved */
    __RW uint32_t TLPX_CTRL;                   /* 0x44: the time of tlpx_ctrl of all lane */
    __RW uint32_t NE_SWAP;                     /* 0x48: lane swap and dp/dn swap select */
    __RW uint32_t MISC_INFO;                   /* 0x4C: misc info of dphyrx_pcs control */
    __R  uint8_t  RESERVED3[32];               /* 0x50 - 0x6F: Reserved */
    __RW uint32_t BIST_TEST0;                  /* 0x70: bist test control */
    __RW uint32_t BIST_TEST1;                  /* 0x74: bist test control */
    __RW uint32_t BIST_TEST2;                  /* 0x78: bist test control */
    __R  uint32_t BIST_TEST3;                  /* 0x7C: bist test control */
    __R  uint8_t  RESERVED4[32];               /* 0x80 - 0x9F: Reserved */
    __RW uint32_t BURN_IN_TEST0;               /* 0xA0: burn-in test control */
    __RW uint32_t BURN_IN_TEST1;               /* 0xA4: burn-in test control */
    __R  uint32_t BURN_IN_TEST2;               /* 0xA8: bist test control */
    __R  uint8_t  RESERVED5[4];                /* 0xAC - 0xAF: Reserved */
    __R  uint32_t BURN_IN_TEST4;               /* 0xB0: bist test control */
    __R  uint32_t BURN_IN_TEST5;               /* 0xB4: burn-in test control */
    __R  uint32_t BURN_IN_TEST6;               /* 0xB8: burn-in test control */
    __R  uint8_t  RESERVED6[8];                /* 0xBC - 0xC3: Reserved */
    __R  uint32_t BURN_IN_TEST9;               /* 0xC4: burn-in test control */
    __R  uint8_t  RESERVED7[8];                /* 0xC8 - 0xCF: Reserved */
    __RW uint32_t DEBUG_INFO;                  /* 0xD0: debug data control */
    __RW uint32_t DEBUG_CFG_REG0;              /* 0xD4: the hardcore interface control in debug mode */
    __RW uint32_t DEBUG_CFG_REG1;              /* 0xD8: the hardcore interface control in debug mode */
    __R  uint8_t  RESERVED8[3126];             /* 0xDC - 0xD11: Reserved */
    __RW uint32_t DEBUG_CFG_REG2;              /* 0xD12: the hardcore interface control in debug mode */
    __RW uint32_t DEBUG_CFG_REG3;              /* 0xD16: the hardcore interface control in debug mode */
    __R  uint8_t  RESERVED9[6];                /* 0xD1A - 0xD1F: Reserved */
    __RW uint32_t DEBUG_CFG_REG4;              /* 0xD20: the hardcore interface control in debug mode */
    __RW uint32_t DEBUG_CFG_REG5;              /* 0xD24: the hardcore interface control in debug mode */
} MIPI_CSI_PHY_Type;


/* Bitfield definition for register: SOFT_RST */
/*
 * HS_CLK_SOFT_RST (RW)
 *
 * the soft reset of clk_hs domain
 */
#define MIPI_CSI_PHY_SOFT_RST_HS_CLK_SOFT_RST_MASK (0x2U)
#define MIPI_CSI_PHY_SOFT_RST_HS_CLK_SOFT_RST_SHIFT (1U)
#define MIPI_CSI_PHY_SOFT_RST_HS_CLK_SOFT_RST_SET(x) (((uint32_t)(x) << MIPI_CSI_PHY_SOFT_RST_HS_CLK_SOFT_RST_SHIFT) & MIPI_CSI_PHY_SOFT_RST_HS_CLK_SOFT_RST_MASK)
#define MIPI_CSI_PHY_SOFT_RST_HS_CLK_SOFT_RST_GET(x) (((uint32_t)(x) & MIPI_CSI_PHY_SOFT_RST_HS_CLK_SOFT_RST_MASK) >> MIPI_CSI_PHY_SOFT_RST_HS_CLK_SOFT_RST_SHIFT)

/*
 * CFG_CLK_SOFT_RST (RW)
 *
 * the soft reset of clk_cfg domain
 */
#define MIPI_CSI_PHY_SOFT_RST_CFG_CLK_SOFT_RST_MASK (0x1U)
#define MIPI_CSI_PHY_SOFT_RST_CFG_CLK_SOFT_RST_SHIFT (0U)
