/*
 * Copyright (c) 2021-2024 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_PIXELMUX_H
#define HPM_PIXELMUX_H

typedef struct {
    __RW uint32_t PIXMUX;                      /* 0x0: pixel path mux register */
    __RW uint32_t DSI_SETTING[2];              /* 0x4 - 0x8: DSI0 config register */
    __RW uint32_t MISC;                        /* 0xC: common register */
    __RW uint32_t GPR_WR_D0;                   /* 0x10: gpr write-read register 0 */
    __RW uint32_t GPR_WR_D1;                   /* 0x14: gpr write-read register 1 */
    __RW uint32_t GPR_WR_D2;                   /* 0x18: gpr write-read register 2 */
    __RW uint32_t GPR_WR_D3;                   /* 0x1C: gpr write-read register 3 */
    __RW uint32_t GPR_WR_D4;                   /* 0x20: gpr write-read register 4 */
    __RW uint32_t GPR_WR_D5;                   /* 0x24: gpr write-read register 5 */
    __RW uint32_t GPR_WR_D6;                   /* 0x28: gpr write-read register 6 */
    __RW uint32_t GPR_WR_D7;                   /* 0x2C: gpr write-read register 7 */
    __RW uint32_t GPR_WR_D8;                   /* 0x30: gpr write-read register 8 */
    __RW uint32_t GPR_WR_D9;                   /* 0x34: gpr write-read register 9 */
    __R  uint32_t GPR_RO_D0;                   /* 0x38: gpr read-only register 0 */
    __R  uint32_t GPR_RO_D1;                   /* 0x3C: gpr read-only register 1 */
    __R  uint32_t GPR_RO_D2;                   /* 0x40: gpr read-only register 2 */
    __R  uint32_t GPR_RO_D3;                   /* 0x44: gpr read-only register 3 */
    __R  uint32_t GPR_RO_D4;                   /* 0x48: gpr read-only register 4 */
    __R  uint32_t GPR_RO_D5;                   /* 0x4C: gpr read-only register 5 */
    __R  uint32_t GPR_RO_D6;                   /* 0x50: gpr read-only register 6 */
    __R  uint32_t GPR_RO_D7;                   /* 0x54: gpr read-only register 7 */
    __R  uint32_t GPR_RO_D8;                   /* 0x58: gpr read-only register 8 */
    __R  uint32_t GPR_RO_D9;                   /* 0x5C: gpr read-only register 9 */
    __RW uint32_t GPR_WR1_CLR_D0;              /* 0x60: gpr write1 set/no-write clr register */
} PIXELMUX_Type;


/* Bitfield definition for register: PIXMUX */
/*
 * RGB_EN (RW)
 *
 * RGB pixel bus enable
 */
#define PIXELMUX_PIXMUX_RGB_EN_MASK (0x20000000UL)
#define PIXELMUX_PIXMUX_RGB_EN_SHIFT (29U)
#define PIXELMUX_PIXMUX_RGB_EN_SET(x) (((uint32_t)(x) << PIXELMUX_PIXMUX_RGB_EN_SHIFT) & PIXELMUX_PIXMUX_RGB_EN_MASK)
#define PIXELMUX_PIXMUX_RGB_EN_GET(x) (((uint32_t)(x) & PIXELMUX_PIXMUX_RGB_EN_MASK) >> PIXELMUX_PIXMUX_RGB_EN_SHIFT)

/*
 * RGB_SEL (RW)
 *
 * RGB pixel bus selection
 * 1: LCDC1
 * 0: LCDC0
 */
#define PIXELMUX_PIXMUX_RGB_SEL_MASK (0x10000000UL)
#define PIXELMUX_PIXMUX_RGB_SEL_SHIFT (28U)
#define PIXELMUX_PIXMUX_RGB_SEL_SET(x) (((uint32_t)(x) << PIXELMUX_PIXMUX_RGB_SEL_SHIFT) & PIXELMUX_PIXMUX_RGB_SEL_MASK)
#define PIXELMUX_PIXMUX_RGB_SEL_GET(x) (((uint32_t)(x) & PIXELMUX_PIXMUX_RGB_SEL_MASK) >> PIXELMUX_PIXMUX_RGB_SEL_SHIFT)

/*
 * GWC1_EN (RW)
 *
