/*
 * Copyright (c) 2021-2024 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_MIPI_DSI_H
#define HPM_MIPI_DSI_H

typedef struct {
    __R  uint32_t VERSION;                     /* 0x0: version */
    __RW uint32_t PWR_UP;                      /* 0x4: power up */
    __RW uint32_t CLKMGR_CFG;                  /* 0x8: divide lanebyteclk for timeout */
    __RW uint32_t DPI_VCID;                    /* 0xC: virtual channel ID for DPI traffic */
    __RW uint32_t DPI_COLOR_CODING;            /* 0x10: dpi color coding */
    __RW uint32_t DPI_CFG_POL;                 /* 0x14: the polarity of DPI signals */
    __RW uint32_t DPI_LP_CMD_TIM;              /* 0x18: the timing for low-power commands sent while in video mode */
    __R  uint8_t  RESERVED0[16];               /* 0x1C - 0x2B: Reserved */
    __RW uint32_t PCKHDL_CFG;                  /* 0x2C: configures how EoTp, BTA, CRC and ECC to be used */
    __RW uint32_t GEN_VCID;                    /* 0x30: configures the virtual channel ID of read response to store and return to generic interface */
    __RW uint32_t MODE_CFG;                    /* 0x34: configures the mode of operation between video or command mode */
    __RW uint32_t VID_MODE_CFG;                /* 0x38: several aspect of video mode operation */
    __RW uint32_t VID_PKT_SIZE;                /* 0x3C: configures the video packet size */
    __RW uint32_t VID_NUM_CHUNKS;              /* 0x40: configures the number of chunks to use */
    __RW uint32_t VID_NULL_SIZE;               /* 0x44: configures the size of null packets */
    __RW uint32_t VID_HSA_TIME;                /* 0x48: configures the video HAS time */
    __RW uint32_t VID_HBP_TIME;                /* 0x4C: configure the video HBP time */
    __RW uint32_t VID_HLINE_TIME;              /* 0x50: configures the overall time for each video line */
    __RW uint32_t VID_VSA_LINES;               /* 0x54: configures the vsa period */
    __RW uint32_t VID_VBP_LINES;               /* 0x58: configures the vbp period */
    __RW uint32_t VID_VFP_LINES;               /* 0x5C: configures the vfp period */
    __RW uint32_t VID_VACTIVE_LINES;           /* 0x60: configures the vertical resolution of video */
    __R  uint8_t  RESERVED1[4];                /* 0x64 - 0x67: Reserved */
    __RW uint32_t CMD_MODE_CFG;                /* 0x68: This register configures several aspect of command mode operation, tearing effect, acknowledge for each packet and the speed mode to transmit each Data Type related to commands. */
    __RW uint32_t GEN_HDR;                     /* 0x6C: sets the header for new packets sent using the generic interface */
    __RW uint32_t GEN_PLD_DATA;                /* 0x70: sets the payload for packets sent using the generic interface */
    __R  uint32_t CMD_PKT_STATUS;              /* 0x74: information about the status of FIFOs related to DBI and Generic interface */
    __RW uint32_t TO_CNT_CFG;                  /* 0x78: configures the trigger timeout errors */
    __RW uint32_t HS_RD_TO_CNT;                /* 0x7C: configures the peripheral response timeout after high speed read operations */
    __RW uint32_t LP_RD_TO_CNT;                /* 0x80: configures the peripheral response timeout after low-power read operation */
    __RW uint32_t HS_WR_TO_CNT;                /* 0x84: configures the peripheral response timeout after high speed write operations */
    __RW uint32_t LP_WR_TO_CNT;                /* 0x88: configures the peripheral response timeout after low power write operations */
    __RW uint32_t BTA_TO_CNT;                  /* 0x8C: configures the periphera response timeout after bus turnaround */
    __RW uint32_t SDF_3D;                      /* 0x90: sotres 3d control information for vss packets in video mode */
    __RW uint32_t LPCLK_CTRL;                  /* 0x94: configures the possibility for using non continuous clock in the clock lane */
    __RW uint32_t PHY_TMR_LPCLK_CFG;           /* 0x98: sets the time that dsi host assumes in calculations for the clock lane to switch between high-speed and low-power */
    __RW uint32_t PHY_TMR_CFG;                 /* 0x9C: sets the time that dsi host assumes in calculations for data lanes to switch between hs to lp */
    __RW uint32_t PHY_RSTZ;                    /* 0xA0: controls resets and the pll of d-phy */
    __RW uint32_t PHY_IF_CFG;                  /* 0xA4: configures the number of active lanes */
    __RW uint32_t PHY_ULPS_CTRL;               /* 0xA8: configures entering and leaving ulps */
    __RW uint32_t PHY_TX_TRIGGERS;             /* 0xAC: configures the pins that activate triggers in the d-phy */
    __R  uint32_t PHY_STATUS;                  /* 0xB0: contains information about the status of the d-phy */
    __RW uint32_t PHY_TST_CTRL0;               /* 0xB4: controls clock and clear pins of the d-phy vendor specific interface */
    __RW uint32_t PHY_TST_CTRL1;               /* 0xB8: controls data and enable pins of the d-phy */
    __R  uint32_t INT_ST0;                     /* 0xBC: controls the status of interrupt */
    __R  uint32_t INT_ST1;                     /* 0xC0: the interrupt source related to timeout etc */
    __RW uint32_t INT_MSK0;                    /* 0xC4: configures masks for the sources of interrupt that affec int_st0 */
    __RW uint32_t INT_MSK1;                    /* 0xC8: configures masks for int_st1 */
    __RW uint32_t PHY_CAL;                     /* 0xCC: controls the skew calibration of D-phy */
    __R  uint8_t  RESERVED2[8];                /* 0xD0 - 0xD7: Reserved */
    __RW uint32_t INT_FORCE0;                  /* 0xD8: forces that affect the int_st0 register */
    __RW uint32_t INT_FORCE1;                  /* 0xDC: forces interrupts that affect the int_st1 register */
    __R  uint8_t  RESERVED3[20];               /* 0xE0 - 0xF3: Reserved */
    __RW uint32_t PHY_TMR_RD;                  /* 0xF4: configures times related to PHY to perform some operations in lane byte clock cycle */
    __RW uint32_t AUTO_ULPS_MIN_TIME;          /* 0xF8: configures the minimum time required by phy between ulpsactivenot and ulpsexitreq for clock and data lane */
    __RW uint32_t PHY_MODE;                    /* 0xFC: select phy mode */
    __RW uint32_t VID_SHADOW_CTRL;             /* 0x100: controls dpi shadow feature */
    __R  uint8_t  RESERVED4[8];                /* 0x104 - 0x10B: Reserved */
    __R  uint32_t DPI_VCID_ACT;                /* 0x10C: holds the value that controller is using for DPI_VCID */
    __R  uint32_t DPI_COLOR_CODING_ACT;        /* 0x110: holds the value that controller is using for DPI_COLOR_CODING */
    __R  uint8_t  RESERVED5[4];                /* 0x114 - 0x117: Reserved */
    __R  uint32_t DPI_LP_CMD_TIM_ACT;          /* 0x118: holds value that controller is using for dpi_lp_cmd_time */
    __R  uint8_t  RESERVED6[28];               /* 0x11C - 0x137: Reserved */
    __R  uint32_t VID_MODE_CFG_ACT;            /* 0x138: holds value that controller is using for vid_mode_cfg */
    __R  uint32_t VID_PKT_SIZE_ACT;            /* 0x13C: holds value that controller is using for vid_pkt_size */
    __R  uint32_t VID_NUM_CHUNKS_ACT;          /* 0x140: holds value that controller is using for vid_num_chunks */
    __R  uint32_t VID_NULL_SIZE_ACT;           /* 0x144: holds the value that controller is using for vid_null_size */
    __R  uint32_t VID_HSA_TIME_ACT;            /* 0x148: the value of vid_hsa_time */
    __R  uint32_t VID_HBP_TIME_ACT;            /* 0x14C: the value that controller is using for vid_hbp_time */
    __R  uint32_t VID_HLINE_TIME_ACT;          /* 0x150: the value for vid_hline_time */
    __R  uint32_t VID_VSA_LINES_ACT;           /* 0x154: value for vid_vsa_lines */
    __R  uint32_t VID_VBP_LINES_ACT;           /* 0x158: value for vid_vbp_lines */
    __R  uint32_t VID_VFP_LINES_ACT;           /* 0x15C: value for vid_vfp_lines */
    __R  uint32_t VID_VACTIVE_LINES_ACT;       /* 0x160: value for vid_vactive_lines */
    __R  uint8_t  RESERVED7[4];                /* 0x164 - 0x167: Reserved */
    __R  uint32_t VID_PKT_STATUS;              /* 0x168: status of fifo related to dpi */
    __R  uint8_t  RESERVED8[36];               /* 0x16C - 0x18F: Reserved */
    __R  uint32_t SDF_3D_ACT;                  /* 0x190: value for sdf_3d */
} MIPI_DSI_Type;


/* Bitfield definition for register: VERSION */
/*
 * VERSION (RO)
 *
 * version of DSI
 */
#define MIPI_DSI_VERSION_VERSION_MASK (0xFFFFFFFFUL)
#define MIPI_DSI_VERSION_VERSION_SHIFT (0U)
#define MIPI_DSI_VERSION_VERSION_GET(x) (((uint32_t)(x) & MIPI_DSI_VERSION_VERSION_MASK) >> MIPI_DSI_VERSION_VERSION_SHIFT)

/* Bitfield definition for register: PWR_UP */
/*
 * SHUTDOWNZ (RW)
 *
 * 0x0: reset the core
 * 0x1: power up the core
 */
#define MIPI_DSI_PWR_UP_SHUTDOWNZ_MASK (0x1U)
#define MIPI_DSI_PWR_UP_SHUTDOWNZ_SHIFT (0U)
#define MIPI_DSI_PWR_UP_SHUTDOWNZ_SET(x) (((uint32_t)(x) << MIPI_DSI_PWR_UP_SHUTDOWNZ_SHIFT) & MIPI_DSI_PWR_UP_SHUTDOWNZ_MASK)
#define MIPI_DSI_PWR_UP_SHUTDOWNZ_GET(x) (((uint32_t)(x) & MIPI_DSI_PWR_UP_SHUTDOWNZ_MASK) >> MIPI_DSI_PWR_UP_SHUTDOWNZ_SHIFT)

/* Bitfield definition for register: CLKMGR_CFG */
/*
 * TO_CLK_DIVISION (RW)
 *
