/*
 * Copyright (c) 2021-2024 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_MIPI_CSI_H
#define HPM_MIPI_CSI_H

typedef struct {
    __R  uint32_t VERSION;                     /* 0x0: version code */
    __RW uint32_t N_LANES;                     /* 0x4: the number of active lanes */
    __RW uint32_t CSI2_RESETN;                 /* 0x8: the internal logic of the controller goes into the reset state when active */
    __R  uint32_t INT_ST_MAIN;                 /* 0xC: contains the stateus of individual interrupt sources */
    __RW uint32_t DATA_IDS_1;                  /* 0x10: programs data type fields for data ID monitors */
    __RW uint32_t DATA_IDS_2;                  /* 0x14: programs data type fields for data ID monitors */
    __R  uint8_t  RESERVED0[20];               /* 0x18 - 0x2B: Reserved */
    __R  uint32_t INT_ST_AP_MAIN;              /* 0x2C: contains the status of individual interrupt sources */
    __R  uint8_t  RESERVED1[16];               /* 0x30 - 0x3F: Reserved */
    __RW uint32_t PHY_SHUTDOWNZ;               /* 0x40: controls the phy shutdown mode */
    __RW uint32_t DPHY_RSTZ;                   /* 0x44: controls the phy reset mode */
    __R  uint32_t PHY_RX;                      /* 0x48: contains the status of rx-related signals from phy */
    __R  uint32_t PHY_STOPSTATE;               /* 0x4C: contains the stopstate signal status from phy */
    __R  uint8_t  RESERVED2[48];               /* 0x50 - 0x7F: Reserved */
    __RW uint32_t IPI_MODE;                    /* 0x80: selects how the ipi interface generates the video frame */
    __RW uint32_t IPI_VCID;                    /* 0x84: selects the vritual channel processed by ipi */
    __RW uint32_t IPI_DATA_TYPE;               /* 0x88: selects the data type processed by ipi */
    __RW uint32_t IPI_MEM_FLASH;               /* 0x8C: control the flush of ipi memory */
    __RW uint32_t IPI_HSA_TIME;                /* 0x90: configures the video horizontal synchronism active time */
    __RW uint32_t IPI_HBP_TIME;                /* 0x94: configures the video horizontal synchronism back porch time */
    __RW uint32_t IPI_HSD_TIME;                /* 0x98: configures the vedeo Horizontal Sync Delay time */
    __RW uint32_t IPI_HLINE_TIME;              /* 0x9C: configures the overall tiem for each video line */
    __RW uint32_t IPI_SOFTRSTN;                /* 0xA0: congtrols the ipi logic reset state */
    __R  uint8_t  RESERVED3[8];                /* 0xA4 - 0xAB: Reserved */
    __RW uint32_t IPI_ADV_FEATURES;            /* 0xAC: configures advanced features for ipi mode */
    __RW uint32_t IPI_VSA_LINES;               /* 0xB0: configures the vertical synchronism active period */
    __RW uint32_t IPI_VBP_LINES;               /* 0xB4: configures the verticall back porch period */
    __RW uint32_t IPI_VFP_LINES;               /* 0xB8: configures the vertical front porch period */
    __RW uint32_t IPI_VACTIVE_LINES;           /* 0xBC: configures the vertical resolution of video */
    __R  uint8_t  RESERVED4[8];                /* 0xC0 - 0xC7: Reserved */
    __RW uint32_t VC_EXTENSION;                /* 0xC8: active extra bits for virtual channel */
    __R  uint32_t PHY_CAL;                     /* 0xCC: contains the calibration signal status from synopsys d-phy */
    __R  uint8_t  RESERVED5[16];               /* 0xD0 - 0xDF: Reserved */
    __R  uint32_t INT_ST_PHY_FATAL;            /* 0xE0: groups the phy interruptions caused by phy packets discarded */
    __RW uint32_t INT_MSK_PHY_FATAL;           /* 0xE4: interrupt mask for int_st_phy_fatal */
    __RW uint32_t INT_FORCE_PHY_FATAL;         /* 0xE8: interrupt force register for test purposes */
    __R  uint8_t  RESERVED6[4];                /* 0xEC - 0xEF: Reserved */
    __R  uint32_t INT_ST_PKT_FATAL;            /* 0xF0: groups the fatal interruption related with packet construction */
    __RW uint32_t INT_MSK_PKT_FATAL;           /* 0xF4: interrupt mask for int_st_pkt_fatal */
    __RW uint32_t INT_FORCE_PKT_FATAL;         /* 0xF8: interrupt force register is used for test purpos */
    __R  uint8_t  RESERVED7[20];               /* 0xFC - 0x10F: Reserved */
    __R  uint32_t INT_ST_PHY;                  /* 0x110: interruption caused by phy */
    __RW uint32_t INT_MSK_PHY;                 /* 0x114: interrupt mask for int_st_phy */
    __RW uint32_t INT_FORCE_PHY;               /* 0x118: interrupt force register */
    __R  uint8_t  RESERVED8[36];               /* 0x11C - 0x13F: Reserved */
    __R  uint32_t INT_ST_IPI_FATAL;            /* 0x140: fatal interruption caused by ipi interface */
    __RW uint32_t INT_MSK_IPI_FATAL;           /* 0x144: interrupt mask for int_st_ipi_fatal */
    __RW uint32_t INT_FORCE_IPI_FATAL;         /* 0x148: interrupt force register */
    __R  uint8_t  RESERVED9[52];               /* 0x14C - 0x17F: Reserved */
    __R  uint32_t INT_ST_AP_GENERIC;           /* 0x180: groups and notifies which interruption bits caused the interruption */
    __RW uint32_t INT_MSK_AP_GENERIC;          /* 0x184: interrupt mask for int_st_ap_generic */
    __RW uint32_t INT_FORCE_AP_GENERIC;        /* 0x188: interrupt force register used for test purposes */
    __R  uint8_t  RESERVED10[4];               /* 0x18C - 0x18F: Reserved */
    __R  uint32_t INT_ST_AP_IPI_FATAL;         /* 0x190: groups and notifies which interruption bits */
    __R  uint32_t INT_MSK_AP_IPI_FATAL;        /* 0x194: interrupt mask for int_st_ap_ipi_fatal controls */
    __R  uint32_t INT_FORCE_AP_IPI_FATAL;      /* 0x198: interrupt force register */
    __R  uint8_t  RESERVED11[228];             /* 0x19C - 0x27F: Reserved */
    __R  uint32_t INT_ST_BNDRY_FRAME_FATAL;    /* 0x280: fatal interruption related with matching frame start with frame end for a specific virtual channel */
    __RW uint32_t INT_MSK_BNDRY_FRAME_FATAL;   /* 0x284: interrupt mask for int_st_bndry_frame_fatal */
    __RW uint32_t INT_FORCE_BNDRY_FRAME_FATAL; /* 0x288: interrupt force register is used for test purposes */
    __R  uint8_t  RESERVED12[4];               /* 0x28C - 0x28F: Reserved */
    __R  uint32_t INT_ST_SEQ_FRAME_FATAL;      /* 0x290: fatal interruption related with matching frame start with frame end for a specific virtual channel */
    __RW uint32_t INT_MSK_SEQ_FRAME_FATAL;     /* 0x294: interrupt mask for int_st_seq_frame_fatal */
    __RW uint32_t INT_FORCE_SEQ_FRAME_FATAL;   /* 0x298: interrupt force register is used for test purposes */
    __R  uint8_t  RESERVED13[4];               /* 0x29C - 0x29F: Reserved */
    __R  uint32_t INT_ST_CRC_FRAME_FATAL;      /* 0x2A0: fatal interruption related with matching frame start with frame end for a specific virtual channel */
    __RW uint32_t INT_MSK_CRC_FRAME_FATAL;     /* 0x2A4: interrupt mask for int_st_crc_frame_fatal */
    __RW uint32_t INT_FORCE_CRC_FRAME_FATAL;   /* 0x2A8: interrupt force register is used for test purposes */
    __R  uint8_t  RESERVED14[4];               /* 0x2AC - 0x2AF: Reserved */
    __R  uint32_t INT_ST_PLD_CRC_FRAME_FATAL;  /* 0x2B0: fatal interruption related with matching frame start with frame end for a specific virtual channel */
    __RW uint32_t INT_MSK_PLD_CRC_FRAME_FATAL; /* 0x2B4: interrupt mask for int_st_crc_frame_fatal */
    __RW uint32_t INT_FORCE_PLD_CRC_FRAME_FATAL; /* 0x2B8: interrupt force register is used for test purposes */
} MIPI_CSI_Type;


/* Bitfield definition for register: VERSION */
/*
 * VERSION (RO)
 *
 * version code
 */
#define MIPI_CSI_VERSION_VERSION_MASK (0xFFFFFFFFUL)
#define MIPI_CSI_VERSION_VERSION_SHIFT (0U)
#define MIPI_CSI_VERSION_VERSION_GET(x) (((uint32_t)(x) & MIPI_CSI_VERSION_VERSION_MASK) >> MIPI_CSI_VERSION_VERSION_SHIFT)

/* Bitfield definition for register: N_LANES */
/*
 * N_LANES (RW)
 *
 * number of active data lanes
 */
#define MIPI_CSI_N_LANES_N_LANES_MASK (0x7U)
#define MIPI_CSI_N_LANES_N_LANES_SHIFT (0U)
#define MIPI_CSI_N_LANES_N_LANES_SET(x) (((uint32_t)(x) << MIPI_CSI_N_LANES_N_LANES_SHIFT) & MIPI_CSI_N_LANES_N_LANES_MASK)
#define MIPI_CSI_N_LANES_N_LANES_GET(x) (((uint32_t)(x) & MIPI_CSI_N_LANES_N_LANES_MASK) >> MIPI_CSI_N_LANES_N_LANES_SHIFT)

/* Bitfield definition for register: CSI2_RESETN */
/*
 * CSI2_RESETN (RW)
 *
