/*
 * Copyright (c) 2021-2024 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_GPU_H
#define HPM_GPU_H

typedef struct {
    __RW uint32_t AQHICLOCKCONTROL;            /* 0x0: clock control register */
    __R  uint32_t AQHILDLE;                    /* 0x4: idle status register */
    __R  uint8_t  RESERVED0[8];                /* 0x8 - 0xF: Reserved */
    __R  uint32_t AQINTRACKNOWLEDGE;           /* 0x10: interrupt acknoledge register */
    __RW uint32_t AQINTRENBL;                  /* 0x14: interrupt enable register */
    __R  uint8_t  RESERVED1[12];               /* 0x18 - 0x23: Reserved */
    __R  uint32_t GCCHIPREV;                   /* 0x24: chip revison register */
    __R  uint32_t GCCHIPDATE;                  /* 0x28: chip date register */
    __R  uint8_t  RESERVED2[108];              /* 0x2C - 0x97: Reserved */
    __R  uint32_t GCREGHICHIPPATCHREV;         /* 0x98: chip patch revision register */
    __R  uint8_t  RESERVED3[12];               /* 0x9C - 0xA7: Reserved */
    __R  uint32_t GCPRODUCTID;                 /* 0xA8: product identification register */
    __R  uint8_t  RESERVED4[84];               /* 0xAC - 0xFF: Reserved */
    __RW uint32_t GCMODULEPOWERCONTROLS;       /* 0x100: module power control register */
    __RW uint32_t GCMODULEPOWERMODULECONTROL;  /* 0x104: module power module control register */
    __R  uint32_t GCMODULEPOWERMODULESTATUS;   /* 0x108: module power module status register */
    __R  uint8_t  RESERVED5[756];              /* 0x10C - 0x3FF: Reserved */
    __RW uint32_t AQMEMORYFEPAGETABLE;         /* 0x400: fetch engine page table base address register */
    __R  uint8_t  RESERVED6[16];               /* 0x404 - 0x413: Reserved */
    __RW uint32_t AQMEMORYDEBUG;               /* 0x414: memory debug register */
    __R  uint8_t  RESERVED7[20];               /* 0x418 - 0x42B: Reserved */
    __RW uint32_t AQREGISTERTIMINGCONTROL;     /* 0x42C: timing control register */
    __R  uint8_t  RESERVED8[208];              /* 0x430 - 0x4FF: Reserved */
    __RW uint32_t GCREGFETCHADDRESS;           /* 0x500: fetch command buffer base address register */
    __RW uint32_t GCREGFETCHCONTROL;           /* 0x504: fetch control register */
    __R  uint32_t GCREGCURRENTFETCHADDRESS;    /* 0x508: current fetch command address register */
} GPU_Type;


/* Bitfield definition for register: AQHICLOCKCONTROL */
/*
 * ISOLATE_GPU (RW)
 *
 * isolate GPU bit, used for power on/off
 */
#define GPU_AQHICLOCKCONTROL_ISOLATE_GPU_MASK (0x80000UL)
#define GPU_AQHICLOCKCONTROL_ISOLATE_GPU_SHIFT (19U)
#define GPU_AQHICLOCKCONTROL_ISOLATE_GPU_SET(x) (((uint32_t)(x) << GPU_AQHICLOCKCONTROL_ISOLATE_GPU_SHIFT) & GPU_AQHICLOCKCONTROL_ISOLATE_GPU_MASK)
#define GPU_AQHICLOCKCONTROL_ISOLATE_GPU_GET(x) (((uint32_t)(x) & GPU_AQHICLOCKCONTROL_ISOLATE_GPU_MASK) >> GPU_AQHICLOCKCONTROL_ISOLATE_GPU_SHIFT)

/*
 * IDLE_VG (R)
 *
 * vg pipe is idle
 */
#define GPU_AQHICLOCKCONTROL_IDLE_VG_MASK (0x40000UL)
#define GPU_AQHICLOCKCONTROL_IDLE_VG_SHIFT (18U)
#define GPU_AQHICLOCKCONTROL_IDLE_VG_GET(x) (((uint32_t)(x) & GPU_AQHICLOCKCONTROL_IDLE_VG_MASK) >> GPU_AQHICLOCKCONTROL_IDLE_VG_SHIFT)

/*
 * IDLE2_D (R)
 *
 * 2D pipe is idle or not present
 */
