/*
 * Copyright (c) 2021-2024 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_MIPI_DSI_PHY_H
#define HPM_MIPI_DSI_PHY_H

typedef struct {
    __RW uint32_t CLANE_PARA0;                 /* 0x0: timer counter about clock lane parameter */
    __RW uint32_t CLANE_PARA1;                 /* 0x4: timer counter about clock lane parameter */
    __RW uint32_t CLANE_PARA2;                 /* 0x8: timer counter about clock lane parameter */
    __RW uint32_t CLANE_PARA3;                 /* 0xC: timer counter about clock lane parameter */
    __RW uint32_t DLANE0_PARA0;                /* 0x10: timer counter about datalane0 parameter */
    __RW uint32_t DLANE0_PARA1;                /* 0x14: timer counter about datalane0 parameter */
    __RW uint32_t DLANE0_PARA2;                /* 0x18: timer counter about datalane0 parameter */
    __RW uint32_t DLANE0_PARA3;                /* 0x1C: timer counter about datalane0 parameter */
    __RW uint32_t DLANE0_PARA4;                /* 0x20: timer counter about datalane0 parameter */
    __RW uint32_t DLANE1_PARA0;                /* 0x24: timer counter about datalane1 parameter */
    __RW uint32_t DLANE1_PARA1;                /* 0x28: timer counter about datalane1 parameter */
    __RW uint32_t DLANE1_PARA2;                /* 0x2C: timer counter about datalane1 parameter */
    __RW uint32_t DLANE1_PARA3;                /* 0x30: timer counter about datalane1 parameter */
    __RW uint32_t DLANE2_PARA0;                /* 0x34: timer counter about datalane2 parameter */
    __RW uint32_t DLANE2_PARA1;                /* 0x38: timer counter about datalane2 parameter */
    __RW uint32_t DLANE2_PARA2;                /* 0x3C: timer counter about datalane2 parameter */
    __RW uint32_t DLANE2_PARA3;                /* 0x40: timer counter about datalane2 parameter */
    __RW uint32_t DLANE3_PARA0;                /* 0x44: timer counter about datalane3 parameter */
    __RW uint32_t DLANE3_PARA1;                /* 0x48: timer counter about datalane3 parameter */
    __RW uint32_t DLANE3_PARA2;                /* 0x4C: timer counter about datalane3 parameter */
    __RW uint32_t DLANE3_PARA3;                /* 0x50: timer counter about datalane3 parameter */
    __RW uint32_t COMMON_PARA0;                /* 0x54: timing parameter for all lanes */
    __RW uint32_t CTRL_PARA0;                  /* 0x58: dphy control parameter */
    __RW uint32_t PLL_CTRL_PARA0;              /* 0x5C: dphy pll control parameter */
    __R  uint8_t  RESERVED0[4];                /* 0x60 - 0x63: Reserved */
    __RW uint32_t RCAL_CTRL;                   /* 0x64: dphy calibration control parameter */
    __RW uint32_t TRIM_PARA;                   /* 0x68: dphy trimming parameter */
    __RW uint32_t TEST_PARA0;                  /* 0x6C: dphy test control parameter */
    __RW uint32_t TEST_PARA1;                  /* 0x70: dphy bist test control parameter */
    __RW uint32_t MISC_PARA;                   /* 0x74: dphy control parameter */
    __RW uint32_t CLANE_PARA4;                 /* 0x78: dphy clock lane control parameter */
    __RW uint32_t INTERFACE_PARA;              /* 0x7C: dphy clock lane control parameter */
    __RW uint32_t PCS_RESERVED_PIN_PARA;       /* 0x80: reserved the pins for pcs */
    __R  uint8_t  RESERVED1[8];                /* 0x84 - 0x8B: Reserved */
    __RW uint32_t CLANE_DATA_PARA;             /* 0x8C: parallel data about clock lane parameter */
    __RW uint32_t PMA_LANE_SEL_PARA;           /* 0x90: pma about clock lane select parameter */
} MIPI_DSI_PHY_Type;


/* Bitfield definition for register: CLANE_PARA0 */
/*
 * T_RST2ENLPTX_C (RW)
 *
 * the soft reset of clk_cfg domain
 */
#define MIPI_DSI_PHY_CLANE_PARA0_T_RST2ENLPTX_C_MASK (0xFFFFU)
#define MIPI_DSI_PHY_CLANE_PARA0_T_RST2ENLPTX_C_SHIFT (0U)
#define MIPI_DSI_PHY_CLANE_PARA0_T_RST2ENLPTX_C_SET(x) (((uint32_t)(x) << MIPI_DSI_PHY_CLANE_PARA0_T_RST2ENLPTX_C_SHIFT) & MIPI_DSI_PHY_CLANE_PARA0_T_RST2ENLPTX_C_MASK)
#define MIPI_DSI_PHY_CLANE_PARA0_T_RST2ENLPTX_C_GET(x) (((uint32_t)(x) & MIPI_DSI_PHY_CLANE_PARA0_T_RST2ENLPTX_C_MASK) >> MIPI_DSI_PHY_CLANE_PARA0_T_RST2ENLPTX_C_SHIFT)

/* Bitfield definition for register: CLANE_PARA1 */
/*
 * T_INITTIME_C (RW)
 *
 * the number of byteclk cycles that clklane drive LP-11 during initialization period
 */
#define MIPI_DSI_PHY_CLANE_PARA1_T_INITTIME_C_MASK (0xFFFFFFFFUL)
#define MIPI_DSI_PHY_CLANE_PARA1_T_INITTIME_C_SHIFT (0U)
