/*
 * Copyright (c) 2021-2023 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_JPEG_H
#define HPM_JPEG_H

typedef struct {
    __RW uint32_t INDMA_MISC;                  /* 0x0: In DMA Misc Control Register */
    __RW uint32_t INDMABASE;                   /* 0x4: In DMA Buf Address */
    __R  uint8_t  RESERVED0[4];                /* 0x8 - 0xB: Reserved */
    __RW uint32_t INDMA_CTRL0;                 /* 0xC: In DMA Buf Control 0 Register */
    __RW uint32_t INDMA_CTRL1;                 /* 0x10: In DMA Buf Control 1 Register */
    __RW uint32_t INXT_CMD;                    /* 0x14: In DMA Next Command Register */
    __R  uint8_t  RESERVED1[8];                /* 0x18 - 0x1F: Reserved */
    __RW uint32_t OUTDMA_MISC;                 /* 0x20: Out DMA Misc Control Register */
    __RW uint32_t OUTDMABASE;                  /* 0x24: Out DMA Buf Address */
    __R  uint8_t  RESERVED2[4];                /* 0x28 - 0x2B: Reserved */
    __RW uint32_t OUTDMA_CTRL0;                /* 0x2C: Out DMA Buf Control 0 Register */
    __RW uint32_t OUTDMA_CTRL1;                /* 0x30: Out DMA Buf Control 1 Register */
    __RW uint32_t ONXT_CMD;                    /* 0x34: Out DMA Next Command Register */
    __R  uint8_t  RESERVED3[8];                /* 0x38 - 0x3F: Reserved */
    __RW uint32_t CFG;                         /* 0x40: Configuration Register */
    __RW uint32_t STAT;                        /* 0x44: Status Register */
    __RW uint32_t WIDTH;                       /* 0x48: Image width register */
    __RW uint32_t HEIGHT;                      /* 0x4C: Image height register */
    __RW uint32_t BUFADDR;                     /* 0x50: Buf Access Addr */
    __RW uint32_t BUFDATA;                     /* 0x54: Buf Access Data */
    __R  uint32_t OUTDMACNT;                   /* 0x58: Out DMA Bytes Counter */
    __RW uint32_t CSC_COEF0;                   /* 0x5C: YUV2RGB coefficients Register 0 */
    __RW uint32_t CSC_COEF1;                   /* 0x60: YUV2RGB coefficients Register 1 */
    __RW uint32_t CSC_COEF2;                   /* 0x64: YUV2RGB coefficients Register 2 */
    __RW uint32_t RGB2YUV_COEF0;               /* 0x68: RGB2YUV coefficients Register 0 */
    __RW uint32_t RGB2YUV_COEF1;               /* 0x6C: RGB2YUV coefficients Register 1 */
    __RW uint32_t RGB2YUV_COEF2;               /* 0x70: RGB2YUV coefficients Register 2 */
    __RW uint32_t RGB2YUV_COEF3;               /* 0x74: RGB2YUV coefficients Register 3 */
    __RW uint32_t RGB2YUV_COEF4;               /* 0x78: RGB2YUV coefficients Register 4 */
    __R  uint8_t  RESERVED4[8];                /* 0x7C - 0x83: Reserved */
    __RW uint32_t IMGREG1;                     /* 0x84: Image Control Register 1 */
    __RW uint32_t IMGREG2;                     /* 0x88: Image Control Register 2 */
    __RW uint32_t IMGREG3;                     /* 0x8C: Image Control Register 3 */
    __RW uint32_t IMGREG[4];                   /* 0x90 - 0x9C: Image Control Register 40 */
} JPEG_Type;


/* Bitfield definition for register: INDMA_MISC */
/*
 * ARQOS (RW)
 *
 * QoS for AXI read channel
 */
#define JPEG_INDMA_MISC_ARQOS_MASK (0x780000UL)
#define JPEG_INDMA_MISC_ARQOS_SHIFT (19U)
#define JPEG_INDMA_MISC_ARQOS_SET(x) (((uint32_t)(x) << JPEG_INDMA_MISC_ARQOS_SHIFT) & JPEG_INDMA_MISC_ARQOS_MASK)
#define JPEG_INDMA_MISC_ARQOS_GET(x) (((uint32_t)(x) & JPEG_INDMA_MISC_ARQOS_MASK) >> JPEG_INDMA_MISC_ARQOS_SHIFT)

/*
 * MAX_OT (RW)
 *
 * max_ot when input are RGB pixels.
 * For 16 bits per pixel, it can be set as 4.
 * For 32 bits per pixel, it will be set as 2.
 */
#define JPEG_INDMA_MISC_MAX_OT_MASK (0x78000UL)
#define JPEG_INDMA_MISC_MAX_OT_SHIFT (15U)
#define JPEG_INDMA_MISC_MAX_OT_SET(x) (((uint32_t)(x) << JPEG_INDMA_MISC_MAX_OT_SHIFT) & JPEG_INDMA_MISC_MAX_OT_MASK)
