/*
 * Copyright (c) 2021-2023 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_PLA_H
#define HPM_PLA_H

typedef struct {
    struct {
        __RW uint32_t AOI_16TO8[8];            /* 0x0 - 0x1C: CHN AOI_16to8 AND logic cfg */
        __RW uint32_t AOI_8TO7_00_01;          /* 0x20: CHN AOI_16to8_00_01 OR logic cfg */
        __RW uint32_t AOI_8TO7_02_03;          /* 0x24: CHN AOI_16to8_02_03 OR logic cfg */
        __RW uint32_t AOI_8TO7_04_05;          /* 0x28: CHN AOI_16to8_04_05 OR logic cfg */
        __RW uint32_t AOI_8TO7_06;             /* 0x2C: CHN AOI_16to8_06 OR logic cfg */
        __RW uint32_t FILTER_2ND[8];           /* 0x30 - 0x4C: CHN SECOND_FILTER cfg */
        __RW uint32_t FILTER_3RD[7];           /* 0x50 - 0x68: CHN THIRD_FILTER cfg */
        __RW uint32_t CFG_FF;                  /* 0x6C: CHN cfg ff */
    } CHN[8];
    __R  uint8_t  RESERVED0[64];               /* 0x380 - 0x3BF: Reserved */
    __RW uint32_t FILTER_1ST_PLA_IN[8];        /* 0x3C0 - 0x3DC: FRIST_FILTER_PLA_IN setting */
    __RW uint32_t FILTER_1ST_PLA_OUT[8];       /* 0x3E0 - 0x3FC: FRIST_FILTER_PLA_OUT setting */
    __RW uint32_t CHN_CFG_ACTIVE[8];           /* 0x400 - 0x41C: CHN  cfg active */
} PLA_Type;


/* Bitfield definition for register of struct array CHN: AOI_16TO8_00 */
/*
 * AOI_16TO8_15 (RW)
 *
 * select value for AOI_16to8_15.
 * 0: 0.
 * 1: 1st_filter_out[15].
 * 2: ~1st_filter_out[15].
 * 3: 1
 */
#define PLA_CHN_AOI_16TO8_AOI_16TO8_15_MASK (0xC0000000UL)
#define PLA_CHN_AOI_16TO8_AOI_16TO8_15_SHIFT (30U)
#define PLA_CHN_AOI_16TO8_AOI_16TO8_15_SET(x) (((uint32_t)(x) << PLA_CHN_AOI_16TO8_AOI_16TO8_15_SHIFT) & PLA_CHN_AOI_16TO8_AOI_16TO8_15_MASK)
#define PLA_CHN_AOI_16TO8_AOI_16TO8_15_GET(x) (((uint32_t)(x) & PLA_CHN_AOI_16TO8_AOI_16TO8_15_MASK) >> PLA_CHN_AOI_16TO8_AOI_16TO8_15_SHIFT)

/*
 * AOI_16TO8_14 (RW)
 *
 * select value for AOI_16to8_14.
 * 0: 0.
 * 1: 1st_filter_out[14].
 * 2: ~1st_filter_out[14].
 * 3: 1
 */
#define PLA_CHN_AOI_16TO8_AOI_16TO8_14_MASK (0x30000000UL)
#define PLA_CHN_AOI_16TO8_AOI_16TO8_14_SHIFT (28U)
